2511
3432
1551
72884
V4963
9983
3090
4321
1610
30421
2890
1984
44029
2734
5852
7948
42091
E9356
8744
76525
4401
99669
86803
9975
4731
37739
2538
4422
2869
0416
3501
5952
52100
53291
243
7245
03842
78907
2189
4560
25071
V644
82021
5370
1986
4660
99657
7689
5110
6961
6929
05479
2112
3383
0270
78729
V1642
2125
E9447
V1259
412
1978
V6442
V4589
60091
6802
2777
2541
V053
1512
2841
71103
42983
0549
2781
340
78903
4610
45981
56211
7244
E8859
2900
73027
2779
4785
53200
70701
82130
7831
85300
78057
7771
566
33183
3591
92411
56989
E9308
74762
99639
4592
56962
00845
7755
43391
E8498
37632
V452
8242
85011
30550
30022
7463
42833
2572
78071
57420
3510
2409
7810
2720
41061
43813
42761
86350
44103
33818
70722
7461
38589
78652
5672
51882
27803
83100
E9504
V1529
60784
7905
87320
V556
5990
75617
80700
8056
85222
99762
V4576
4260
7706
4370
V552
V1046
6910
43311
42612
1912
76503
E8147
E8150
71531
34889
53561
3240
V1302
4353
99665
E8538
53240
7868
71106
V168
V433
3320
81408
80708
3373
5754
E9509
2387
53501
V122
0542
30483
7296
07044
1536
769
25052
27411
72889
E8543
25053
1940
8245
78839
2894
43330
7542
78551
5724
25080
53010
V1301
72972
V5862
58189
7904
1622
43411
47833
73026
3963
80172
80120
28984
53400
90089
41071
5988
43820
3249
3076
4372
V4976
3332
3314
56983
80501
138
1973
56789
77981
1179
37852
V4282
55321
74783
5304
82123
53100
E9378
5779
41091
25030
7821
0949
70723
587
99649
25051
9010
E8842
7833
V071
1707
3313
45386
E8532
68110
7213
23872
9598
4578
V1204
E9352
5695
6202
0785
51631
78959
E8528
78604
2793
2773
1625
44421
7292
7104
78605
4251
48242
53170
4786
5183
41032
1960
25031
79415
135
61172
E8796
3379
75312
29540
73005
45184
30749
V461
9072
490
75563
V1002
261
E8261
8260
27801
0388
29389
7776
V5416
57400
40501
59654
38861
45989
7513
72705
77089
76515
87343
1624
E956
8901
2144
5711
E8705
81510
5533
45620
07951
25011
56942
5902
1550
36281
30470
71105
7210
E8780
27800
5759
77989
5551
20800
34500
59080
36001
28529
4270
V5865
V0991
99662
36221
4568
78441
5691
85206
5738
5307
72400
27787
V551
78061
V600
41012
40591
3940
24291
7580
3449
5187
76501
8782
72141
3542
1603
72610
V4586
20021
99594
260
74710
20190
V1001
9971
2818
V1081
2710
5989
99709
73029
30563
2411
8872
7930
56982
5770
83402
28652
29680
80625
36960
45372
V427
5379
2638
74860
44481
43883
30751
4386
44329
73313
096
19882
1759
80508
71945
60889
1307
34600
4920
4279
25062
75251
36563
7599
5804
501
71509
1520
40390
4010
99591
7881
2939
V0482
6110
51919
2252
5780
319
5991
53081
V1201
V5339
585
11284
99883
25541
1534
59382
59589
E9323
1503
78607
20218
9663
03849
E9278
1820
20000
73008
4533
9033
2967
53089
4439
35981
2154
6822
E8171
V4281
V5391
6962
44022
E989
4940
80135
E8888
5856
4162
23871
2866
03812
29580
E8788
7945
37900
71430
2728
80114
V8801
3485
E9425
30540
7750
20500
7793
V422
1122
37005
4378
1541
07032
04082
V161
8605
49120
1519
2519
78931
99674
9993
V1252
7702
7852
23877
3315
V5843
6019
53560
4358
4536
7876
7262
E9343
99666
77084
3439
1121
V160
7051
72619
92232
45821
V721
30120
3553
2765
1125
2518
0340
1963
71695
37851
7235
52510
78821
99664
56731
2920
6821
20411
07051
53220
1874
99659
2940
20530
E887
E9364
88102
4821
56949
44030
6981
4413
9999
5789
E9358
2825
33399
9051
7861
V652
30300
99667
6826
72290
30500
59010
44101
42831
E9682
3331
1913
4476
34461
45385
8088
86330
37941
0382
5642
74510
V4972
V643
1892
6181
42832
E912
2441
40311
2520
77212
1976
4466
V4561
V3001
2448
2760
E9554
9524
34404
2126
99931
1918
E9392
262
28749
5768
27951
E9306
4958
80121
1508
V3100
E9426
30390
73390
0051
7211
E9804
7802
30430
80709
V444
07020
3594
71943
52801
23771
4169
4730
41001
27901
53019
75162
5298
78799
34580
V1051
V5849
72252
99832
5968
42611
7384
42971
V1251
7931
4590
0380
V554
7818
29410
11289
7717
82101
56200
5997
V4987
70714
7310
30928
30392
79311
7098
44281
34291
7048
78459
1715
8831
1965
37990
35789
3570
41092
7248
07811
1737
2794
73670
1251
7863
V1588
34401
72402
7840
7731
2721
78906
5581
7812
6039
74761
30981
6960
01803
01896
5710
V5867
V293
5259
7813
E8809
69589
39890
81100
9708
30501
6851
E9348
4571
45342
5409
1490
34550
4829
95200
78900
E9293
E8801
30503
4539
7892
1580
20281
24200
V0189
2898
30420
E9309
4558
E9307
43812
56981
41181
V463
34830
9190
34831
0074
5781
40599
E9503
8082
V1072
53500
V1507
449
99652
33811
28981
5647
22809
22804
04185
47811
2769
3238
70710
4550
05319
4441
4470
2874
53450
2554
42099
5963
5120
85202
V4361
V4582
73009
4280
4739
71595
1509
V5417
70706
3371
99593
4240
22801
1972
6823
71907
4580
71598
7070
71903
3009
42820
2971
E9331
2851
9050
V7651
28804
7570
5439
5224
56201
3970
41512
81341
E9398
44620
V8543
5831
36201
4371
4178
2749
04104
3099
2860
4659
41401
4870
8052
77183
42843
76491
78659
70400
25043
5305
9950
41042
03844
45189
V560
0971
1991
3082
4375
20283
4555
77082
0521
5730
28731
94800
V5883
81344
72291
57142
07041
20028
5969
V0259
71946
3572
7756
4801
1530
193
72813
E8160
56729
73722
99731
42741
71905
9623
07054
2713
5300
25002
V1254
79439
2768
04112
2819
45383
5680
96500
V4975
V290
58181
2930
E8499
1540
2273
317
29590
9690
53530
9711
7775
53782
78650
2459
72401
99881
5994
0701
37272
27503
7866
55329
4294
80604
53541
7512
2230
55221
E9305
80504
1720
2443
29572
1640
53781
1700
32341
57471
4380
1990
78199
7942
41041
2867
E8799
0498
1891
5932
34591
07031
22802
42760
570
3576
5723
E8783
7038
58089
73018
2732
29520
27651
74687
34290
92320
4168
5562
8820
2599
78052
43811
E8781
7135
28522
6954
3552
30523
4460
9331
49391
37652
28860
7295
6988
2535
30000
3241
2864
7294
V1085
53510
2726
36000
99642
78039
5811
E8768
2808
V4983
56202
1464
8028
0312
72210
00581
V1029
7099
78791
5589
7778
25093
78451
96909
5523
78003
2774
7197
5846
1888
E9303
71902
36362
30590
2730
7062
E8843
80112
E9654
5641
4230
5570
2763
2639
34460
25202
0088
71102
1119
0478
9809
9092
9349
V1041
7705
3384
78829
V202
5363
99668
53190
80662
2859
9694
74742
03285
78609
1729
78060
V4581
E9393
V4579
5109
56723
29532
5192
73015
40391
07070
2989
85226
4489
78820
9973
78321
6820
41021
47832
80702
V163
73316
56986
72989
9142
72751
6869
2739
71596
34982
58281
2384
25063
45352
2812
78909
78603
7313
5571
7746
47412
2948
5178
V550
9053
20020
6944
9670
72930
7766
3003
4219
6000
E8348
57430
V1000
7080
45621
430
44284
4262
5934
3682
4464
82120
37555
37230
9679
7100
76519
4941
7704
99676
7907
51902
04102
78899
78051
3829
E8785
1915
70721
5778
70711
6951
56781
82382
2880
725
7318
3229
72142
470
44020
2630
36210
E8502
5650
8604
V3101
E8761
4373
5060
V435
9701
4232
7533
3004
78834
9341
70707
E8881
E8792
3577
81601
4239
20198
04184
44629
56489
3962
43819
4420
6827
38910
51884
2761
25022
V4512
25201
78830
4847
78031
5715
7224
7230
4263
5964
9916
5163
4538
71590
3619
42731
0091
59381
80503
86131
20150
7842
V1749
V1351
7636
5819
40301
82022
6146
55011
2738
E9319
03811
E9290
5678
7149
E882
4259
80600
60000
34620
27739
86352
78702
E9300
99601
V1088
V4283
2800
72272
45382
4822
27650
37633
V0981
1363
5070
36284
72740
85306
30183
36840
8602
8021
74190
7991
86405
2830
9800
20410
79092
78905
E8490
3071
53649
9038
E9420
25003
24290
42842
42769
2536
8064
61610
E9422
30551
86601
7817
V0254
V549
41400
V5861
73342
5859
04182
29041
42821
V642
8029
86404
46410
34280
43301
7041
64821
2879
5855
E8704
43889
55090
311
V707
5966
80843
56889
V1005
1921
8750
4846
38600
1725
1272
30471
63502
40492
2771
40403
86101
87364
27542
7856
1619
E8583
V451
65641
71535
48240
035
70219
70724
34489
9984
3952
E9310
79093
99932
3203
5181
27549
29281
7850
41189
76512
4400
56081
5854
V440
4710
5960
56213
30520
2513
1570
8500
57470
5761
56969
44422
42613
81502
79001
5550
E8136
7083
9222
48239
99592
4474
42789
5693
07030
25033
85200
1177
25060
25042
2373
41410
8220
6828
03810
591
2270
37501
2521
78720
73679
V1006
56210
V024
E9429
7845
72939
2410
5771
64131
8603
5601
73028
8930
3694
5302
7820
2662
30491
82300
4881
20270
5753
920
1982
71844
E9382
3181
5100
7661
1505
70901
42689
30393
V5331
9754
8822
99859
30400
V1551
80101
57511
2114
60001
4011
78093
75679
53082
1981
78701
85301
80601
34590
34571
70709
95205
64781
2382
99989
V142
0413
4421
28521
45829
57490
94536
53551
42989
V152
23770
72761
28989
96509
E9359
87363
87342
3361
E8902
7020
78843
2594
60886
27730
7089
79989
5950
74721
3899
4267
42652
4253
V1202
25208
43410
73710
V5866
47819
V632
9584
E9347
76502
2532
5528
V4364
53520
7811
55220
2762
5289
2376
2913
3558
72211
81010
43491
V4502
E9289
2271
3693
72887
6191
3569
0412
5193
53642
V1089
20400
94214
4411
99663
E9342
2865
70704
V6284
34690
77081
8730
29040
5569
49122
70719
7354
V1581
25072
25073
3341
390
81611
20260
9509
41412
V442
6930
28803
20510
2848
V090
2143
04149
42781
25090
4404
1578
83401
2776
37992
E9248
5521
7336
05379
V1279
3499
5951
5561
25200
41051
7837
3668
51901
6953
3481
9160
5809
0049
E9222
8739
9221
2766
4582
42830
V5489
1962
7854
41031
55320
73309
1969
1572
5853
4210
5303
E8786
59789
25061
42840
5185
20502
V0980
33382
59659
80841
72292
7757
9951
28850
55229
08881
30561
04111
04110
3310
E8849
5888
E8501
74869
03843
7703
2254
80020
1173
9961
30303
81333
8020
56721
47875
56782
V4511
72888
1983
4255
9995
V103
33829
79589
71941
20280
70703
E9390
1369
78863
V1242
4559
3942
7862
5716
28959
7424
07022
1628
8832
E9444
99590
57411
30411
9962
30502
2352
81000
1504
43853
44032
7220
E9299
7955
E9809
45341
E9194
41002
58881
E8233
45340
4352
E8500
3489
V1042
41519
E9383
V4572
69010
80100
9059
3079
72886
4808
8796
44024
25050
78550
56961
72273
3804
0090
7873
7140
99681
78703
9100
42732
76517
59389
57450
56941
5566
9181
30431
2375
4841
99602
7078
29630
75989
6989
56985
70715
40300
37430
V174
37741
45389
76529
2449
48282
51909
78066
44021
7872
29181
7454
42682
0093
7964
7936
4479
37775
25041
4738
78194
35781
36105
7827
7299
4110
85102
7483
5718
97081
5921
1510
78001
53201
V741
V1052
4389
E9478
78009
3561
99672
2888
5272
66634
4233
V1004
30122
V148
2682
486
7742
99603
71906
51881
53784
37923
01215
95914
1968
2810
E9379
9828
5935
96501
53260
80701
7707
2740
37991
20301
V4571
95901
56881
E9363
V1009
79400
2127
V1011
V653
85186
45182
9726
V1007
57441
5713
9273
20288
80022
30461
44321
53085
5609
4471
4510
2121
29530
78842
4417
76524
V8525
7847
40201
43320
34680
1104
6190
72992
0272
8248
V4577
V555
05889
E9304
4553
9348
E969
42610
44322
2811
80321
71691
53290
V4574
35801
4359
5961
36202
44031
4589
79902
40291
4928
4552
78552
5121
37489
V4585
9587
V140
V462
1300
73315
7131
7291
80162
E9192
7103
73600
0931
0880
4241
1521
0417
30001
2731
1175
44389
7589
73719
03840
4720
E8600
99684
4299
01894
2897
5552
4478
56212
31400
9680
5225
7804
9982
V1209
7209
7910
436
4160
78065
V1091
V625
5733
5119
36900
1123
59970
5728
9654
99813
5258
53540
4238
V169
E9600
V4459
9553
27900
9972
63491
0796
85221
5111
V171
4111
7824
7109
29650
5538
7596
2839
71238
4570
53511
78760
4599
V5869
3368
78602
2440
76526
70713
36846
80012
1124
7935
24280
82020
58381
5081
82531
42490
E8497
0543
6084
86389
1514
6825
V029
20300
53570
41511
7015
V8537
1538
8244
7282
5734
9340
E8782
V4573
7761
04100
6010
46431
V1241
9964
4019
514
5368
1830
7906
7990
44581
V446
1987
E8230
30541
71954
70712
1463
5933
7891
8738
4329
5130
80507
44023
4532
34570
53550
V5419
68100
29212
2809
9529
47824
4275
58889
2788
6824
25001
462
71901
6271
3488
E8790
40310
V153
25081
5762
E9412
4148
29620
4408
185
35782
2875
28319
V3401
3960
0414
5583
0530
1518
9879
79579
V5423
48241
73300
30924
73004
60782
78722
07989
99779
6983
34510
V1043
4820
2116
99563
28983
51851
34540
E8580
3051
78901
4430
59582
2899
72673
7101
9986
2442
V1021
9081
9642
V1582
7784
73022
51189
9054
34989
51883
56089
8404
2893
73025
7218
7470
72271
71680
30460
75733
25070
30490
48249
990
E888
71699
541
0389
41011
3581
V1079
7963
3239
29562
74781
57421
75982
42841
99529
73730
34292
63310
33819
44102
46451
34501
7783
86103
38630
226
1573
2822
7830
7961
9980
71109
E8844
4472
41082
485
4919
1970
V8541
4231
8024
V2651
78904
E8529
81321
1974
57410
27401
4780
56039
73810
V667
73016
20920
51889
53020
2910
2251
0400
79099
E9351
4561
3536
25083
28249
5690
9093
9974
1980
85201
82332
4266
700
7885
8700
87341
5679
4440
V180
0415
V1584
19889
41081
5531
V4365
E9174
5602
1552
72671
33385
5829
7234
V4575
4264
49321
29570
53140
4387
80705
E9424
40290
9047
5374
5996
71236
V1087
01880
7243
3968
1961
1103
82535
29634
7200
86229
4733
9729
1629
2733
78097
73732
2949
500
41072
V441
99604
73382
49300
2722
80502
43490
53789
5180
72981
37034
72190
85241
92400
542
3480
V0262
1522
V453
46611
0463
7464
2395
2704
5712
4556
56738
30522
8600
27652
80704
80021
6238
7708
60783
E9288
7915
E9689
4258
36400
7242
95911
81203
1748
3363
99654
2724
V113
5118
V443
30553
55092
V1271
V5481
1533
5362
V0950
1561
1985
4139
20152
7843
49322
7981
1623
53440
71949
99939
2690
78559
4414
99686
0499
43331
4871
3941
5719
1971
3708
76514
515
V854
5793
E911
7517
56409
49320
5128
5226
57512
36816
7994
57461
30441
496
41402
E9470
29640
3441
86804
0539
8670
37000
4465
62211
05410
42822
72403
3574
99739
1120
56722
V011
78606
53390
7874
0479
32082
V0261
2858
86121
47874
2699
28982
5191
2863
3490
2512
99685
3669
72293
4295
85182
82121
4619
81209
4254
E915
3484
1560
25012
9351
2397
V4973
99682
25020
7102
55012
7511
34430
V141
47879
E9411
431
5845
2752
80125
9212
8860
E9384
59971
4269
1532
37943
85181
53340
V0382
57451
3319
9552
42823
V1253
34839
V8812
34481
E9317
42979
5184
81342
E9320
43401
3442
99769
6111
99831
9070
42090
68609
V5332
5401
V4578
7231
7801
5168
33720
99679
39891
4257
5722
32726
8080
E8798
45387
85220
V1003
43882
37854
20501
V851
V1083
82302
2113
99702
5579
76518
41404
7202
70720
41411
04183
30583
E8495
4809
37273
76527
46619
9998
80031
3599
71536
30301
6201
82525
E966
9678
80616
25040
2689
29689
70725
4838
481
2753
36250
43310
25010
30401
70705
60499
99656
28489
76528
04189
5790
1919
5920
81500
30521
9588
71107
75619
20211
3643
6143
73314
2750
29560
99811
43821
29699
53641
77211
82321
73017
99644
04186
76407
1109
0793
48283
40493
99661
47831
78059
37200
5131
V173
31401
E8791
042
7732
2883
4289
4549
3370
V1272
E9500
2767
30403
2555
5881
78449
34400
V626
25092
03819
04109
73399
30391
2111
5758
452
1618
4588
5764
76516
73741
936
28800
30560
45183
V420
E9479
0579
7921
73007
71591
2829
V1053
0419
25021
47830
1620
20080
44489
7806
07071
V8741
56984
49121
1977
9920
99701
V5412
23879
33394
V1541
27541
7504
76522
80631
5939
73319
4242
99671
3897
27949
75310
04119
3453
9172
80122
25013
9248
0490
07999
48289
76523
5822
99673
V641
5967
80015
85256
1890
2764
5600
E9394
V1082
80223
25000
V151
44381
74602
220
2329
30423
49392
47829
32723
70702
8026
5799
4200
71690
78841
9693
7530
7455
3575
73739
9583
78079
7823
586
8208
79431
4412
E9410
77181
0383
71230
E9241
4423
2558
5739
71101
4416
53783
V502
3559
V4587
V4501
1531
V5413
41020
V4986
4271
7265
74689
9992
8921
86122
99812
5839
V454
3540
1543
86504
V1255
81200
8072
4142
99889
V553
5692
E8700
1953
E9361
36234
57460
57510
40491
4618
3093
36019
V4962
23875
71847
E9413
99631
7092
2873
05313
43300
1400
5849
79029
73734
E8708
58389
V1047
56400
53011
72973
27669
8054
E8784
78099
9032
57491
76513
7919
55091
05419
V3000
5798
V6441
E9421
3659
5559
605
53021
7895
35800
25082
49390
V1309
V08
6040
33520
E8889
80325
V850
1409
7716
82009
V4611
9064
75329
5821
E9313
96502
04101
5720
3330
5772
5750
E8120
7993
8870
