78650
4881
82302
20280
V721
80020
20190
45389
7906
V632
5550
57421
E8192
4870
V600
70703
5759
8024
V420
V1047
501
9081
4294
19882
V1749
7354
2114
33183
29560
37852
70711
57490
30490
V3401
5100
5963
79029
V011
9962
5528
8760
71901
8796
V3000
4019
45821
7731
V153
56889
40301
7384
30120
77213
7213
7806
03812
27800
74689
E8600
1985
V3201
27739
99603
07054
42833
45341
4253
7717
E8120
71102
43813
5716
4260
5191
56942
8054
8744
25208
36000
99666
5920
7473
5829
7245
1974
76524
9588
9032
9964
75982
53450
77082
V3100
34400
66612
30421
4380
32082
0382
80012
7083
V1202
99592
29640
56985
5601
E8780
E9310
2541
4710
E9299
4358
9273
73730
0090
4139
1965
1541
7820
48282
7503
591
25000
5734
6929
73342
E9479
9222
1532
57142
70706
9033
81201
E8849
6826
7140
43889
78060
3897
8911
99661
1700
99604
3576
99657
5798
20218
53012
V461
80135
7485
V4512
E8798
1720
99639
27541
3510
04100
56738
1173
4472
4588
V161
37900
53783
V4581
73018
2521
31401
27669
82322
77081
99989
E8843
E8801
V4511
990
75261
30001
V4365
2127
05319
42840
3314
V1204
2536
2910
72141
53021
V3101
78065
27787
76405
70701
5193
71699
9972
71236
4538
E8902
0091
1978
37652
37230
2822
87364
5969
44329
5764
47879
28860
85301
4841
317
88101
3319
44489
1307
7724
700
36284
70714
3485
V140
85222
71596
82382
4420
66632
96500
55229
78031
53240
60091
28489
42099
44620
77210
7726
99656
99709
29040
7837
76072
2774
V5843
41012
4290
56212
4370
4510
V142
5722
99664
1125
V1642
6039
46410
4162
6851
5131
47829
V1041
V1251
42689
78701
30751
57441
V440
2699
7945
V4586
76516
43811
E8706
5754
2352
36234
9587
9693
2810
51883
55090
1561
4940
27549
79092
3341
53550
2740
7831
5194
3201
7827
7821
8603
36846
56039
30500
34291
8730
2894
79093
5933
41511
5579
7515
92320
99832
30011
25092
7716
43311
73025
29540
30501
29041
81611
59654
30523
5185
44284
8676
99642
80616
3952
V4364
V446
3899
03810
V1002
5647
V625
72290
7570
5678
9529
73007
E9331
V8812
0479
8250
1986
E9293
4552
72273
53260
V4501
8026
V08
23872
5845
1518
E9384
4739
45189
5720
25070
55320
2812
4733
2731
V850
1729
V4572
37005
6944
76515
20210
20300
138
43331
6930
43491
7885
2689
37739
2971
1983
27900
7292
9110
30503
81510
1580
78659
9961
86501
47875
23875
86330
V1089
80662
82020
8782
4239
E9343
4168
5303
2912
2721
72619
4441
262
25050
7131
25081
V1042
96502
V4975
57410
44322
9093
5181
1622
99601
29389
1912
2411
1619
V4561
70723
01896
57149
7454
V071
75732
74710
8708
5272
V1006
55011
75162
E8799
E9317
49122
53501
41041
70705
5804
1560
33182
30522
2532
5989
E9379
73017
40311
9828
E9320
E8781
E8493
4423
34839
1891
76408
V854
76497
53570
78039
1538
V1252
2538
55091
E8792
80126
4660
42611
71965
41082
7310
28529
9679
6989
85102
5409
E882
6143
5679
5819
E8121
5561
3552
5739
3559
74742
2251
45989
9690
1620
E8147
71598
7230
25040
7840
V4585
9340
70715
71109
E9378
99590
V8525
2765
53081
6953
9708
5300
39891
25202
E911
1109
5183
85305
80504
7296
73005
V168
V1279
70709
7804
30563
V444
7070
76502
71844
V5861
E9424
2939
E9352
725
99602
2554
9054
4267
V293
36202
53390
99889
35789
5258
7599
V642
59389
30502
95911
70702
78607
V0189
7935
58181
78603
73315
0414
7720
86415
73670
6010
V1088
7755
30401
07022
48241
7784
34982
41032
72293
3082
0971
80601
81322
E8810
42769
3581
2890
53530
1982
V556
7783
82009
2329
V3001
71101
3489
59382
8029
80705
99644
5793
80631
53011
2638
E8708
56986
9982
5111
80508
1973
2808
E9429
44020
5224
33829
7109
43401
08881
7635
3239
37501
73739
V1004
79311
44022
0051
25090
4560
E8844
30491
135
81341
56962
7462
49392
33385
7235
52510
48289
04109
5120
V4972
E9410
73710
30561
1530
V8741
72888
4738
0579
E9342
V1551
7234
99932
7452
7793
8870
41071
1272
80505
44281
2760
80605
5771
87343
70721
7701
7248
8832
77083
V163
4389
44029
80121
0400
0796
E9509
7622
22802
E9390
2682
58381
44024
7854
53649
25051
8500
76523
53170
29590
30520
41072
4411
73382
193
V581
7991
55329
7210
5888
5304
78605
4476
8208
01880
5952
1179
36001
37272
2967
56781
25013
25002
80114
V626
4378
80841
1987
7818
4270
28850
30022
88102
2898
29181
25072
45382
3577
85241
0312
72400
78839
85256
7513
7104
8601
7863
7461
78703
74687
9221
99769
72981
4555
2387
9553
44422
7757
5935
V550
V714
36840
3942
71595
70707
V0980
99654
99667
5724
E9682
E8786
5758
5110
85300
5690
47412
5855
0416
71905
6202
9038
04182
7280
V1351
49300
45352
36900
57470
4550
9701
V452
20800
4465
3659
45372
3439
0490
5280
2728
4373
34600
71949
V1091
4582
V2651
59010
V1301
E9323
34489
390
56731
4219
80172
05313
5187
56200
V553
E915
74190
71107
35801
5713
56210
0880
80709
E9804
33811
5551
V1588
72973
20411
47811
49391
48239
E8171
04119
6111
77214
V173
0272
V427
83100
70704
45340
73015
07032
30590
74429
80503
78760
57471
8604
58281
V270
E8783
4231
75559
5822
70400
9050
E9361
8240
V551
4262
75739
87320
3449
V1081
2513
43812
7766
87342
1940
1552
9172
01803
4589
2273
485
73600
9623
75329
2121
40491
81200
78550
V5867
2112
7200
9642
40391
7761
34830
37200
4258
34510
47824
E8490
86350
7881
68110
42610
07031
9654
5368
4822
V433
2443
86389
34571
71907
8600
V8537
V1255
2851
1536
53400
78459
8248
V301
20288
E9500
96501
78057
05889
3331
V141
70719
3051
59789
226
53200
87363
55092
6827
77089
82300
7963
74602
44629
7786
7580
43853
81333
587
78901
81344
2732
2750
78059
53082
75989
5712
4553
34290
E887
7295
07951
23871
37851
5163
1540
6084
42781
75312
4263
03844
3570
20920
9754
82111
0498
9920
8080
51882
46451
42989
3668
2771
2766
53560
73314
7673
86601
E888
4321
4580
V174
V1581
20501
4414
78842
7852
1991
500
04082
78441
64131
80122
515
82022
27542
86504
3014
36281
1573
V4986
70901
7856
2809
34831
25042
5081
20198
29630
3361
36019
8028
V4962
E9222
7041
36221
04185
4169
77211
1972
53551
5881
2113
2900
4539
8602
2879
1725
2459
27949
8700
9212
41061
38910
3330
V1272
53340
4422
4160
5672
5589
72402
V5416
8620
48230
99831
7484
4809
5750
55012
E8580
4400
25541
7961
2126
4352
80321
34540
70710
431
V4973
5778
87341
V5417
V4576
76504
70720
E9392
76522
75251
7845
20021
2730
78720
85205
035
9974
5571
1830
45620
2839
769
57450
7469
5225
2189
76406
03842
V5865
9059
30392
00845
71691
75501
340
04186
70722
68100
9053
7891
56213
7197
2761
41001
E9313
V4361
72252
07999
1400
25062
V741
5996
7964
40501
30551
V643
2733
V4573
85181
7790
29570
56202
45183
04111
E8538
53290
53641
51881
36210
7802
99594
5934
4590
36201
99668
82320
41081
73022
76719
73679
V1021
25011
56721
30560
7872
86401
V5339
71680
5178
99779
72930
37489
99686
4413
2768
72610
73008
9986
2722
V4281
2829
52801
V1053
6181
73722
5128
36960
36105
9181
7617
11289
2738
E9504
E8705
43320
42090
42832
04112
V180
87344
40290
4556
28749
51189
9349
8260
4559
2555
86103
E8859
2252
27411
03811
34989
7823
481
V502
E9425
25201
80702
81010
80100
53642
20301
V0950
03285
3009
99812
E8502
5854
60889
71531
99679
78009
4838
8220
27652
4470
29572
29281
7707
78702
99939
7080
04183
936
9680
7981
73300
78604
2572
72939
42612
76514
43490
V4502
4259
4421
86101
34461
56961
37632
2762
38630
5789
78722
39890
41404
2880
5730
6040
V1011
7904
5562
4489
0543
V1029
7483
81220
4846
V1007
4536
7776
6820
80703
E9413
4275
37741
35781
20510
E9174
8921
30553
7625
44030
2848
56881
07811
5711
29620
92400
78003
29633
77183
9047
3694
37273
86509
5799
V4459
29212
4375
V4983
78551
4561
5852
76491
E9304
78931
99649
99682
75617
2449
86503
34460
82525
0539
449
69010
1707
85186
5602
79415
430
72740
44421
74762
24290
37992
V1005
1123
76409
5198
E8261
2864
71902
80102
33818
28521
1971
57400
4241
5723
1603
4549
7265
7847
88002
E9305
74860
30924
8860
5846
86122
6019
4821
1531
E9351
25071
3238
E8160
E9554
1363
80022
7621
7931
78652
34404
76383
05479
V4579
53291
5533
7542
E8796
E9290
30000
53085
72751
0389
5168
40599
43391
34590
9552
5070
9998
4610
7765
85225
7615
34889
E8136
53440
80625
78449
2373
95901
6802
6146
E912
45829
5932
42789
3090
5374
9248
4471
6954
56969
1980
3229
9973
81321
40493
1921
81000
7424
5692
3643
41412
7224
0478
1509
88122
5121
4440
28522
9980
9160
E8700
0530
1919
9348
72989
1748
5988
3003
51919
7244
2753
7464
4820
7612
78609
80223
7099
9694
5439
5966
56409
4941
20028
29634
V4589
7512
4240
5570
33394
43411
5184
71906
7336
64821
3970
78071
8830
07989
37943
78061
585
8831
25080
30430
4786
57510
25003
86131
7048
5521
78001
70712
33382
5581
71591
85206
V554
30403
3249
3536
20410
03849
30570
7915
78821
99631
7661
7843
8711
30431
V0382
V463
72210
56211
V6442
9584
V1241
5130
8930
1503
1820
1572
4478
1963
5583
66634
3441
53100
48283
4387
30483
0701
V1000
78051
94800
25063
1490
3572
4781
1913
72211
73028
9130
5950
8738
78799
412
22809
28652
8910
V1201
1103
74761
5401
7955
1628
85011
4871
4578
9800
7463
64823
2382
82130
28319
7764
3669
4242
1177
27650
80843
79579
E9179
V443
7101
2518
7921
6190
4401
6983
E8529
7098
81601
4279
83901
07044
80700
79099
4439
34401
7421
7630
E9288
V6284
4479
7817
V1507
57511
3079
23771
2713
7051
44102
28982
42821
5761
3591
6951
45387
42613
78602
1623
2726
58189
20000
V4582
E9194
5715
80015
7092
25030
5770
20502
38861
4232
566
2875
5523
27901
9984
82123
41401
36400
2375
E8846
37633
V1082
99813
99931
V1001
7706
73309
E9421
6822
6271
99859
5733
5921
80101
3368
2440
1962
1961
03843
4430
7504
7708
80325
72992
7282
V5481
5997
2639
E9278
77084
72887
7811
V090
73719
4148
59381
64421
74569
E8782
2949
V1309
80502
42979
1977
58089
1409
99673
E8190
7801
74365
2767
5180
3480
20260
71230
45385
99676
1512
53520
514
1737
43882
E9289
79431
2859
311
5569
01215
8244
7262
53190
25010
E8768
V549
76621
73390
57451
3490
1715
43819
80701
9010
85182
1918
53500
1508
78829
9070
76498
79400
E9420
7015
605
51884
E8889
452
5680
29562
0949
56723
70724
E8151
E9359
6828
V441
E9412
41020
49121
56981
92411
76518
96509
7919
86813
04104
1520
41400
75263
5642
V1584
30540
76517
73009
7078
E8790
5779
56489
4730
3804
82531
4359
72403
7678
30591
30411
24200
4731
41091
19889
30550
4416
53089
86803
73810
7812
73734
8872
3370
56089
3553
7102
78903
1120
07071
4659
68609
E9398
9598
E9192
53019
78079
E9447
85180
9651
57411
60782
40310
096
E9394
4568
V4574
2841
E9478
1640
28731
V6441
74781
1300
28800
45383
37991
E8191
38600
71509
85226
73741
07020
4011
4417
042
30583
76526
69589
E8785
1759
7596
2271
5961
45182
5400
2111
1629
51901
7702
78905
76075
85302
71105
30423
6869
99731
9809
0412
78906
V453
04189
82392
2749
2863
35981
86405
0463
80031
32723
2777
V5869
5991
44481
1519
3004
30460
2920
7797
20400
2989
7993
E9422
V4577
0093
78606
6825
42983
V029
5109
6960
E9411
48242
64781
4271
2270
78199
5259
E9470
60783
260
42091
3488
27951
E8784
7539
2893
2558
40291
2788
V4611
99791
4200
V1009
99684
9995
37941
63491
42831
99662
57461
48240
4280
74721
55321
23770
E8504
82321
5600
2830
2662
65641
1990
74900
71590
25033
35782
7730
2883
7861
71695
V462
3453
7455
9999
78900
7589
7833
55220
85220
44103
9992
V1253
436
99811
7530
70713
1981
61610
6910
86121
7778
3829
8072
7533
V1051
2888
78907
1970
470
0785
E8842
7771
25061
99672
E9800
56984
7671
53784
7824
99665
3558
E9364
V0482
34550
25052
2752
34501
58889
5307
7135
0793
47874
79589
V1044
80120
3383
8901
42971
6262
04149
82121
4289
1122
E9689
2254
7700
57420
2913
E9319
E9241
8605
40390
45184
34570
6981
0088
490
44032
25020
V152
3203
86602
3542
V298
29650
E9358
99702
07041
5226
30400
E9307
5566
7291
78820
E9308
28981
7767
9729
7907
78830
01894
3574
5695
47833
2441
59971
43822
E9347
5552
78909
53020
5118
42841
82120
76496
V1302
40300
80021
25093
82021
30461
90089
2819
319
9698
5831
3313
25073
5119
59582
86404
29699
1624
7756
0270
V5866
6821
44389
7089
5305
0542
3599
71946
V5412
1570
V652
E969
3708
99593
78451
62211
57512
5719
7608
71903
4386
75619
2866
2125
2794
7830
2897
8021
34680
44101
56941
3963
3093
48249
78834
1984
43301
7318
45621
7636
87349
41410
30393
28989
3240
E9248
86500
E8499
E8150
74869
E8881
6988
7218
5370
3499
E8497
1562
30749
E9654
44324
7703
8083
V5332
83402
1543
78093
7202
46619
42731
99671
4919
04184
7788
70219
33399
V1259
5379
30441
9630
5363
82301
20211
4111
52100
27401
V555
72272
V0254
85221
7746
3561
71954
60784
59970
462
V5391
2116
80506
99681
96909
1369
243
4404
486
4720
78321
V103
45342
V0261
71945
2779
4571
V1079
20283
85201
2869
07070
9142
41021
42823
V290
5811
1504
28803
7942
49390
71536
5790
34690
5718
E8500
6962
7905
5609
74783
76407
9583
V1209
2818
9100
75733
36563
V1254
99739
5780
86352
7103
28804
4233
56782
78729
53789
V8801
30981
1874
78899
E8501
V5489
5691
43330
185
8064
76527
7962
37923
V4963
41411
5951
4570
7876
77181
4230
43310
V4571
20150
99659
76503
3241
8020
261
53220
72142
V0991
V422
77981
33520
2704
60883
9210
2594
85306
25043
41189
25022
4010
37990
51631
E8162
4464
8820
2442
V4283
E9393
82101
43821
2409
4257
60499
8822
8074
99701
34500
4474
0417
0340
53510
1514
8748
28959
3379
V0262
4371
3501
31400
7626
38589
9993
9678
2512
74510
44381
73313
0383
85185
72813
V560
56081
76529
1550
1505
20080
5302
33819
44031
V5883
V1052
E966
7560
4142
5994
5762
99674
27651
1966
2230
7866
34580
V707
9975
V641
47831
42843
7020
V202
79902
8242
V596
04101
72884
9726
2144
3968
0380
5192
V4587
0931
2724
53781
7243
5710
37430
6824
29410
42741
4928
94214
1121
5839
30300
4466
E9444
80708
72889
7660
E9503
7850
2948
27803
2800
58389
3594
44581
9331
04110
25083
5298
8404
47819
5990
2860
7209
34280
44023
V148
49321
78559
V851
1890
6110
5060
78066
83401
5738
7517
E8498
V1541
5362
99563
7211
5538
E9300
34591
47832
5964
V5419
40201
3442
570
4958
7220
V169
E8494
V8541
43410
45981
80600
1510
42822
97081
V1072
78791
3076
73399
42652
80849
40492
38611
77989
4372
27730
7895
541
71690
2781
80706
9670
9950
9351
57430
4533
53201
34481
57491
78863
220
79989
51851
E8583
4299
41051
5856
78904
V1085
78843
2384
E8495
72972
2899
1618
7470
32341
V4987
E956
1104
3484
V0981
7689
2734
42830
3181
0074
E8543
99591
3320
57460
7936
7930
8082
49120
53541
2930
5641
37034
V1003
36250
9711
30183
32726
7873
25200
6191
9663
4238
7062
2793
0419
8750
6961
8670
78099
8056
1463
1968
20152
V451
2940
2690
1953
6201
4920
73026
V1242
41092
0413
V4575
95200
2763
51889
7299
2710
496
80125
25060
7910
4210
3569
V160
29689
5768
9524
05410
41042
20281
72190
42682
53511
E9363
25082
4780
3373
55221
5781
56400
5960
4847
4592
72291
9190
72292
E8233
4619
1915
80604
3941
V1046
3481
E9809
3540
60001
24291
07030
07051
49320
30301
1534
7813
28983
7795
20530
E9600
E916
E9356
5650
30122
00581
8245
1522
81408
43883
V5862
30521
E8788
86612
60886
4412
V4578
4178
7242
78052
5968
80507
7742
27801
4829
7868
80704
2739
2858
56789
920
60000
4599
4353
76525
8739
9983
71238
53084
81209
72705
3371
V8543
1888
78841
42732
73029
V053
0499
E9303
20500
2874
51909
7798
2873
81500
73016
7149
7892
35800
41031
72671
46611
2773
73027
7862
V5413
2867
85200
25001
1610
72761
E9426
42653
7511
2154
81100
56982
7100
81221
E8348
4264
E9383
34430
4785
30303
99762
E8230
2776
2395
E8761
V1529
1960
75563
42760
4251
V1582
25012
29530
63310
0521
28984
V435
86229
6823
9092
1533
9051
9341
78097
2811
73004
9509
E9382
59589
8505
81502
5531
42761
76512
7423
V171
V1271
5821
71103
8052
2865
41512
586
25021
7718
80501
E9306
22801
1975
4281
7948
71941
6238
99881
0549
4808
2520
20270
99652
75679
46431
30541
V667
11284
0049
79439
71106
4269
41002
3619
7705
1578
7874
9724
86502
29580
72401
25053
72673
2825
61172
86804
7810
2376
5753
73319
5728
V5423
7670
80220
40591
27503
7842
56201
53561
3071
V442
99529
1892
E989
V113
3315
5939
E9348
5902
V024
44021
05379
30470
03840
4293
7750
4110
4254
V644
42842
2397
7313
72886
81203
3384
47830
2769
E8888
4295
2410
40403
63502
81342
7994
E9309
76519
29680
7990
56949
71535
5853
9064
7704
30420
30391
22804
82332
24280
30928
1976
76513
3099
1464
1969
71943
E8122
42291
E8130
2630
V1087
73316
80112
71847
7732
542
E8809
42820
82521
79001
6000
E8532
5693
77982
5559
04102
34620
E8528
56989
29520
3483
36816
4266
8088
95205
V454
3332
25031
56722
99883
7775
4408
5289
78552
2764
3363
80162
4329
43820
2720
56983
41519
99663
73732
3688
92232
1251
4460
23877
37775
E8791
03819
33720
5809
41181
51902
3575
1175
1521
V4282
9072
1551
53540
71430
3940
3962
29532
78194
49322
5967
V0259
36362
9879
41011
53010
25041
2143
45386
7294
7231
53140
4618
41402
86400
V1083
4255
V4976
82535
95914
9916
5849
4558
72271
5859
4801
42490
2511
V7651
99669
59080
9971
59659
E8704
V1043
7038
76528
28249
05419
99685
5772
V151
30390
34292
4532
2519
1119
2535
44321
V5331
9951
56729
77212
V122
78959
85202
3310
0415
44100
37000
2599
3432
53782
2448
V5849
0388
58881
1124
3682
70725
76079
E8161
20020
V552
30471
75310
94536
43300
V653
37555
76501
37854
3960
3693
1625
23879
