71598
86415
V556
5715
99813
77181
45341
2724
5768
V1259
25040
42971
4430
E9308
2825
9693
87344
57441
76079
27541
78909
7454
6930
99663
76719
5521
59381
43820
E9478
3310
5070
30421
V4571
V4283
4321
03844
V1251
5128
E8502
07999
4295
24290
78791
86612
6823
49392
9654
5779
99859
79902
86500
73390
42653
72190
42612
78194
8911
E8261
8024
38611
6951
E8700
53510
59010
7963
78559
2971
44020
1518
25090
2763
9724
7804
6961
48240
78901
30491
56039
81209
E9288
1508
9708
76513
4556
V1581
86602
3239
77081
34982
70707
73679
2762
37230
7660
05319
2639
79001
28521
7102
72973
40390
74689
5968
76504
3071
7906
2752
4659
7955
V4611
2841
27542
41061
4352
30591
78907
03811
25002
80506
80125
V5339
41041
07051
74569
32723
3484
3320
78701
77214
82521
E9378
E9503
3960
28249
72252
4589
585
30553
3659
9222
99664
69010
9630
4370
E8781
E9800
5920
82302
20028
0415
V4459
3899
7248
55220
2874
V552
V667
6820
30540
4290
0382
82121
7423
2767
3330
5559
2822
4619
4582
75559
42831
9993
2860
3490
7788
V5883
7530
3576
43331
80625
V1584
E8881
07032
4465
9983
86504
3594
7790
85206
V4976
75733
9160
V422
22802
4550
8676
99665
V1003
2939
28982
2760
2830
E916
340
44489
4928
5374
71945
76516
57400
8711
99601
45184
4821
20300
7793
88102
4476
34510
6202
85306
29620
77083
4294
04101
29633
42822
70709
2410
3384
V1301
2682
8220
82101
4299
71595
5849
V3001
4560
8700
4242
78702
82382
99590
2411
30928
28319
42611
3383
7837
7101
75329
E8784
53782
7726
V707
34839
3569
920
45189
33399
8082
82525
86101
7948
2930
7511
85302
5961
4168
42291
2733
43811
7813
V581
49120
80507
78609
7473
7921
70714
53170
04102
29680
30011
05479
5724
53540
29590
70706
45989
4231
E8798
V446
7612
V1202
2811
99639
2520
E8888
7907
82111
E9600
E8160
7197
0785
81000
71590
42761
47874
7622
1179
43320
V1588
25051
44023
V153
78606
V1021
4239
6822
72887
85201
82322
79029
78003
53290
48289
V173
83901
E8790
V1001
56210
29650
1978
7310
5183
7135
78079
76501
3483
53560
V502
75982
0417
6084
E9310
5583
7706
6827
3453
4553
43883
V1272
6000
9651
99709
5728
E8799
41402
25001
78829
1538
E8136
72886
8248
E8528
4264
99811
E9398
3201
3090
22809
42989
80021
5778
4110
5650
E887
5781
4271
2449
1624
66632
29640
53012
E8859
7462
35800
E9504
V451
76496
4293
E8842
1977
2863
42490
185
V644
3099
76405
4270
25020
57471
40301
78722
5712
73017
80122
34591
E9429
1891
72972
81100
49320
57512
E8161
56942
2273
3241
66612
56985
7847
3575
86405
85180
07020
V4365
41400
7845
25063
99674
7862
V053
5289
77089
V5865
V08
04186
99666
43301
3441
V4573
E9358
7840
4478
20510
9092
30300
32082
42841
042
V3000
71965
44100
1888
04111
243
E8801
1919
81601
0312
74687
42843
82301
5400
2899
5845
7824
42781
9999
27739
73730
85182
2726
80325
V290
2189
56081
6826
9331
8760
9351
6954
03843
V721
9584
5734
64823
514
7470
74365
56982
2880
25062
E9352
76383
41011
1552
42682
1974
99652
V301
56721
34292
E9323
80121
V4282
42099
7678
7211
37200
7810
586
5881
74860
2375
5181
E8490
7718
25042
72889
76528
9678
80508
4372
2851
4592
3963
7885
20000
5185
7661
11289
8600
E8543
4580
96500
4279
36210
1510
7717
7861
E8792
4010
5533
71105
V5869
4160
30001
30551
4019
8620
53561
7533
E8147
2848
34489
74781
5856
7560
5272
5770
78552
2518
2252
99671
4263
2448
481
2572
E8495
3501
7099
51901
79099
30490
78550
51902
E8497
30981
73342
83100
V5413
49121
570
80706
73018
5990
4538
25060
9010
3371
56983
1985
75263
E9361
42830
53020
1520
04100
42769
5111
76503
76523
28850
2270
4472
85300
E9331
5921
3003
2511
34291
85181
V4502
1363
9962
20283
V180
2441
7784
7689
2897
5710
1961
30500
7464
V4579
47829
1973
2864
7070
56409
43330
4738
V4962
4785
2127
E8810
2989
3942
4920
5718
2810
2800
1103
70715
9663
7866
20288
V642
3570
5225
1890
86804
30411
V5861
80505
28800
E9309
4590
25080
2713
8208
25072
8910
53649
5121
3559
5109
73026
41071
73028
V0382
80605
2819
9698
30391
1976
V293
44421
44321
7483
70713
53085
20210
79579
5780
36250
80220
57511
4240
45340
04189
41031
5672
E9359
64421
78052
2900
82022
85185
V103
85200
7424
V444
5307
78605
99791
40310
7750
7820
V270
99669
79431
25070
9181
43822
31401
99831
3181
7856
44024
04082
60883
7630
2740
6238
43821
431
04182
0416
75501
99682
20280
34400
77211
4440
5579
3485
36281
5110
11284
20501
45182
80841
5363
27801
30520
55012
7716
1628
58889
1987
41412
5528
03810
73739
29562
5280
61172
73399
44022
8021
V5331
7515
5118
44381
34460
V1082
1125
57490
3970
8822
E9689
46431
7670
1940
7756
70719
56989
71946
5854
80705
96501
99592
4599
76512
30471
8020
V440
42823
2738
V420
78057
2764
4139
2761
76408
31400
3014
24280
3051
53100
56211
85202
87320
V1087
V1004
23871
77981
53551
1981
V4986
60001
53390
78603
86501
2112
V1007
7455
E9300
71906
4423
V1043
5570
25092
74429
E8230
76526
1533
51882
5852
99661
7991
4870
58389
5855
3540
30420
41001
79439
42689
55090
V4975
78097
7220
5790
V1079
0414
3572
V090
V461
V1089
78001
5772
2554
E9289
5733
78841
41092
9916
64821
73008
1570
87349
9980
56889
V4561
44324
E8846
7703
04184
1980
8260
5695
9828
V5332
E8889
80704
E8849
9950
4281
53541
72210
75739
33829
2750
2920
82021
7892
00845
1983
E8191
1532
80701
76498
5302
78009
80502
V1085
1830
5839
8670
7512
3079
5997
28522
34401
E9290
72981
95901
80504
53021
4471
E9444
4822
V6284
1966
7078
51884
V161
73309
7802
1748
4389
2913
2749
8708
V151
7767
44103
29532
4414
1120
82009
4568
36960
V641
7872
2766
V4501
5680
3009
42613
V1000
9726
E9363
28731
9986
75989
77982
76514
6869
9800
5119
V4578
44021
V442
33182
9340
9210
4251
E9293
76525
44329
2875
25053
1560
3361
92400
72293
V1042
7213
29634
7280
99883
8028
43491
59389
77210
4552
V1201
03842
72400
60000
7895
99662
V1005
V3101
74742
25071
V550
85225
8056
99667
56089
3694
56941
0479
34540
44284
7469
25003
2409
30560
4232
0389
73300
1541
80501
44322
5120
0542
7210
4561
19882
33394
85011
0088
V1006
75312
V174
5370
7783
53082
2866
7673
75563
7100
6191
7935
V3201
1562
30550
81200
1173
2440
1984
48282
5793
4940
9972
2765
72989
V433
36202
47830
7485
138
7854
99676
319
V596
49322
74602
44031
2114
70703
3004
36846
2859
6821
1369
E9424
29410
99681
5569
42842
4266
0549
45620
8404
4555
V632
28860
52510
E911
60886
77084
5859
501
4238
V4581
5711
E8498
5939
29181
E956
4230
56881
30390
7905
53789
V714
E8782
0380
43401
4253
4571
2532
27800
7243
42090
7463
5305
78900
2912
41042
73027
04104
99832
81341
57420
07041
56969
1965
9349
E8583
9110
7775
E8780
5932
V1209
99594
04110
53550
30590
9961
2731
4941
75251
4739
2384
9587
41410
86813
53010
E8494
56213
V1044
5738
V4582
29212
3379
36221
2948
5647
4413
7707
2888
462
51883
7720
85221
6851
5967
9974
1550
42731
04185
24200
99701
73314
V3401
58881
5754
1536
7755
5163
7776
E9320
87342
99779
5194
80709
51919
71236
56731
7708
8064
41519
53784
47831
5589
53089
9992
25010
496
1124
1972
7048
5716
99889
7231
48241
4358
82123
3488
4148
4262
V202
0463
25081
4359
5789
1970
7786
37851
42732
5191
4588
E8493
1912
76529
82300
52100
79092
E8499
74900
29281
99591
53641
5609
5303
V4983
53011
V441
88101
75679
725
3940
80600
1918
76515
42789
8052
56200
58089
45829
99685
1962
4846
80843
38600
E8706
42652
76502
78321
7757
2873
V160
03840
25050
23875
55229
82332
39890
34831
7990
48230
7539
4241
1121
4532
56962
30401
4400
9973
85102
9341
7625
8601
29630
4786
7931
V0980
486
9964
71941
76072
76517
V1083
03849
56400
41081
E8843
3962
7868
5988
72888
77989
80102
261
76527
71690
0413
70712
34590
2883
7919
E8120
4210
8750
81500
8604
4401
1572
2769
76522
2535
V553
5693
V5867
E8504
20400
7876
72610
99686
53084
80100
4781
56984
51881
99702
6983
34680
4441
7701
25083
4257
V0482
42820
V5489
87363
3591
75619
8748
78551
41072
43889
8250
73313
5723
76406
25011
8054
8730
5771
3558
1122
04109
85226
7621
1975
2721
76621
30470
4412
5100
5722
76075
30563
30000
99769
7993
3363
E9426
V1046
42840
6824
77082
7761
V071
36201
8029
30503
7732
30400
E8705
3481
5819
42833
76407
80702
85301
57450
E9421
51909
75310
6929
25200
53530
0543
E9179
7700
2720
5730
45821
25043
80700
56949
81342
2689
44102
7962
9679
20410
E8796
7626
8074
53642
80503
3688
2536
3510
20500
34550
58281
1991
30122
86401
49390
9694
V443
76524
71536
3480
99672
6989
5678
74783
7852
42832
30393
E9383
41021
2858
0383
V5419
5762
E8809
79093
5178
7109
72402
4169
E9194
53783
7842
48283
99673
45621
1578
29040
V113
8240
3203
2111
25061
E8192
3968
8505
605
99644
V4972
7635
V600
V0259
5130
8080
1622
V8801
34290
V8741
7904
6960
73319
7765
7806
5566
53140
8832
57149
55092
E9392
41051
25012
30501
53260
74710
2512
1971
V452
19889
45342
36900
2967
317
44101
V1052
07071
71535
311
78650
0539
25541
8602
78830
7098
E9682
V4586
4820
76518
E9393
436
7484
88122
7299
3669
77183
9971
1551
71106
80703
80849
1625
4375
E9317
43882
96509
V1279
9070
77213
8820
E8788
4260
99659
04119
V163
45981
41091
V4589
75732
55321
82392
27650
81344
1531
82320
8738
34501
V1011
92232
V4577
57510
86400
6910
57451
9998
5690
20190
2869
7823
5960
5531
43311
5180
5602
56723
7778
81201
V1582
34889
51889
E969
3240
4411
30561
25000
88002
71596
81220
E8708
68110
7797
4847
3314
73710
28959
9072
E882
80708
3449
9982
80120
86121
V1051
7812
34690
9130
V4281
V3100
7795
53240
5379
5168
53200
99881
72292
42091
4422
07030
86502
25013
5552
27652
7295
7608
7384
7742
25082
5996
59080
7730
5571
7503
59654
70705
7318
99604
430
70704
7596
44481
V6441
4269
27401
485
515
56789
V1002
5550
5761
5750
4439
E8791
1820
7230
E9420
E8786
4539
7421
7705
85220
9975
35782
86803
8026
E8532
70711
2773
4919
7671
5192
80101
E8122
4417
4142
5853
2949
29570
7731
V1072
37854
0701
V4364
22801
25201
1623
5258
E915
2113
1982
40391
41401
E9509
V6442
42979
4558
73005
41404
7580
55221
V1009
2630
4578
5081
56212
78039
30301
81221
9588
78820
07070
57491
99649
3332
85205
56961
78659
7994
8072
47832
5641
E9394
72271
E8121
53501
34830
5758
30570
566
85305
7798
56722
8083
4275
28529
6146
37272
E9379
07044
42821
87343
28981
4466
25041
7291
412
8830
E8130
7615
7245
3941
V1047
3643
7873
7863
2521
5304
5691
73382
80604
86601
56981
75261
2662
V854
7452
44422
5679
1729
29530
49391
99602
56729
0388
6110
4255
35981
80126
7242
V454
5798
43310
3229
86509
41411
33520
70710
4829
V1041
85186
5300
76497
1960
E9479
86404
7702
2809
9690
7766
28803
490
22804
5934
V1271
7724
55320
77212
E9305
1619
5224
1968
7140
53340
E8190
41012
4408
769
1629
6262
3313
53190
E9500
3599
81322
41189
41511
70701
56986
73015
39891
99762
30183
1509
43411
4111
76519
V4585
86389
4280
86503
E8844
4470
40291
591
E966
7617
53019
03819
E8151
2387
5720
30431
7821
69589
99812
E8783
07054
452
44629
2753
9951
E8162
45183
135
1505
4373
7843
2722
42741
7764
8244
07022
4329
5184
V5866
73007
V551
7850
9984
3331
5198
57410
78906
74190
85222
V453
E912
E9342
58381
87341
70702
E8150
20020
1123
E9804
27651
V298
2910
3439
99679
4254
53081
2768
4660
262
35801
5601
7746
27549
2867
76409
2839
9100
