59382
8872
86612
4293
3313
E8495
04101
7993
61610
58189
29410
2520
2869
22801
5996
2518
7533
41002
74900
V5332
E956
5939
5829
5758
30401
V4972
86405
5523
2761
3659
V0189
30301
72401
5304
2912
4264
2773
5991
29633
8260
5193
E9308
2373
82111
85300
E9356
7218
V1209
57421
1531
20198
E9331
V4975
80616
72888
72403
9951
E9479
9711
E8704
E8881
8056
7706
5272
V202
7295
7621
7955
81601
1509
2883
25013
3694
2441
E8780
43813
92400
1969
E8122
1759
4352
1748
70711
80112
4329
74602
V090
7701
2920
1552
9961
30420
V5417
E8502
75310
5809
05319
1971
30924
9552
5969
7845
99667
7945
36281
4472
311
1518
29640
70722
7673
72939
6826
44329
20301
86122
4231
56729
74762
2689
5988
V446
1983
2788
2913
70719
V1253
7716
V652
V556
V1582
30460
53510
4241
3688
591
4920
57420
2111
7718
E9554
72273
9038
7242
2762
9059
25010
7795
80325
05419
8029
70723
2865
20210
72292
7812
42983
V444
0796
80662
5528
500
81341
73015
47824
8072
7876
27730
99779
78093
0380
63491
80012
2440
30483
70712
47819
78820
42091
37923
78550
71901
32082
78321
27503
05313
8830
71101
E9288
8245
27411
71906
20501
75989
7135
4378
20080
40501
5778
3968
73309
V4502
73382
2599
9351
V549
E969
4476
4251
7485
44101
71103
6202
76513
E8784
5187
5538
1892
8700
11284
7292
8054
72211
E8791
9212
5183
7863
8822
71109
81220
7038
8921
29620
2769
4232
2808
7102
11289
V5416
5695
4240
71531
9670
87343
5650
3643
4267
76516
4370
5952
7907
3320
29689
3432
99659
7840
3897
3619
V0950
23875
37990
7689
4160
76529
E888
2397
8240
0382
41411
80021
9093
7503
28982
E8768
22804
5109
7504
99676
25062
V1083
4838
3570
5583
3942
E882
5750
4242
3499
9587
V454
27650
36234
8910
5128
096
56989
5370
7511
5713
30400
07070
E9500
261
2448
E8849
4260
V560
4421
99832
5821
5722
E8700
2749
7766
V5866
85186
79029
7994
4539
4353
9998
5738
2704
78061
1961
9051
1975
2810
82101
37991
6262
76525
9973
78449
6271
07989
V1541
5191
80502
80162
80015
2638
3952
9920
2967
4733
042
01215
85302
80121
0521
5846
2858
6825
78900
30120
V1252
39890
71943
1540
9800
42781
7906
99657
V4501
85301
2594
86503
2521
48240
4533
E8843
V667
V3100
E9194
9972
40291
340
3591
9679
2538
33819
5715
481
42840
4411
2740
V6442
4372
70706
96501
3576
96909
88102
56941
E8348
99831
2113
7635
V1042
72761
2860
34400
60000
36000
34501
2875
5921
E8147
7291
92232
99681
1124
4422
4258
V293
4440
V1204
E9222
7818
E8801
2630
1536
86401
33382
78606
8620
78607
99811
76406
82022
V4511
35781
55321
2768
542
77989
2536
V552
3963
2864
34460
1560
9623
9190
7464
6824
1913
V3000
99603
2511
87363
30550
30523
V641
1830
25053
6802
V1259
5799
1912
V5481
1103
7707
4571
27739
59080
23771
30590
E8160
4200
38910
0049
7892
5693
1580
E9413
1562
57441
34889
99642
1551
V4976
38589
53012
29530
4847
3229
V1044
6190
7703
E9342
04185
44581
V5413
4110
3682
V8525
5552
28803
3669
3249
28983
9993
4558
47879
72972
45382
81010
4538
1119
5804
E9379
3829
2830
81321
E8504
64781
V854
25021
V555
V4585
45385
43812
V1091
25052
47833
73679
79589
9651
7539
25201
53200
30551
99739
E911
73732
7530
7197
566
99601
5733
40201
42090
33385
81611
3962
2252
55221
78650
4589
4928
E9447
73600
70725
78821
5302
85181
1530
1307
1962
42989
30441
34570
V551
E8708
7856
45183
79400
74783
34461
5734
4786
48283
V1051
2948
E9682
73025
E9347
9726
1984
E9689
71105
25090
3003
44024
E9382
1104
V1046
2143
0793
7817
36250
5363
5609
V452
5081
74365
60782
77210
5798
2779
4413
3489
7708
53501
47874
87342
42769
7831
71106
4738
4730
5753
29540
34481
76514
56889
1532
28521
5853
V714
36210
V1749
E9478
5852
8930
5989
V024
78799
586
25071
7750
80506
9879
33182
53641
8074
V0980
71230
8083
41071
1990
4295
V1242
0498
99932
9130
7622
23872
9694
4404
V169
07030
V4963
76408
V1507
5400
4441
0400
81344
1918
5719
7452
53085
2532
36816
1300
66632
3441
V1053
2764
3379
44422
2760
88122
80508
2112
V4572
7670
V2651
80841
7599
3599
4710
E9248
96509
03843
V148
85201
5198
72291
76491
36221
3574
6110
34690
82121
41511
73007
00845
E8782
7764
2822
4359
71965
36201
37273
78552
5562
2734
V4364
7051
19882
V8812
V5867
1986
78199
3575
34831
4618
9081
V8543
42732
03849
86509
4275
57411
24291
76519
V1272
25031
E8846
80843
E8150
30411
8052
53550
4841
28529
V4587
41001
E8498
04119
76527
9584
3940
1120
5935
7517
V160
42842
20021
79902
79989
85306
1820
71590
2848
44021
7313
79092
V08
37555
9033
0419
3668
V270
53520
71430
V5419
9142
27901
1985
452
95901
30470
57451
2721
30423
6146
34571
2874
30522
6827
03819
45829
9724
79001
51189
30591
9983
496
1700
52510
44481
03812
45383
6238
7015
1179
1888
07032
36362
25200
7149
49122
6944
74869
2890
7469
79093
8220
0051
71946
V451
V1007
99669
66634
7757
77081
5730
99702
36960
605
99593
4820
E9241
6988
V122
3572
76072
0463
80708
75679
2720
V5412
5439
45182
4253
37430
1522
V625
V4573
0542
20800
70702
1991
3488
03840
45981
9583
E8528
99989
4560
7080
78097
4387
05410
78907
7089
52801
7742
27401
V433
52100
7830
V1001
7213
V851
44281
99709
E916
1966
78830
80501
72610
E8529
24200
V8541
36563
E9323
7248
5849
33394
99769
34291
81342
01880
30560
5994
1561
36202
71690
43300
29041
5690
07999
55012
E9309
3481
8782
V4962
99673
4470
4254
E8859
7810
E8888
32726
81200
9248
76528
56039
2270
5839
E8261
V4459
E9410
86804
86501
28981
38600
5855
V1584
4290
9273
V4582
E915
2726
76518
86103
40301
7100
78839
1603
5192
V1271
1514
2894
3384
55220
3076
0579
7767
42822
3373
70400
86350
2793
5963
V103
2116
7230
80703
7702
71598
5194
1953
7705
9348
03842
2873
75563
85225
25043
E8543
5759
1628
82531
7636
0388
39891
25080
V1201
1610
7513
53450
9050
30490
81408
9070
7801
4940
5771
3239
42761
85182
E9420
7720
V011
49121
2771
5070
9340
79099
V1642
1400
73710
47412
42823
82382
E8809
E8538
20260
87341
70721
4559
3561
4465
53784
53011
5409
29590
V4576
4553
5739
7921
43310
73029
3004
99791
57400
E9363
57491
28800
1976
41400
42689
7570
490
51882
V153
4210
4532
72740
6951
E9361
40491
V140
30491
45342
45386
1570
30022
41412
80100
E9299
7099
9221
51881
8831
7837
4219
35801
V1004
20500
3501
74190
7660
71691
V4611
4466
3314
85220
78720
4299
1974
E9306
9971
33811
56081
5060
E8162
V1087
E9343
0701
80605
56200
2825
25003
7462
E9412
25000
4881
0971
9331
33183
7732
1940
41081
41031
3540
4808
66612
7961
470
V554
53240
V1005
72981
7783
23871
4257
V1302
43410
1510
2800
49320
04109
V422
7423
4590
1369
56949
7296
22802
77981
78829
2662
29040
43811
7755
V4986
60889
53781
8024
2251
430
920
80126
36840
55091
59971
53561
43821
30561
75617
70715
8080
V053
3899
1625
53190
1251
20020
59659
4731
56213
81502
4169
3558
30749
74781
2535
85180
7963
55229
0478
8604
05479
9110
6869
5303
V174
4568
2384
2888
0543
5551
78931
7765
30520
71905
41012
2690
72271
2125
V1052
85226
43882
6181
V4579
51889
56986
E8191
9524
44322
2442
40391
2449
V298
29181
9053
86131
2839
64421
30300
E8761
431
9999
7454
E8798
8088
41519
V5849
34600
5934
3439
42611
8600
V1043
1543
80101
4829
570
0413
7813
3490
8208
7700
5642
43883
1109
4801
25033
99881
30421
37852
1123
226
V5423
5118
30001
7731
E8190
76503
2863
7790
78901
9809
9828
7778
85200
4294
78031
58889
30570
E8161
53783
V1088
V1081
4785
2329
2728
5712
95205
0415
8750
7678
4580
30500
25011
58881
2410
82321
V721
53260
E9289
29570
56969
9698
V1351
25541
78059
4019
6961
2271
76409
V1279
75261
04186
3449
5780
138
56985
185
V463
8244
6929
34489
78652
43330
8505
E8788
5589
99662
42741
37000
2375
5888
82020
436
71847
78909
V1254
41402
80702
77211
7083
80220
38611
56210
V3201
4570
V4282
04184
5718
7861
2126
78605
43331
99590
2738
485
V1006
V152
04183
4269
1508
V4581
V4578
47832
0499
27669
E9800
33399
035
4238
36284
E8230
5168
30403
2777
53570
V435
2910
53540
23770
8500
462
V171
4111
E8902
9588
32341
71680
76501
25061
29532
24280
30391
7843
E9320
1640
2776
0931
8730
78066
99652
8860
6191
V5391
1980
V1251
30303
77083
5856
27542
7910
V440
3368
3581
6930
27800
7872
V8801
08881
76719
4412
48242
2898
80135
56983
1409
7962
42653
41072
5819
34510
78701
56781
7235
37034
4659
37741
27803
99602
6910
7761
87364
V707
44389
E9444
7866
36105
9974
07054
70707
7101
55092
20190
45989
80505
1619
4266
78459
72705
53340
82302
72142
3383
20283
8242
E8490
7852
V4973
8738
2273
4259
8603
70714
1729
3315
57490
0539
04112
7231
E8494
71509
19889
7078
9663
30393
2794
78702
28860
7798
53010
1623
4941
7730
2939
7930
2382
2352
2897
1122
9172
5130
7797
99649
43819
78001
7483
E8500
E9470
E9429
5997
41051
78551
37632
V626
7098
37775
135
82123
29560
71941
4139
25073
7461
44022
9630
37900
80704
29520
V4281
72290
86803
34290
37851
44030
73018
99663
1541
25041
5933
34591
0088
40492
V5489
4375
58181
37005
5289
33520
30392
9680
53649
4417
E9422
41082
01896
75329
7885
80706
99661
V1047
71238
45352
01894
9693
2713
74510
E9293
8901
449
E9364
1572
6040
53020
7104
E8583
5768
6954
V1041
99682
99644
41181
0412
25001
3332
2774
1965
6822
501
44032
3071
37739
5754
7771
49392
5772
30122
04182
80114
587
53290
5831
27900
60883
V632
73734
E8792
25050
57461
53500
43820
99563
56409
0490
47829
585
47811
5602
E9348
70701
34839
42830
514
4578
7354
V1202
5793
E8781
V3401
99664
E9393
25063
4474
4739
60499
7103
V550
40591
42760
34430
75739
E9290
4588
37272
72751
36400
74689
28522
9984
03811
E9411
V5865
5305
43490
59789
81209
78009
2949
62211
4582
75312
4781
1175
4479
7746
1464
7724
2127
5950
76498
5711
4489
25082
7617
E989
34982
E8532
72930
80631
72889
71907
36846
8605
56782
80321
V0261
80601
3341
7200
51901
2459
7948
73017
1968
7726
83100
82130
5374
V1529
80122
80849
4321
25020
0949
20211
5789
7776
5966
40310
4389
5961
3203
42490
64821
1715
40599
9729
90089
99686
29634
29650
04102
29699
83401
7262
4536
44381
80125
2189
78559
68609
99671
1521
27549
53201
5964
57149
30583
5119
3238
E8580
1629
9950
75732
78441
5300
43401
8796
4416
30390
5764
72886
53021
29580
0530
99654
40390
42612
E8889
51919
7842
56984
7874
25051
V553
1177
E9278
V0981
E9303
41032
42731
29281
71535
3014
78057
2899
E9359
7820
99665
1970
6820
7020
9708
4371
V1011
64823
1121
37200
27651
94800
7942
6111
34580
0414
27801
78903
V1309
30431
86352
75559
30928
43301
1534
40300
V1009
37489
4846
05889
5579
V4586
9064
20270
99701
4279
V453
37992
79311
78604
V151
E9504
V644
95200
23879
6000
2376
31400
7210
73315
41061
5559
81100
9509
E9305
4386
2752
E8192
42789
9964
E9319
3319
E9174
9341
74429
V420
34989
7862
2682
E8799
V1021
77089
80022
25081
7990
70219
56721
4552
58281
56982
73022
56212
48239
78451
49321
7615
80625
37941
40493
2930
86602
1504
33720
83402
3442
V4361
7931
45389
V301
47875
V142
7463
2254
7265
07071
2513
V1581
7775
V0382
20028
35800
99859
E9352
51851
V850
1960
3553
29630
1490
86504
72989
5990
0074
4780
5521
34590
57512
73399
8026
41410
E912
73342
7140
2733
V4512
7850
5561
51883
30430
44321
59654
E8136
78039
5531
34540
E9317
77213
2230
E9179
V0254
04111
5881
29212
2765
34292
5728
2940
44284
36019
1890
78060
71699
3510
7802
07951
2639
2739
42832
82322
71695
44489
72210
9210
2866
V461
03844
81500
82521
7455
99939
56981
04110
56201
E9503
4358
55090
4239
07020
88101
V161
20152
1707
7220
78841
99668
V163
79415
3181
33829
78602
99931
78609
76075
76079
30521
77082
V4283
5790
8739
78065
1972
9754
85305
20410
3371
1618
74710
V4577
7473
1538
99672
V1241
5180
73316
99684
8404
8711
0340
E9421
V5331
25208
5259
24290
71903
63310
42831
9982
76515
30503
64131
1891
4263
85206
07044
E9600
6019
72973
3331
77181
78834
40290
38630
2767
72992
76526
41091
1915
7608
42820
V5843
81333
42833
56489
28652
72252
1987
71102
5258
41020
E9358
86502
E9804
72272
5178
9100
E8705
69589
E9378
V1002
88002
8602
4561
6143
20280
99679
57410
9072
53560
7245
7280
99594
77982
28959
9160
4168
71945
29680
7881
2519
0093
7294
53440
7384
5570
2880
9054
7580
V0482
0091
7625
75733
80223
5581
7824
78603
220
29562
260
7070
30553
53291
80172
E9425
9986
7788
7626
E9426
70705
V502
5960
4619
6828
7092
25072
2114
80700
47831
E966
0417
44031
4822
34500
5692
80102
56089
319
41041
29389
2730
03810
E8790
2763
99812
37854
4870
9962
46410
20281
2812
51902
82300
44100
60783
2971
78194
E8783
8870
41512
9047
78791
49391
1173
22809
7895
72190
8911
3363
9598
V290
2154
4281
1977
86500
V8741
53782
73004
05379
1963
4270
7827
78899
E9384
E9192
7630
41021
04149
53530
41404
53019
79431
8676
78905
7935
34280
48282
V5339
4809
1874
80020
34830
72671
0272
7209
5716
2900
59589
53081
2893
28984
V180
76517
49120
5902
70703
73313
0479
28804
57511
4720
5131
7806
7823
7991
0416
57470
E9509
4958
990
4142
5226
5968
3970
3804
5368
E8499
94536
5566
82301
99889
6981
2859
57450
V6284
73739
9349
3542
5533
76522
41092
5920
53089
73016
2841
0785
76497
3483
7109
85102
4592
2753
99604
49390
E887
0383
60886
6851
53642
78863
43889
28749
9529
9010
3693
78842
E8785
99685
7131
35789
1463
73026
5401
87349
V1029
94214
78729
72402
2989
V596
7821
25040
73390
1725
V4574
6823
V4987
V741
5723
78906
V168
1512
71954
V653
5163
69010
2829
73810
8601
53220
00581
V600
45341
44629
34401
72813
3009
20150
4255
55329
5569
80503
27951
77084
E9398
V0262
56211
77214
5710
7224
V029
44023
32723
5811
79439
7854
6010
43391
700
3960
E8706
71595
59389
72887
78071
E8844
7512
76407
28989
55011
85011
E8120
4556
V581
79579
99656
V1082
5120
40403
5761
4401
53511
E9310
07031
8250
3708
4262
4510
3082
99674
53100
V5862
V173
57510
2809
25060
71949
V1588
71536
28731
87344
E8151
73028
7833
E9390
81000
7847
8708
6201
7786
71107
80709
4011
74761
3559
44102
8670
42613
2395
E9394
44620
317
61172
80705
85202
E9300
2443
5298
7612
25042
2750
4460
4610
82009
1550
4464
2818
8021
49300
3090
73719
42979
80604
2724
5121
3241
45387
V6441
V1255
0549
7421
20000
56942
99631
99731
81201
45620
04189
E8130
5379
74742
96502
45189
7915
9916
70713
7299
86400
75982
03285
4148
1520
4408
5185
5224
5762
1272
34620
4414
2819
725
77183
V1079
44324
80507
515
5672
30183
59970
83901
1125
1519
8248
86389
V1000
37633
V0991
56731
4400
78099
36900
5601
99762
57430
3310
1622
78722
5781
20300
53082
72673
42841
60784
1363
7041
4439
7784
E8233
V1089
4478
71591
4010
V0259
41189
5770
V4561
6962
86121
1978
42682
56789
3569
76523
3453
23877
04104
86404
85185
3594
51631
5691
51909
V071
74860
936
7560
42610
92411
73027
7981
27949
56738
7589
262
45621
70720
2731
42971
4549
2811
46619
43320
1973
2144
47830
2387
8744
2409
36001
27652
25093
6821
44103
72141
0270
68100
40311
4178
82332
82120
58381
4871
6983
99529
5932
74721
3079
2512
57142
1981
V4365
73730
73009
73300
53140
4919
37230
07041
28850
8028
28319
04100
5280
76502
E8497
41042
V3001
25070
4420
58089
3330
7596
25092
81203
59010
76512
7470
7904
99883
99813
20920
V1085
V4571
5600
1624
5822
2781
30502
E8786
76621
77212
V1003
7936
3485
71236
53170
33818
75251
7793
42652
99591
78959
53084
E9304
V4589
2554
8020
27541
51884
72293
5181
82021
56962
V5869
5854
80120
7542
V441
5647
7756
5724
37943
5720
85221
82525
71844
9553
44029
7905
60001
9092
9181
25030
68110
25002
7704
72619
80701
V5883
5111
82392
48289
9032
9642
9701
75263
20400
2766
9995
7919
30563
E8171
80504
3484
95914
25012
43853
42821
71596
80600
2699
3099
6953
34404
E9424
48230
48249
5845
9678
35981
9222
2879
E9307
31401
30461
70709
7804
29572
9654
V4575
78760
V141
30000
V427
7515
30540
75162
8820
43311
V1301
5307
7318
V8537
E8796
86415
5571
56723
30541
5550
73008
73314
V1551
0389
3201
5100
53789
6084
2558
E8810
30981
6989
99639
E8121
486
78052
2572
7048
73722
60091
3361
97081
34680
49322
46611
2555
76524
4599
70901
53390
7873
30751
E9654
87320
E9351
9992
44421
80031
07022
44020
4423
E9313
4280
25083
7234
58389
76496
4380
20510
2867
8760
1737
243
56202
7202
412
E8600
5362
75501
6960
45372
46431
35782
193
1921
4555
20502
1573
42291
92320
7243
4821
7282
5184
9975
2732
73741
42843
63502
82535
4373
73005
4430
28489
86330
E8501
0880
5225
20530
56881
1503
99666
3552
5951
85256
4660
25202
45821
78659
59381
81221
V5861
1982
86101
V643
769
1919
2851
3941
5967
70724
65641
3093
3051
81510
99592
82320
43822
41401
V1072
30501
2541
V443
1578
7062
30471
7661
5678
E9809
85241
2710
27787
5859
7717
7891
8748
V462
56722
76383
73319
V442
0090
81322
7868
78079
70710
E8493
45184
37501
04082
78051
59582
4230
7310
43411
8832
75619
56400
28249
4550
4471
5641
541
7964
E8842
3536
9980
5779
1505
37652
72884
V642
4289
20411
53541
01803
4271
3577
46451
4233
V4983
1720
8082
74687
7811
45340
72400
07051
2411
55320
3240
5110
76504
41011
7336
7671
3480
20218
V7651
390
3370
42099
78703
96500
07811
70704
9690
7211
73670
2722
7484
34550
53551
4162
6039
53400
57460
5680
25022
5679
43491
78904
V3101
86601
56961
95911
7424
57471
86813
20288
V113
7244
0312
E9383
48241
78843
76405
86229
2121
71902
8064
E9392
1620
78003
85205
85222
38861
30011
1533
74569
