71598
86415
V556
5715
99813
42613
V1000
9726
77181
E9363
28731
9986
75989
45341
77982
2724
5768
V1259
76514
6869
9800
5119
V4578
25040
44021
V442
42971
4430
E9308
33182
9340
9210
2825
4251
E9293
76525
44329
2875
25053
1560
9693
87344
3361
57441
76079
27541
92400
72293
V1042
7213
78909
29634
7454
6930
7280
99883
99663
76719
5521
8028
59381
43820
E9478
43491
59389
77210
4552
V1201
3310
03842
5070
30421
V4571
72400
V4283
60000
4321
03844
V1251
7895
5128
E8502
99662
V1005
07999
4295
24290
78791
86612
V3101
6823
74742
49392
25071
V550
9654
5779
85225
8056
99859
79902
86500
99667
73390
56089
3694
56941
0479
42653
34540
72190
44284
7469
42612
25003
78194
8911
E8261
2409
8024
30560
4232
38611
6951
E8700
0389
73300
53510
59010
1541
80501
7963
44322
78559
2971
44020
1518
25090
5120
0542
2763
7210
9724
7804
4561
6961
48240
78901
30491
19882
56039
33394
81209
85011
0088
E9288
V1006
75312
V174
5370
7783
1508
53082
2866
9708
76513
4556
V1581
7673
75563
86602
7100
3239
77081
6191
7935
V3201
1562
34982
30550
81200
1173
2440
70707
73679
2762
1984
48282
5793
4940
9972
37230
2765
72989
7660
05319
2639
79001
28521
7102
V433
72973
36202
47830
40390
7485
74689
5968
138
7854
99676
76504
3071
319
7906
V596
2752
4659
7955
49322
74602
V4611
2841
44031
2114
70703
27542
3004
41061
36846
4352
30591
78907
2859
03811
6821
25002
80506
1369
E9424
80125
V5339
29410
99681
5569
42842
41041
07051
74569
32723
4266
0549
3484
3320
45620
8404
78701
4555
V632
77214
28860
82521
52510
E9378
E9503
E911
3960
28249
60886
77084
72252
5859
4589
585
501
4238
30553
V4581
3659
9222
5711
E8498
99664
5939
29181
69010
E956
9630
4370
4230
E8781
E9800
56881
5920
30390
7905
82302
20028
53789
V714
E8782
0380
0415
V4459
43401
4253
3899
7248
4571
2532
27800
55220
7243
42090
2874
7463
V552
V667
6820
5305
30540
78900
2912
4290
0382
41042
73027
82121
04104
7423
2767
3330
5559
99832
2822
4619
81341
57420
07041
56969
4582
75559
1965
42831
9993
2860
9349
E8583
3490
7788
9110
V5883
7775
E8780
5932
7530
V1209
3576
43331
99594
04110
80625
53550
V1584
E8881
30590
07032
4465
9983
86504
9961
2731
4941
75251
4739
2384
3594
7790
85206
V4976
9587
41410
75733
9160
86813
53010
V422
22802
4550
E8494
56213
V1044
8676
5738
V4582
29212
99665
3379
36221
2948
V1003
5647
4413
2939
28982
7707
2888
462
2760
2830
E916
51883
340
44489
4928
5374
71945
7720
85221
6851
76516
57400
5967
8711
9974
99601
45184
1550
4821
42731
04185
20300
7793
24200
99701
73314
V3401
58881
5754
1536
7755
88102
4476
34510
6202
5163
85306
29620
77083
4294
04101
29633
42822
7776
70709
E9320
87342
99779
2410
5194
80709
3384
V1301
2682
51919
8220
82101
71236
56731
4299
71595
7708
5849
8064
41519
V3001
4560
8700
4242
53784
78702
82382
99590
47831
2411
30928
28319
5589
53089
42611
9992
25010
496
1124
3383
7837
7101
1972
75329
7048
5716
E8784
53782
7726
V707
99889
34839
7231
3569
48241
4358
82123
920
3488
4148
4262
45189
V202
0463
33399
25081
4359
8082
82525
5789
86101
7948
1970
7786
37851
2930
7511
85302
42732
5191
4588
5961
4168
42291
2733
E8493
1912
76529
82300
43811
7813
52100
79092
E8499
V581
74900
49120
80507
78609
29281
99591
53641
5609
5303
7473
7921
70714
53170
V4983
53011
04102
29680
V441
30011
05479
5724
88101
75679
725
53540
3940
80600
1918
76515
29590
70706
42789
45989
8052
56200
58089
45829
4231
E8798
V446
7612
V1202
2811
99639
99685
1962
4846
2520
E8888
80843
7907
82111
38600
E8706
42652
76502
E9600
78321
E8160
7757
2873
7197
0785
V160
03840
25050
81000
71590
42761
23875
55229
47874
82332
7622
1179
39890
43320
V1588
25051
34831
7990
48230
7539
44023
4241
1121
4532
V153
78606
V1021
56962
4239
6822
72887
30401
85201
82322
4400
9973
85102
79029
78003
53290
48289
9341
7625
8601
29630
V173
83901
E8790
4786
7931
V0980
486
9964
V1001
71941
56210
29650
76072
76517
V1083
03849
1978
7310
56400
5183
7135
78079
76501
41081
3483
53560
E8843
V502
75982
3962
7868
0417
6084
E9310
5583
5988
7706
72888
77989
6827
80102
261
76527
3453
4553
43883
71690
V1272
0413
70712
34590
6000
2883
7919
E8120
9651
99709
5728
E8799
4210
41402
25001
78829
1538
8750
E8136
72886
81500
8604
4401
1572
8248
2769
76522
2535
E8528
V553
4264
5693
V5867
E8504
20400
7876
99811
E9398
3201
72610
3090
22809
42989
99686
53084
80021
80100
5778
4781
4110
56984
51881
99702
6983
5650
E887
34680
5781
4441
7701
25083
4257
V0482
42820
V5489
4271
2449
1624
66632
29640
87363
53012
3591
75619
E8859
8748
7462
78551
35800
41072
43889
E9504
8250
V451
73313
76496
4293
5723
E8842
76406
25011
1977
2863
8054
8730
42490
5771
3558
185
1122
V644
3099
76405
04109
85226
7621
1975
4270
2721
25020
57471
40301
76621
30470
4412
78722
5100
5722
5712
73017
80122
34591
76075
30563
30000
99769
7993
E9429
1891
3363
E9426
72972
81100
V1046
49320
42840
57512
E8161
6824
56942
2273
77082
3241
66612
56985
7847
7761
V071
36201
3575
8029
86405
85180
30503
07020
V4365
7732
41400
7845
30400
E8705
3481
25063
5819
42833
99674
76407
80702
7862
V053
85301
57450
E9421
51909
5289
77089
V5865
75310
V08
04186
6929
25200
99666
43301
3441
53530
0543
E9179
7700
V4573
E9358
2720
5730
45821
7840
25043
80700
4478
56949
81342
2689
44102
20510
7962
9092
9679
20410
30300
E8796
7626
8074
32082
42841
042
53642
V3000
71965
44100
1888
80503
04111
3688
2536
3510
20500
243
E8801
1919
81601
34550
58281
0312
74687
1991
30122
42843
86401
49390
9694
82301
5400
2899
5845
7824
42781
V443
9999
76524
27739
71536
3480
73730
85182
2726
99672
6989
5678
80325
74783
7852
V290
2189
56081
42832
30393
6826
9331
8760
E9383
9351
6954
03843
V721
9584
41021
5734
64823
2858
514
7470
74365
56982
0383
V5419
2880
5762
E8809
79093
5178
7109
72402
25062
4169
E9352
76383
E9194
41011
53783
1552
7842
42682
1974
99652
V301
56721
34292
E9323
48283
80121
99673
V4282
42099
7678
45621
1578
7211
37200
7810
586
29040
V113
5881
8240
74860
2375
3203
5181
E8490
2111
25061
7718
E8192
3968
25042
8505
605
99644
V4972
7635
72889
V600
76528
9678
V0259
80508
5130
4372
8080
1622
V8801
2851
4592
3963
7885
20000
5185
34290
V8741
7904
7661
11289
8600
6960
73319
E8543
4580
96500
7765
4279
36210
7806
1510
7717
7861
5566
53140
8832
57149
E8792
4010
5533
71105
V5869
55092
E9392
41051
4160
25012
30001
30551
4019
30501
8620
53561
53260
7533
74710
2512
E8147
2848
1971
V452
34489
19889
45342
74781
5856
7560
36900
2967
5272
317
44101
V1052
07071
71535
5770
78552
2518
2252
311
99671
78650
0539
25541
4263
8602
2448
78830
481
2572
E8495
7098
E9682
3501
7099
V4586
4820
76518
51901
79099
E9393
30490
78550
436
51902
E8497
30981
73342
83100
V5413
7484
88122
49121
7299
3669
77183
570
80706
9971
1551
71106
73018
5990
4538
80703
80849
25060
9010
3371
56983
1985
75263
1625
4375
E9361
42830
53020
1520
04100
42769
E9317
43882
5111
76503
96509
V1279
9070
77213
8820
76523
28850
2270
E8788
4472
4260
99659
04119
V163
45981
41091
85300
V4589
E9331
5921
75732
3003
55321
2511
82392
34291
27650
81344
1531
85181
82320
8738
V4502
1363
34501
V1011
92232
9962
V4577
57510
20283
V180
2441
7784
86400
6910
57451
7689
2897
5710
9998
1961
30500
7464
V4579
47829
1973
5690
20190
2869
7823
5960
5531
2864
7070
56409
43311
5180
43330
4738
5602
V4962
4785
56723
7778
81201
V1582
2127
34889
51889
E8810
E969
2989
3942
3240
4920
5718
4411
30561
2810
2800
25000
88002
71596
81220
1103
E8708
70715
68110
9663
7866
7797
4847
3314
20288
V642
73710
28959
3570
9072
E882
80708
5225
3449
9982
80120
86121
V1051
1890
86804
7812
34690
30411
V5861
9130
V4281
80505
V3100
7795
28800
E9309
4590
53240
25080
5379
5168
53200
2713
8208
99881
25072
8910
72292
53649
42091
5121
4422
3559
07030
5109
73026
86502
41071
25013
73028
V0382
5552
80605
27652
7295
2819
7608
7384
9698
30391
7742
1976
V293
25082
44421
44321
7483
70713
53085
5996
59080
20210
79579
5780
7730
36250
80220
57511
4240
45340
5571
7503
59654
04189
41031
70705
5672
E9359
64421
7318
78052
99604
2900
430
70704
82022
7596
44481
85185
V6441
V103
85200
7424
4269
27401
485
515
V444
56789
V1002
5550
5307
78605
5761
99791
40310
5750
7750
7820
V270
4439
E8791
1820
99669
7230
E9420
E8786
4539
7421
79431
7705
25070
9181
43822
85220
9975
35782
31401
86803
8026
E8532
70711
2773
4919
99831
3181
7671
7856
44024
5192
04082
60883
7630
80101
E8122
4417
2740
6238
4142
5853
2949
43821
431
04182
0416
75501
99682
29570
20280
34400
77211
7731
V1072
37854
4440
5579
3485
36281
0701
V4364
5110
11284
20501
22801
45182
80841
25201
5363
1623
27801
5258
E915
2113
1982
40391
41401
E9509
V6442
42979
4558
73005
41404
30520
7580
55221
V1009
2630
4578
5081
55012
7716
1628
56212
58889
1987
41412
5528
03810
73739
78039
30301
81221
9588
29562
78820
5280
07070
57491
61172
73399
44022
8021
V5331
99649
3332
7515
85205
56961
5118
44381
34460
78659
V1082
7994
1125
8072
47832
57490
5641
3970
8822
E9394
72271
E9689
E8121
53501
46431
34830
5758
7670
30570
1940
566
85305
7798
7756
56722
70719
56989
71946
8083
5854
4275
28529
6146
37272
E9379
07044
42821
87343
80705
28981
96501
99592
4466
4599
25041
76512
7291
412
8830
E8130
30471
8020
V440
7615
7245
42823
3941
2738
V420
V1047
3643
7873
7863
78057
2764
2521
5304
4139
5691
73382
2761
76408
80604
86601
31400
3014
24280
56981
75261
3051
53100
56211
85202
87320
2662
V854
7452
44422
V1087
V1004
23871
5679
1729
29530
49391
99602
77981
56729
53551
0388
6110
4255
35981
80126
7242
1981
V454
5798
43310
V4986
60001
53390
3229
78603
86509
86501
2112
V1007
41411
7455
33520
70710
E9300
71906
4423
4829
V1043
V1041
5570
25092
74429
85186
E8230
76526
5300
76497
1533
51882
1960
E9479
86404
5852
7702
99661
7991
2809
9690
4870
7766
28803
58389
5855
3540
30420
490
22804
41001
5934
79439
V1271
42689
55090
7724
V4975
78097
55320
7220
77212
E9305
5790
V1079
1619
5224
1968
7140
0414
3572
53340
E8190
V090
V461
41012
4408
V1089
78001
5772
2554
E9289
769
1629
5733
78841
41092
9916
6262
64821
73008
3313
1570
87349
9980
53190
56889
E9500
V4561
44324
3599
81322
E8846
7703
41189
41511
04184
1980
8260
70701
56986
73015
39891
99762
30183
1509
5695
9828
43411
4111
V5332
76519
V4585
E8889
80704
86389
4280
86503
E8844
E8849
9950
4281
4470
53541
40291
72210
75739
591
E966
7617
33829
2750
2920
53019
03819
E8151
2387
5720
30431
82021
7821
69589
7892
99812
E8783
00845
07054
1983
E8191
1532
452
44629
80701
2753
76498
9951
E8162
45183
5302
78009
80502
V1085
135
1505
4373
7843
2722
42741
1830
7764
8244
5839
8670
7512
3079
5997
28522
07022
4329
5184
34401
E9290
V5866
73007
72981
95901
80504
53021
4471
E9444
V551
4822
V6284
7850
1966
9984
3331
7078
51884
5198
57410
78906
74190
85222
V161
V453
E912
73309
7802
1748
E9342
4389
2913
58381
87341
70702
E8150
20020
1123
2749
E9804
8708
V151
27651
V298
7767
2910
44103
3439
99679
29532
4414
1120
4254
82009
4568
36960
53081
2768
4660
V641
262
35801
5601
7746
7872
27549
2867
76409
2839
2766
9100
V4501
5680
3009
