99631
7661
7843
78650
4881
30431
V0382
20280
72210
82302
V463
V721
80020
56211
20190
V6442
45389
9584
7906
V632
V1241
5550
57421
5130
8930
4870
1503
V600
1820
70703
5759
8024
V420
V1047
1572
501
9081
4478
1963
5583
66634
4294
3441
53100
V1749
19882
48283
4387
30483
0701
V1000
7354
2114
33183
78051
94800
25063
1490
37852
29560
70711
3572
57490
1913
30490
72211
73028
V3401
5100
5963
79029
5950
8738
78799
412
22809
V011
28652
9962
5528
V1201
71901
1103
8796
74761
5401
V3000
7955
4019
7731
45821
V153
56889
1628
40301
7384
85011
4871
30120
4578
9800
7463
7213
7806
2382
03812
27800
74689
82130
28319
3669
1177
E8600
4242
27650
80843
79579
1985
V443
7101
7921
2518
27739
99603
07054
6190
42833
4401
E8529
6983
45341
4253
7717
E8120
71102
7098
81601
4279
07044
80700
79099
43813
5716
4260
5191
56942
4439
8054
34401
8744
25208
36000
99666
5920
5829
7245
E9288
1974
V6284
4479
76524
9588
7817
V1507
57511
3079
9032
9964
23771
2713
7051
53450
75982
44102
77082
28982
V3100
42821
34400
30421
5761
3591
6951
45387
42613
78602
1623
2726
58189
4380
20000
32082
V4582
E9194
5715
80015
0382
7092
80012
7083
25030
5770
20502
38861
V1202
99592
4232
29640
566
2875
5523
56985
27901
5601
E8780
9984
82123
E9310
41401
2541
36400
2375
4710
E9299
37633
V1082
9273
4358
73730
99813
99931
V1001
0090
7706
4139
1965
1541
7820
48282
591
25000
5734
73309
6929
73342
E9421
6822
E9479
9222
6271
1532
57142
99859
5733
5921
70706
80101
3368
9033
E8849
2440
1962
6826
7140
1961
43889
03843
78060
4430
3897
7504
1700
99661
7708
80325
72992
99604
3576
99657
5798
7282
20218
V5481
V461
5997
80135
2639
E9278
77084
V4512
72887
7811
V090
E8798
1720
73719
4148
99639
59381
27541
3510
04100
E8782
2949
56738
V1309
80502
42979
1173
1977
4472
4588
37900
V161
53783
V4581
73018
58089
1409
99673
2521
31401
27669
77081
7801
2767
5180
20260
3480
71230
99989
45385
E8843
V4511
E8801
99676
990
30001
V4365
1512
2127
53520
514
05319
42840
1737
43882
E9289
79431
3314
2859
V1204
311
2536
2910
72141
5569
V3101
01215
78065
8244
53021
27787
7262
53190
70701
5193
71699
9972
71236
4538
25010
E8902
E8768
V549
0091
1978
37652
37230
2822
73390
57451
87364
5969
3490
44329
1715
5764
43819
47879
80701
9010
85182
28860
1918
85301
1508
53500
78829
9070
4841
317
79400
E9420
3319
44489
1307
7015
700
605
36284
70714
51884
E8889
452
5680
29562
3485
V140
85222
0949
71596
82382
56723
4420
70724
96500
E9359
6828
78031
55229
V441
53240
E9412
60091
28489
41020
42099
49121
56981
44620
92411
76518
99656
96509
7919
99709
7837
29040
04104
1520
41400
2774
5642
V5843
V1584
41012
30540
56212
76517
4370
73009
7078
4510
V142
E8790
5779
56489
4730
3804
5722
1125
99664
V1642
6039
82531
4359
46410
4162
72403
6851
5131
47829
V1041
V1251
42689
78701
30411
24200
30751
4731
57441
41091
V440
2699
7945
V4586
76516
19889
30550
43811
4416
53089
86803
5754
2352
73810
7812
73734
36234
8872
9587
9693
2810
3370
56089
51883
55090
1561
3553
4940
27549
79092
7102
78903
1120
3341
53550
2740
07071
4659
7831
68609
E9398
9598
7821
7827
E9192
8603
36846
53019
56039
78079
E9447
30500
34291
8730
2894
57411
79093
5933
41511
5579
60782
92320
99832
40310
096
25092
E9394
4568
43311
73025
V4574
7716
29540
30501
2841
E9478
29041
1640
28731
81611
59654
V6441
30523
74781
5185
44284
99642
80616
3952
1300
V4364
28800
45383
37991
V446
3899
03810
V1002
38600
V625
71509
5647
85226
73741
07020
72290
4011
7570
4417
042
5678
30583
9529
76526
69589
E8785
73007
1759
E9331
V8812
0479
7596
2271
5961
1986
E9293
45182
2111
1629
4552
72273
53260
V4501
51901
8026
7702
78905
V08
23872
5845
E9384
1518
4739
71105
30423
45189
5720
25070
2812
55320
4733
6869
99731
2731
V850
1729
9809
V4572
37005
6944
0412
76515
20300
138
78906
43331
6930
V453
43491
04189
7885
2749
2863
2689
37739
35981
86405
2971
0463
1983
80031
32723
27900
2777
7292
30503
81510
V5869
1580
78659
9961
5991
44481
47875
1519
3004
23875
86330
30460
V1089
80662
82020
8782
4239
2920
E9343
20400
2989
4168
5303
7993
2721
E9422
72619
4441
262
V4577
25050
0093
7131
25081
78606
6825
42983
V029
5109
V1042
96502
V4975
57410
6960
44322
9093
5181
E9411
1622
99601
48242
64781
29389
4271
2270
78199
5259
2411
1912
V4561
1619
E9470
60783
260
70723
01896
42091
3488
27951
7454
V071
E8784
74710
2893
5272
V1006
55011
2558
75162
E8799
40291
2788
49122
E9317
53501
41041
V4611
70705
5804
4200
1560
V1009
30522
2532
5989
E9379
99684
40311
73017
9995
37941
9828
E9320
63491
E8781
42831
99662
34839
4423
1891
V854
57461
53570
48240
78039
4280
1538
74721
V1252
55321
2538
23770
55091
82321
E8792
5600
2830
2662
65641
4660
1990
71590
42611
25033
35782
2883
7861
71695
41082
7310
V462
28529
3453
9679
7455
9999
6989
78900
85102
7833
7589
55220
85220
44103
9992
E882
5409
V1253
436
99811
6143
5679
5819
70713
7530
1981
5561
61610
6910
5739
86121
3559
3552
74742
7778
2251
45989
9690
1620
8072
3829
7533
71598
E8147
V1051
7230
25040
2888
78907
1970
7840
V4585
470
9340
70715
71109
E9378
0785
E8842
7771
25061
99672
99590
56984
V8525
2765
53784
7824
53081
6953
99665
3558
9708
E9364
V0482
5300
39891
25202
34550
E911
1109
25052
5183
2752
80504
7296
73005
V168
V1279
34501
70709
58889
5307
7804
7135
0793
47874
30563
79589
V444
7070
76502
3383
8901
80120
71844
V5861
E9424
42971
E9352
2939
04149
725
82121
4289
99602
2554
1122
E9689
2254
9054
4267
57420
V293
2913
E9319
36202
53390
99889
35789
5258
7599
E9241
8605
V642
40390
45184
34570
59389
6981
0088
30502
490
44032
95911
70702
25020
V152
3203
3542
78607
V0189
29650
7935
E9358
58181
78603
73315
0414
99702
07041
73670
5226
6010
V1088
30400
E9307
7755
7291
30401
07022
78820
5566
28981
48241
E9308
9729
7907
7784
34982
41032
78830
72293
3082
01894
0971
5695
80601
3574
42769
3581
2890
47833
53530
59971
E9347
2441
1982
V556
5552
78909
82009
2329
7783
V3001
53020
5118
71101
42841
3489
82120
59382
8029
99644
80705
5793
V1302
80631
53011
40300
80021
25093
82021
2638
30461
E8708
56986
9982
90089
2819
5111
319
80508
1973
5831
2808
E9429
3313
25073
5119
59582
44020
5224
86404
33829
7109
43401
08881
3239
37501
29699
1624
73739
V1004
7756
79311
44022
0051
0270
V5866
6821
44389
7089
25090
5305
4560
E8844
0542
30491
3599
135
81341
56962
71946
V5412
1570
V652
E969
49392
33385
7235
52510
48289
04109
5120
V4972
3708
99593
78451
E9410
73710
62211
30561
57512
5719
1530
71903
V8741
4386
75619
2866
72888
0579
2125
4738
7830
2794
2897
E9342
34680
8021
V1551
44101
7234
99932
56941
3963
3093
7793
48249
8870
78834
41071
1272
1984
43301
7318
44281
2760
5771
87343
70721
45621
7636
41410
30393
7248
8832
V163
4389
44029
28989
80121
3240
E9248
0400
0796
E8499
E9509
E8150
22802
74869
E9390
E8881
6988
2682
58381
7218
5370
3499
E8497
44024
7854
25051
53649
30749
E9654
8500
7703
V5332
83402
76523
53170
1543
78093
29590
7202
30520
46619
41072
42731
4411
99671
73382
4919
193
04184
55329
7991
5888
7210
70219
33399
V1259
5379
78605
5304
30441
4476
8208
5363
01880
5952
1179
20211
36001
4111
37272
2967
56781
25013
25002
52100
27401
V555
80114
72272
V0254
V626
4378
80841
1987
7818
85221
7746
3561
71954
4270
28850
60784
59970
462
V5391
30022
88102
2116
99681
96909
2898
29181
1369
25072
45382
3577
85241
0312
72400
78839
85256
7513
4404
243
7104
486
7863
4720
78321
7461
V103
78703
74687
9221
99769
72981
45342
4555
V0261
71945
2387
2779
4571
V1079
20283
9553
44422
7757
5935
V550
85201
2869
07070
9142
41021
42823
V290
3942
71595
36840
70707
5811
1504
28803
V0980
7942
99654
49390
99667
5724
E9682
71536
E8786
5758
5110
85300
5790
34690
5718
5690
E8500
47412
6962
7905
5609
74783
76407
5855
9583
V1209
2818
9100
75733
0416
36563
V1254
71905
99739
6202
9038
04182
5780
V1351
86352
49300
45352
7103
36900
57470
4550
9701
28804
V452
4233
56782
3659
53789
45372
78729
20800
4465
3439
0490
V8801
30981
1874
2728
4373
78899
E8501
34600
V5489
5691
43330
185
8064
76527
71949
V1091
4582
37923
V4963
59010
V2651
V1301
E9323
34489
41411
5951
390
7876
56731
4570
77181
4219
80172
4230
05313
43310
5187
V4571
56200
V553
E915
20150
74190
99659
76503
71107
35801
5713
56210
0880
3241
8020
80709
261
E9804
33811
5551
72973
V1588
53220
72142
V0991
V422
20411
47811
77981
48239
49391
33520
E8171
04119
2704
6111
2594
V173
85306
25043
41189
25022
4010
V427
0272
37990
51631
4464
83100
70704
8820
45340
73015
07032
2442
V4283
30590
E9393
82101
2409
43821
80503
4257
78760
57471
60499
8822
8604
58281
99701
34500
4474
E8783
0417
0340
4231
53510
1514
28959
5822
3379
V0262
4371
3501
70400
9050
31400
E9361
38589
V551
4262
9993
87320
9678
2512
3449
74510
V1081
44381
2513
43812
73313
7766
87342
1940
1552
0383
72813
V560
56081
9172
76529
01803
1550
4589
1505
2273
485
73600
20080
9623
2121
75329
5302
33819
44031
V5883
V1052
40491
E966
4142
81200
78550
V5867
5994
2112
7200
5762
9642
99674
40391
27651
2230
7866
34580
7761
V707
9975
34830
V641
47831
37200
4258
34510
47824
E8490
86350
42843
7020
7881
68110
42610
V202
07031
9654
79902
8242
5368
4822
V433
04101
2443
72884
34571
86389
71907
9726
2144
V8537
8600
V1255
3968
0380
5192
V4587
0931
2724
53781
7243
5710
37430
6824
2851
29410
42741
1536
53400
4928
94214
8248
78459
1121
5839
20288
E9500
30300
4466
E9444
80708
72889
96501
78057
05889
3331
V141
70719
3051
59789
E9503
7850
226
2948
53200
27803
2800
58389
87363
55092
3594
6827
44581
9331
04110
77089
25083
82300
5298
8404
7963
74602
44629
47819
5990
7209
2860
34280
7580
44023
V148
49321
43853
78559
V851
81333
587
78901
1890
81344
2732
2750
78059
53082
6110
5060
78066
83401
5738
75989
5712
7517
E8498
V1541
4553
5362
99563
7211
34290
E887
7295
E9300
07951
5538
34591
47832
5964
V5419
40201
23871
3442
37851
5163
1540
6084
570
42781
4958
75312
4263
03844
7220
3570
V169
20920
V8541
43410
9754
45981
0498
9920
80600
1510
42822
51882
8080
46451
42989
97081
V1072
3668
2771
2766
78791
3076
53560
73314
73399
42652
86601
E888
4321
40492
4580
77989
V174
4372
27730
V1581
20501
4414
7895
78842
541
71690
2781
7852
1991
500
04082
78441
9670
9950
64131
80122
9351
57430
4533
515
53201
82022
34481
27542
86504
1573
36281
V4986
57491
78863
220
7856
70901
79989
51851
E8583
4299
2809
5856
41051
78904
34831
V1085
78843
25042
5081
2384
20198
29630
E8495
2899
72972
1618
3361
7470
36019
8028
E9222
V4962
7041
04185
36221
32341
V4987
4169
E956
77211
1972
53551
1104
5881
3484
2113
V0981
7689
2734
42830
3181
8602
4539
0074
2900
E8543
99591
3320
2879
57460
7936
1725
8082
7930
49120
53541
2459
27949
8700
2930
5641
37034
9212
V1003
36250
41061
38910
3330
V1272
9711
53340
30183
32726
4422
7873
4160
25200
5672
5589
6191
9663
4238
72402
7062
2793
0419
8750
6961
8670
V5416
78099
8056
99831
4809
1463
5750
1968
55012
20152
E8580
V451
4400
25541
7961
2940
2126
2690
1953
4352
6201
80321
34540
70710
4920
73026
V1242
41092
0413
V4575
95200
431
2763
V4973
51889
V5417
5778
7299
87341
2710
V4576
496
80125
25060
70720
E9392
7910
4210
3569
V160
76522
75251
7845
29689
20021
2730
78720
5768
9524
05410
035
9974
5571
41042
20281
1830
72190
42682
53511
45620
2839
E9363
25082
4780
769
3373
57450
55221
5781
56400
4847
5960
4592
72291
9190
72292
5225
E8233
2189
4619
1915
03842
V5865
9059
80604
30392
3941
V1046
71691
00845
3481
E9809
340
3540
60001
04186
70722
24291
07030
68100
07051
49320
30301
1534
9053
7891
56213
7197
2761
28983
7813
20530
E9600
41001
E9313
V4361
72252
E9356
5650
30122
07999
00581
1400
8245
25062
1522
V741
81408
5996
43883
7964
40501
30551
V5862
V643
2733
30521
V4573
85181
29570
E8788
60886
56202
45183
4412
04111
V4578
E8538
4178
7242
53290
53641
78052
51881
5968
36210
7802
80507
99594
7742
27801
4829
7868
80704
2739
2858
56789
5934
4590
36201
99668
920
60000
4599
4353
41081
76525
73022
8739
9983
71238
73679
V1021
25011
81209
56721
30560
72705
3371
V8543
7872
1888
78841
42732
V5339
71680
73029
5178
99779
V053
0499
72930
E9303
37489
99686
4413
2768
2874
20500
51909
72610
73008
9986
2873
81500
2722
V4281
73016
7149
7892
2829
35800
52801
V1053
6181
41031
72671
73722
5128
46611
2773
73027
7862
36960
V5413
36105
9181
11289
2738
2867
85200
25001
E9504
1610
E8705
72761
43320
E9426
42090
7511
42832
2154
04112
81100
56982
V180
7100
E8348
4264
40290
E9383
34430
4556
4785
30303
28749
99762
E8230
2776
2395
E8761
51189
V1529
1960
9349
75563
42760
4251
8260
4559
V1582
2555
86103
E8859
2252
29530
25012
27411
63310
0521
03811
28984
34989
7823
V435
481
6823
86229
V502
E9425
25201
9092
1533
9051
80702
81010
9341
80100
53642
78097
2811
20301
73004
9509
V0950
03285
E9382
59589
3009
99812
E8502
81502
5854
60889
71531
5531
99679
42761
78009
76512
V171
V1271
5821
71103
4838
8220
27652
8052
4470
2865
586
29572
41512
25021
29281
80501
E9306
22801
7707
78702
7948
71941
6238
99881
0549
99939
7080
4808
04183
2520
20270
99652
936
46431
75679
30541
V667
11284
0049
79439
71106
4269
9680
41002
3619
7705
1578
7981
7874
73300
78604
2572
72939
42612
76514
43490
V4502
4259
4421
29580
86101
34461
56961
72401
37632
25053
72673
2825
2762
38630
61172
86804
5789
78722
7810
39890
41404
2880
2376
5730
6040
V1011
5753
7904
73319
5562
5728
0543
4489
V5423
V1029
7483
40591
V1007
4846
27503
7842
4536
56201
7776
6820
53561
3071
V442
E9413
99529
4275
1892
37741
E989
V113
35781
20510
E9174
5939
3315
8921
30553
E9348
5902
44030
V024
44021
2848
56881
07811
05379
30470
5711
29620
03840
92400
7750
4110
78003
77183
9047
3694
4254
37273
V644
42842
2397
5799
V4459
7313
29212
4375
V4983
72886
81203
3384
47830
78551
4561
2769
E8888
5852
4295
2410
76491
E9304
78931
40403
63502
81342
7994
99649
E9309
99682
56949
29680
7990
76519
71535
75617
5853
2449
9064
7704
34460
82525
30420
0539
449
69010
30391
1707
22804
82332
24280
85186
5602
30928
79415
1976
430
72740
3099
44421
1464
76513
1969
71943
74762
24290
37992
2630
V1005
1123
V1087
E8261
2864
71902
73316
80112
33818
28521
71847
7732
1971
542
5723
4241
57400
1603
4549
7265
7847
E8809
42820
E9305
79001
6000
E8532
5693
5559
74860
30924
8860
04102
5846
34620
E8528
86122
56989
29520
6019
4821
36816
1531
E9351
25071
3238
4266
E8160
E9554
8088
95205
1363
V454
80022
3332
25031
56722
7931
78652
34404
05479
V4579
99883
7775
53291
4408
5533
5289
78552
7542
E8796
2764
3363
E9290
4329
80162
30000
53085
72751
43820
0389
2720
56983
41519
40599
5168
43391
34590
99663
9552
73732
5070
9998
4610
92232
1251
4460
23877
34889
37775
E8136
53440
E8791
80625
78449
2373
95901
03819
6802
33720
5809
6146
41181
51902
3575
E912
1175
45829
1521
5932
V4282
9072
42789
1551
3090
53540
9248
5374
71430
4471
3940
3962
29532
78194
49322
5967
V0259
36362
6954
56969
1980
9879
3229
41011
53010
25041
9973
2143
45386
7294
81321
7231
53140
4618
41402
40493
V1083
1921
81000
7424
4255
V4976
5692
82535
3643
41412
7224
0478
1509
95914
9916
5849
4558
72271
5859
4801
5121
42490
4440
2511
28522
9980
9160
E8700
V7651
99669
0530
1919
59080
9348
72989
1748
3003
5988
51919
9971
7244
59659
2753
E8704
V1043
7038
76528
28249
7464
05419
4820
78609
99685
80223
7099
5772
9694
5439
5966
56409
V151
4941
20028
29634
V4589
7512
4240
30390
5570
34292
4532
2519
1119
2535
33394
43411
44321
5184
71906
7336
V5331
9951
56729
77212
64821
V122
78959
85202
3970
3310
0415
78071
07989
37943
37000
2599
78061
3432
53782
2448
585
8831
25080
30430
V5849
4786
0388
58881
1124
3682
70725
57510
25003
86131
20020
V552
7048
30471
5521
75310
78001
70712
33382
94536
43300
5581
71591
V653
85206
V554
30403
3249
37555
76501
37854
3960
3536
20410
03849
3693
1625
7915
78821
23879
