59382
8872
3313
04101
E8495
9172
7993
61610
58189
29410
5130
2520
99649
43819
2869
78001
22801
7483
5996
2518
7533
41002
E8500
E9470
V5332
E956
5939
E9429
5997
5829
5758
41051
30401
78551
V4972
37632
86405
V626
7098
37775
135
5523
82123
29560
2761
3659
71941
4139
25073
7461
44022
V0189
37900
30301
72401
80704
5304
29520
V4281
72290
86803
34290
37851
44030
4264
2773
73018
5991
99663
1541
25041
8260
5933
5193
34591
E9308
0088
40492
2373
85300
V5489
4375
E9356
58181
7218
37005
V1209
5289
57421
33520
30392
1531
20198
9680
E9331
53649
4417
V4975
41082
E9422
01896
75329
7885
80616
99661
V1047
71238
72888
72403
9951
45352
E9479
9693
2713
01894
74510
9711
E9293
8901
E8704
449
E9364
E8881
1572
6040
53020
8056
7104
7706
5272
7295
V202
E8583
5768
6954
7955
V1041
81601
1509
2883
99682
99644
41181
0412
25001
25013
3332
2774
1965
3694
6822
501
2441
44032
E8780
43813
92400
3071
37739
5754
1969
7771
1759
49392
4352
5772
30122
1748
04182
70711
80114
80112
4329
587
74602
V090
1552
9961
2920
53290
30420
V5417
5831
E8502
27900
75310
5809
05319
1971
V632
73734
30924
9552
5969
E8792
25050
99667
57461
7945
7845
36281
4472
43820
53500
99563
56409
0490
311
47829
585
29640
70722
5602
E9348
72939
47811
1518
6826
70701
34839
42830
514
4578
7354
44329
20301
86122
V1202
4231
5793
56729
E8781
V3401
99664
E9393
25063
4474
4739
60499
74762
2689
7103
5988
V446
1983
V550
40591
42760
2788
2913
70719
34430
V1253
E9290
7716
V652
4588
V556
37272
V1582
72751
30460
36400
53510
74689
28522
9984
4241
03811
4920
591
E9411
57420
2111
V5865
5305
72273
E9554
43490
7242
9038
2762
9059
25010
80325
05419
8029
70723
2865
59789
81209
72292
7812
42983
V444
62211
78009
2949
0796
4582
75312
80662
5528
1175
4479
7746
1464
500
81341
5950
73015
2127
47824
8072
7876
27730
99779
78093
5711
4489
25082
E989
34982
0380
E8532
72930
80631
72889
63491
80012
71907
2440
30483
70712
36846
8605
56782
47819
80321
78820
42091
37923
78550
71901
V0261
80601
3341
32082
7200
78321
51901
27503
2459
05313
7948
71101
73017
E9288
1968
8245
27411
83100
82130
71906
5374
V1529
20501
80122
7135
75989
4321
25020
0949
4378
20211
5789
7776
5966
40310
4389
20080
3203
42490
5961
64821
1715
40599
40501
9729
90089
5778
3968
99686
73309
V4502
29634
73382
2599
29650
9351
04102
29699
V549
E969
83401
4476
4251
7262
4536
44381
44101
80125
71103
2189
78559
68609
6202
99671
76513
E8784
1521
5187
53201
27549
5538
5964
1892
11284
8700
30583
7292
5119
3238
E8580
8054
1629
9950
72211
E8791
9212
5183
78441
5300
7863
8822
71109
43401
7038
8921
8796
4416
29620
4232
2769
30390
2808
5764
7102
72886
53021
11289
29580
V5416
0530
99654
40390
42612
E8889
5695
4240
51919
7842
71531
56984
9670
7874
25051
87343
5650
3643
4267
76516
4370
V553
1177
E9278
V0981
5952
7907
E9303
3320
29689
41032
3432
42731
29281
99659
7840
71535
78057
2899
E9359
7820
99665
1970
6820
7020
3897
9708
3619
V0950
4371
V1011
23875
1121
37990
7689
37200
27651
4160
94800
76529
7942
E888
6111
2397
41411
0382
80021
9093
34580
0414
27801
78903
V1309
30431
86352
28982
E8768
22804
5109
30928
43301
1534
7504
25062
99676
40300
V1083
V1009
4838
3570
5583
37489
4846
05889
5579
3942
E882
5750
4242
3499
V4586
9587
V454
9064
20270
99701
27650
36234
4279
V453
5128
37992
096
56989
5370
79311
7511
5713
30400
07070
78604
E9500
261
2448
V151
E8849
E9504
4260
V560
V644
95200
4421
23879
6000
99832
5821
5722
E8700
2376
2749
7766
V5866
31400
85186
7210
73315
41061
5559
79029
7994
81100
4539
9509
4353
9998
5738
2704
E9305
78061
4386
1961
2752
9051
2810
42789
9964
37991
E9319
82101
3319
76525
9973
78449
E9174
9341
6271
07989
V420
V1541
34989
7862
5191
80502
80162
2682
E8799
V1021
77089
80015
2638
80022
25081
3952
9920
7990
70219
2967
56721
4552
4733
58281
56982
042
73022
56212
01215
48239
78451
80121
0521
5846
2858
49321
6825
78900
30120
37941
80625
40493
2930
V1252
39890
1504
71943
1540
33720
83402
9800
42781
3442
V4361
7931
7906
45389
99657
V4501
85301
2594
2521
47875
V142
48240
7463
4533
E8843
V667
V3100
2254
E9194
7265
9972
40291
07071
2513
340
3591
9679
2538
33819
V1581
5715
481
7775
42840
V0382
4411
2740
V6442
20028
4372
35800
70706
96501
3576
99859
96909
E9352
51851
V850
88102
56941
E8348
99831
2113
1960
V1042
3553
72761
2860
29630
34400
1490
86504
60000
36000
34501
0074
5990
72989
4780
2875
5921
E8147
7291
92232
5521
34590
57512
99681
73399
8026
41410
73342
4422
E912
1124
4258
V293
7140
2733
V4512
4440
V1204
E9222
7818
7850
E8801
5561
51883
30430
44321
59654
2630
1536
33382
E8136
78606
78607
78039
5531
99811
34540
E9317
V4511
82022
35781
2230
V0254
55321
2768
04111
542
77989
2536
5881
29212
V552
3963
2864
9623
1560
34460
9190
7464
6824
1913
V3000
2765
99603
34292
5728
2940
2511
87363
44284
30550
30523
36019
V641
1830
78060
1890
25053
71699
6802
3510
V1259
7802
5799
07951
2639
1912
V5481
1103
7707
27739
4571
2739
42832
59080
23771
71695
44489
30590
E8160
72210
2866
V461
03844
4200
38910
81500
0049
7892
7455
99939
5693
1580
E9413
57441
56981
34889
99642
1551
04110
V4976
56201
38589
E9503
29530
4358
55090
4239
4847
3229
6190
7703
07020
V161
E9342
20152
1707
7220
78841
04185
44581
V5413
4110
3682
99668
V8525
5552
V163
28803
3669
3249
79415
33829
78602
3181
28983
99931
9993
4558
78609
47879
72972
45382
30521
81010
77082
4538
1119
5804
V4283
5790
8739
78065
1972
9754
20410
3371
1618
E9379
3829
74710
V4577
2830
1538
81321
64781
V854
99672
25021
V555
45385
V4585
43812
V1091
5180
73316
V1241
25052
47833
99684
73679
8404
79589
25201
0340
E9421
53200
V5331
30551
99739
25208
E911
5259
24290
71903
63310
73732
42831
9982
566
7197
7530
76515
30503
99601
5733
40201
1891
64131
4263
42090
33385
81611
85206
07044
3962
2252
55221
78650
E9600
4589
4928
72973
73600
E9447
6019
77181
70725
3331
78821
1530
85181
5302
78834
1307
40290
1962
42989
38630
2767
30441
72992
34570
V551
E8708
76526
41091
7856
45183
79400
74783
1915
42820
34461
V5843
81333
5734
4786
42833
56489
48283
V1051
2948
28652
72252
E9682
73025
E9347
1987
71102
9726
5258
1984
41020
E9358
E9689
71105
E9804
72272
5178
9100
E8705
25090
3003
69589
44024
E9378
1104
V1002
V1046
2143
E9382
4561
8602
0793
6143
20280
7817
36250
99679
57410
5609
5363
V452
9072
5081
60782
5798
53560
7245
2779
4413
3489
99594
7708
53501
28959
9160
4168
71945
29680
47874
7881
42769
2519
87342
7831
71106
0093
7294
4738
4730
53440
7384
5753
5570
29540
2880
9054
7580
34481
76514
56889
V0482
1532
28521
0091
5853
36210
V1749
75733
E9478
80223
5852
5581
8930
5989
7824
78603
220
29562
260
V024
78799
7070
586
25071
7750
53291
80172
30553
E9425
9986
9879
53641
E9426
70705
V502
V0980
71230
5960
41071
1990
4619
4295
6828
7092
V1242
0498
99932
25072
2114
23872
9694
80700
4404
47831
E966
V169
0417
07030
44031
V4963
4822
34500
5692
V1507
56089
319
41041
29389
2730
03810
4441
E8790
0400
81344
1918
2763
5719
99812
37854
4870
9962
46410
53085
2532
36816
1300
20281
3441
V1053
2812
2764
51902
3379
82300
60783
2971
78194
44422
2760
80508
2112
V4572
E8783
8870
V2651
41512
80841
7599
9047
78791
49391
3599
1173
4710
E9248
22809
7895
96509
72190
03843
3363
9598
V290
2154
V148
V8741
1977
85201
72291
76491
36221
53782
73004
05379
3574
6110
1963
34690
4270
82121
7827
41511
73007
78899
E9384
E9192
00845
41021
04149
E8782
53530
41404
2822
79431
53019
36201
4359
37273
78552
78905
5562
2734
7935
V4364
34280
48282
7051
V5339
19882
4809
V8812
V5867
1874
80020
34830
72671
0272
1986
7209
5716
2900
59589
53081
2893
78199
28984
3575
34831
4618
V180
9081
76517
49120
V8543
5902
42732
70703
03849
73313
0479
4275
28804
57511
57411
4720
24291
5131
V1272
76519
7806
7823
25031
7991
0416
57470
80843
E9509
4958
990
E8150
4142
5226
5968
3970
3804
30411
53550
8052
5368
E8499
4841
28529
94536
5566
V4587
99889
41001
E8498
04119
6981
76527
9584
2859
3940
57450
1120
5935
73739
V6284
7517
9349
V160
3542
42842
5533
20021
76522
41092
5920
53089
79902
79989
85306
1820
71590
73016
2848
2841
0785
44021
7313
7109
85102
79092
4592
2753
V08
49390
99604
37555
E887
9033
0419
3668
0383
60886
6851
53520
53642
71430
V5419
78863
43889
9142
28749
27901
9529
9010
3693
78842
E8785
99685
1985
452
7131
30470
95901
57451
2721
30423
35789
1463
73026
5401
6146
V1029
34571
2874
94214
78729
72402
2989
30522
6827
7821
25040
03819
73390
1725
45829
V4574
79001
51189
9983
496
6823
V4987
1700
V741
5723
52510
78906
V168
44481
03812
45383
6238
7015
1512
1179
1888
07032
36362
25200
7149
71954
V653
49122
5163
6944
69010
74869
2829
73810
2890
79093
8220
0051
71946
V451
V1007
53220
00581
99669
66634
V600
7757
77081
5730
45341
34401
72813
44629
20150
3009
99702
4255
36960
99593
605
4820
E9241
55329
5569
80503
27951
6988
77084
E9398
V0262
56211
5710
7224
V122
V029
44023
32723
3572
5811
79439
7854
6010
0463
80708
75679
43391
2720
V5412
700
5439
3960
45182
4253
71595
59389
72887
37430
1522
78071
V625
V4573
E8844
0542
7512
76407
28989
70702
1991
3488
55011
20800
85011
E8120
4556
99656
03840
79579
45981
9583
V1082
5120
40403
5761
4401
E8528
53511
99989
E9310
4560
07031
7080
78097
3708
4387
4262
05410
4510
78907
3082
99674
53100
V5862
V173
7089
52801
57510
2809
25060
7742
71949
V1588
71536
27401
28731
V433
7830
52100
V1001
73028
7213
V851
7833
E9390
44281
81000
99709
78830
7847
80501
72610
E8529
24200
V8541
36563
6201
E9323
71107
7248
5849
33394
99769
34291
01880
81342
30560
80709
4011
5994
1561
3559
74761
71690
36202
44102
43300
8670
42613
29041
2395
E9394
5690
07999
44620
317
61172
80705
85202
E9300
2443
5298
55012
E9309
25042
2750
4460
4610
82009
3481
8782
V4962
1550
99673
4470
4464
2818
4254
8021
E8859
49300
E8888
7810
3090
32726
81200
73719
9248
42979
80604
76528
56039
2270
5839
E8261
V4459
2724
5121
3241
E9410
86804
28981
38600
45387
5855
V1255
V6441
0549
20000
56942
99631
V1584
99731
9273
45620
04189
V4582
5379
E915
2726
74742
96502
7915
45189
9916
76518
70713
7299
86103
40301
75982
7100
03285
4148
78839
1603
5192
V1271
1520
1514
2894
3384
4408
5185
5224
5762
55220
1272
3076
34620
4414
0579
2819
42822
725
77183
V1079
3373
80507
70400
86350
2793
5963
V103
2116
7230
515
5672
30183
59970
7702
71598
1125
1953
1519
7705
8248
9348
03842
2873
75563
25043
86389
V1000
37633
E8543
V0991
5759
1628
56731
82531
4400
78099
36900
7636
5601
99762
57430
3310
0388
1622
39891
78722
25080
V1201
1610
5781
7513
53450
20300
9050
53082
72673
30490
81408
9070
7801
4940
5771
42841
3239
42761
60784
85182
1363
E9420
7041
V011
4439
49121
7784
2771
5070
79099
9340
E8233
V1642
V1089
1400
73710
47412
4478
42823
71591
4010
82382
V0259
E8809
5770
E8538
41189
87341
20260
V4561
6962
70721
86121
4559
3561
4465
53784
1978
53011
5409
29590
42682
56789
3569
76523
V4576
4553
3453
23877
5739
04104
7921
86404
43310
73029
3594
51631
3004
51909
5691
V071
74860
E9363
57400
936
57491
28800
1976
42610
41400
42689
7570
92411
73027
7981
27949
56738
490
51882
7589
V153
262
4210
4532
45621
72740
6951
70720
E9361
2731
42971
40491
4549
2811
46619
43320
V140
1973
30491
45342
2144
47830
45386
2387
8744
2409
36001
27652
25093
30022
1570
6821
44103
72141
0270
68100
41412
40311
80100
4178
82332
E9299
58381
82120
4871
7099
6983
99529
5932
74721
9221
3079
2512
57142
51881
8831
V4365
1981
7837
73730
4219
73009
73300
35801
53140
4919
V1004
20500
3501
07041
37230
28850
74190
8028
71691
28319
4466
V4611
04100
3314
85220
78720
76502
4299
E8497
41042
1974
V3001
E9306
9971
25070
4420
33811
56081
5060
58089
E9343
V1087
0701
56200
3330
25092
2825
7596
25003
81203
59010
E9412
25000
76512
4881
7470
0971
9331
7904
33183
7732
99883
1940
41081
41031
99813
3540
4808
20920
7961
V1085
V4571
470
5600
1624
5822
V554
53240
V1005
2781
72981
30502
E8786
7783
23871
77212
4257
V1302
43410
1510
V1003
2800
7936
3485
71236
49320
53170
04109
33818
75251
7793
V422
42652
4590
1369
99591
78959
56949
E9304
V4589
2554
7296
22802
78829
77981
27541
8020
51884
2662
29040
43811
7755
V4986
60889
72293
53781
8024
2251
430
920
36840
5181
82021
55091
59971
56962
53561
V5869
43821
30561
75617
5854
80120
70715
8080
7542
V053
3899
1625
53190
V441
1251
5647
7756
5724
37943
20020
5720
85221
82525
71844
9553
59659
4731
56213
44029
81502
7905
60001
4169
9092
3558
30749
9181
2535
25030
68110
74781
25002
7704
7963
72619
0478
80701
55229
8604
05479
V5883
6869
5303
5111
V174
4568
48289
2384
2888
0543
5551
78931
30520
9032
71905
9642
9701
41012
2690
20400
2766
9995
7919
72271
2125
30563
E8171
V1052
80504
3484
85226
95914
43882
25012
6181
V4579
51889
56986
43853
42821
71596
80600
2699
3099
9524
44322
6953
34404
2442
E9424
2449
40391
29181
48249
9053
86131
2839
5845
9678
35981
30300
9222
2879
E9307
31401
E8761
431
30461
70709
9999
29572
7804
7454
E8798
V4575
9654
41519
8088
V141
78760
V5849
30000
V427
34600
5934
3439
75162
30540
8820
42611
8600
43311
V1301
V1043
5307
7318
V8537
1543
E8796
4829
80101
570
0413
5571
7813
56723
3490
30541
5550
8208
73008
73314
V1551
0389
5642
5100
53789
43883
6084
1109
4801
25033
99881
30421
37852
1123
2558
226
V5423
5118
30001
7731
30981
6989
76503
99639
2863
486
78052
2572
78901
73722
7048
9809
9828
7778
85200
60091
4294
3361
78031
58889
97081
53783
34680
49322
46611
2555
V1088
76524
V1081
4785
4599
2329
2728
5712
95205
70901
0415
53390
7873
8750
30751
E9654
87320
E9351
9992
30500
4580
44421
80031
25011
58881
2410
82321
07022
44020
4423
E9313
V721
4280
25083
7234
58389
53260
E9289
4380
29570
56969
20510
2867
1737
V1351
25541
243
56202
7202
412
78059
4019
E8600
5362
6961
2271
V1279
6960
04186
45372
193
46431
35782
1921
3449
4555
20502
1573
5780
92320
7243
4821
138
7282
56985
185
5184
9975
8244
78652
34489
6929
V463
43330
2732
E8788
73741
42843
5589
63502
99662
42741
82535
2375
4373
37000
5888
73005
82020
436
71847
78909
V1254
4430
41402
28489
80702
7083
77211
56210
86330
4570
V4282
E8501
0880
04184
7861
5718
20530
56881
2126
78605
1503
5225
43331
3552
99590
99666
2738
5951
485
V1006
V152
85256
4660
04183
4269
25202
45821
1508
78659
59381
V4581
V5861
1982
V4578
86101
V643
0499
47832
27669
1919
769
2851
33399
035
3941
5967
4238
70724
36284
65641
3093
3051
81510
99592
E8230
5168
41401
V1072
30501
2541
V443
2777
30403
7062
1578
53570
30471
V435
5678
E9809
7661
2910
53540
85241
2710
23770
8500
462
V171
4111
E8902
9588
32341
27787
71680
5859
7717
7891
76501
25061
29532
24280
V462
56722
V442
7843
0090
73319
30391
E9320
1640
7868
78079
2776
0931
8730
78066
70710
99652
8860
6191
V5391
1980
45184
V1251
37501
78051
04082
59582
30303
4230
7310
5856
43411
27542
8832
56400
75619
7910
V440
28249
4550
3368
3581
6930
27800
7872
V8801
08881
4412
4471
48242
2898
5641
80135
541
56983
7964
E8842
1409
3536
9980
5779
41072
1505
34510
5819
37652
72884
78701
V642
4289
20411
53541
01803
56781
4271
3577
7235
46451
4233
V4983
1720
8082
37034
74687
7811
37741
27803
4659
99602
6910
45340
7761
87364
72400
07051
44389
2411
V707
E9444
55320
3240
7866
5110
41011
7336
3480
20218
36105
V7651
9974
390
07054
3370
70707
7101
42099
78703
96500
07811
70704
55092
9690
7211
20190
45989
73670
2722
34550
53551
4162
6039
1619
53400
4266
78459
72705
53340
57460
82302
5680
25022
72142
3383
20283
8242
5679
E8490
7852
78904
43491
V3101
V4973
8738
2273
4259
8603
86601
70714
56961
1729
95911
3315
57490
0539
04112
7231
7424
57471
71509
20288
V113
7078
19889
7244
9663
E9383
0312
30393
2794
78702
48241
78843
28860
86229
53010
2121
1623
71902
4941
8064
E9392
1620
2939
7930
2382
78003
85222
38861
2352
1533
1122
2897
