2511
3432
72884
V4963
9983
3090
1610
1984
7948
5852
8744
76525
4401
86803
37739
4731
2538
4422
E8504
2869
0416
3501
5952
52100
243
2189
4560
25071
V644
1986
4660
7689
5110
6929
3383
V1642
V1259
V6442
V4589
2841
2781
78903
56211
87349
2779
78057
77213
7771
33183
2912
74762
99639
4592
7755
56962
8242
85011
30550
42833
2572
78071
2409
2720
41061
43813
42761
44103
38589
78652
5672
27803
83100
V556
80700
8056
99762
7706
4370
V1046
43311
1912
76503
E8150
V1302
4353
99665
53240
7868
71106
V168
V433
80708
3373
2387
53501
0542
V122
7296
07044
769
72889
E8543
25053
2894
43330
7542
78551
5724
25080
V1301
53010
76504
1622
73026
80172
80120
28984
53400
90089
41071
43820
3076
V4976
3314
56983
138
V4282
5304
82123
53100
5779
587
7462
25051
9010
E8842
V071
1707
3313
45386
9598
4578
5695
0785
78959
E8528
78604
88122
1625
44421
7292
7104
53170
48242
4786
1960
25031
135
61172
3379
75312
29540
75563
V1002
261
V1044
V5416
57400
59654
45989
72705
77089
76515
E956
E8705
8901
5711
81510
07951
25011
1550
7210
34500
59080
36001
28529
4270
75501
V5865
V0991
76719
99662
36221
4568
78441
5691
85206
5307
82322
81322
78061
41012
40591
24291
3449
5187
76501
E916
99594
74710
20190
9971
2818
2710
99709
2411
8872
56982
5770
83402
28652
29680
45372
5379
30751
4386
73313
096
80508
75251
36563
7599
5804
71509
1520
40390
4010
7881
2939
V0482
6110
51919
2252
5991
53081
V1201
V5339
59382
E9323
E8121
1503
78607
9663
1820
20000
73008
4533
2967
53089
4439
35981
V5391
6962
44022
E989
80135
7720
5856
29580
7945
71430
2728
80114
E9425
20500
7793
4378
1541
07032
8605
1519
7280
7702
7852
23877
3315
V5843
4358
7876
99666
E9343
77084
1121
V160
7051
92232
45821
30120
3553
2765
1125
2518
37851
7235
7452
99664
56731
2920
6821
07051
1874
99659
2940
20530
E9364
4821
56949
44030
6981
4413
E9358
5789
2825
V652
72290
30500
E9682
42831
1913
4476
34461
8088
86330
5642
74510
42832
E912
40311
7630
1976
4466
V3001
2760
9524
2126
99931
E9392
5768
E8161
27951
5280
4958
80121
V3100
E9804
7802
30430
80709
V444
07020
3594
71943
52801
4730
41001
78799
99832
42611
7931
0380
7818
29410
11289
7717
56200
5997
70714
30928
30392
79311
7098
8831
1965
3570
7248
07811
1737
2794
73670
1251
72402
2721
7840
6039
74761
30981
6960
01803
7608
V293
V5867
5710
5259
7813
69589
86612
4571
1490
34550
4829
95200
78900
4539
1580
24200
8748
2898
43812
56981
9190
34831
0074
5781
E9503
8082
99652
33811
28981
22809
22804
04185
4550
4470
4441
2874
5963
V4582
73009
4280
4739
8505
V5417
70706
22801
42820
2851
9050
5439
5224
56201
41512
E9398
44620
V8543
5831
36201
4371
2749
04104
3099
2860
41401
77183
42843
7788
78659
9950
8074
1991
4375
20283
4555
0521
82392
28731
94800
81344
72291
57142
07041
5969
V0259
3572
7756
1530
56729
73722
71905
07054
79439
2768
04112
2819
5680
96500
76621
V290
V4975
2930
1540
2273
317
7775
53782
78650
2459
72401
80849
99881
5994
7626
55329
4294
80604
53541
2230
E9305
2443
29572
1640
53781
1700
32341
57471
4380
1990
78199
7942
2867
1891
34591
07031
22802
E8151
42760
3576
5723
7038
58089
73018
27651
34290
4168
2599
78052
7135
28522
6954
3552
30523
9331
49391
37652
9130
28860
7295
6988
2535
3241
7294
71965
2726
2808
56202
0312
00581
78791
5589
V596
78003
2774
7197
5846
1888
4290
36362
30590
E8843
76072
83901
4230
2639
71102
9092
78829
3384
V202
99668
2859
74742
03285
1729
V4581
E9393
5109
56723
4489
78321
78820
9973
80702
V163
56986
72989
58281
25063
45352
78603
7313
5571
7746
2948
V550
9053
9670
7766
4219
6000
E8348
V1000
4262
4464
82120
76383
37230
7100
76519
4941
99676
7907
78899
3829
E8785
5778
9630
72142
470
44020
2630
V3101
E8761
4373
V435
9701
4232
7533
74365
E8792
20198
04184
56489
3962
4420
51884
2761
V4512
25201
78031
7224
4263
5964
5163
4538
3619
42731
0091
59381
V1351
5819
40301
81220
82022
E9800
2738
55011
03811
7149
80600
34620
27739
E9300
V1088
72272
4822
27650
37633
85205
1363
5070
72740
85306
8602
8021
74190
86415
3071
53649
9038
64823
25003
24290
42842
2536
61610
86601
30551
7817
V0254
V549
41400
04182
86404
34280
64821
7041
2879
5855
8620
E8704
43889
55090
V707
V1005
4846
1725
1272
63502
40492
40403
87364
27542
7856
1619
035
70724
3952
9984
E9310
7798
27549
5181
41189
5854
V440
4710
5960
1570
57470
5761
42613
44422
79001
5550
7083
48239
99592
4474
25033
2373
6828
03810
2521
V1006
73679
V024
E9429
2410
5771
8603
5601
8930
3694
7820
2662
30491
88002
82300
4881
5753
920
1982
71844
E9382
82320
5100
7661
70901
V5331
9754
30400
2114
60001
53082
1981
85301
80601
34590
70709
95205
64781
99989
V142
45829
23770
E8162
28989
96509
E9359
87363
87342
3361
E8902
27730
7089
4253
V1202
43410
73710
V632
2532
V4364
7811
55220
2762
5289
2913
2376
81010
V4502
2271
0412
3569
80505
80126
53642
53084
20400
99663
2865
70704
V6284
34690
8730
5569
75559
7354
V1581
25072
25073
3341
390
7726
41412
V442
6930
2143
04149
42781
4404
1578
83401
7539
3668
6953
3481
9160
5809
0049
9221
2766
42830
4582
1962
41031
55320
1572
1969
5303
4210
E8786
42840
V0980
33382
59659
72292
30561
3310
E8849
74869
80020
1173
81333
47875
1983
V103
33829
79589
71941
3014
E9390
3942
7862
7424
7730
57411
30411
30502
2352
44032
E9194
7955
58881
E8233
45340
V1042
4352
3489
69010
80100
V4572
9059
3079
85185
72886
4808
44024
78550
7873
3804
7140
78703
9100
42732
59389
57450
9181
2375
4841
99602
86502
7078
29630
70715
V174
37430
37741
76529
48282
8083
29181
7872
7724
7454
42682
0093
4479
4738
36105
7797
4110
5718
1510
78001
53201
E9478
2888
66634
4233
30122
486
71906
53784
37923
1968
01215
E9379
9828
5935
7707
20301
95901
E9363
79400
V653
45182
9726
5713
9273
30461
44321
4471
4510
29530
78842
V8525
43320
V714
1104
V555
05889
E9304
4553
9348
42610
44322
80321
4359
36202
44031
79902
40291
4928
78552
37489
V4585
V140
V462
73315
7131
88101
7103
0417
2731
44389
E8600
99684
01894
56212
31400
4478
9680
5225
9982
7209
4160
44324
V1091
5733
5119
36900
1123
59970
5728
99813
53540
V169
E9600
9972
63491
5111
85221
7824
V171
7109
7596
71238
3688
78760
4599
V5869
3368
2440
8601
8910
1124
7935
24280
82020
7612
5081
42490
0543
6825
86389
1514
V029
20300
41511
30570
5734
V4573
6010
9964
514
5368
1830
7990
44581
1987
E8494
30541
71954
70712
7891
4329
4532
V5419
29212
47824
58889
2788
462
71901
40310
V153
5762
86813
E9412
4148
4408
35782
185
2875
28319
0414
5583
E8191
79579
73300
30924
73004
60782
78722
99779
34510
E8130
51851
E8580
3051
42291
2899
7101
V1021
9642
V1582
51189
9054
8676
25070
541
41011
3581
V1079
75982
99529
73730
34292
63310
33819
46451
34501
82521
86103
38630
226
1573
2822
7961
4472
41082
485
4231
V2651
E8529
1974
4780
56039
V667
20920
53020
2251
0400
74429
28249
5690
1980
85201
4266
700
7885
87341
9724
41081
5531
5602
1552
5829
7234
V4575
49321
29570
4387
80705
40290
9047
5996
80706
V1087
7243
1961
1103
82535
1629
78097
500
41072
99604
73382
2722
80502
5180
37034
542
V0262
V453
0463
46611
7464
5712
4556
8600
80704
7708
60783
7915
E9689
4258
36400
7242
95911
81203
99654
V113
5118
30553
55092
V1271
5362
V0950
4139
20152
7843
49322
7981
1623
53440
71949
4414
74569
4871
5719
3708
515
5793
56409
49320
5128
5226
36816
496
41402
E9470
3441
0539
4465
62211
72403
56722
V011
0479
V0261
86121
2699
5191
99685
3669
4295
85182
82121
4254
1560
9351
2397
V4973
25020
E8192
47879
E9411
431
80125
9212
4269
85181
V0382
34839
V8812
34481
E9317
5184
42979
3442
6111
68609
5168
7801
99679
8080
45387
75263
43882
7765
20501
V851
82302
99702
5579
41404
30583
E8495
04183
76527
9998
3599
6201
E8706
E966
9678
V581
2689
29689
43822
4838
481
2753
36250
43310
25010
60499
76528
04189
5790
81500
1919
30521
71107
8711
20211
73314
2750
99811
43821
29699
53641
73017
8250
99644
04186
76407
48283
40493
78059
37200
5131
E8791
2883
4549
2767
30403
2555
78449
V626
03819
30391
2111
452
1618
4588
76516
30560
45183
V420
7921
71591
3483
2829
V270
V1053
47830
9651
1620
44489
7806
07071
V8741
V5412
33394
V1541
27541
76522
5939
73319
99671
86501
86602
3897
75310
04119
25013
48289
99673
80015
2764
80223
V151
74602
2329
30423
49392
47829
32723
70702
4200
71690
78841
7530
7455
3575
73739
78079
7823
586
8208
77181
0383
71230
4423
5739
4416
53783
V502
7673
V4501
1531
75261
4271
74689
9992
86122
V454
74900
1543
86504
V1255
36234
76406
40491
V4962
23875
99631
7092
05313
E8708
73734
V1047
56400
8054
72973
27669
E8784
86500
57491
7919
V6441
V3000
3659
605
53021
25082
49390
V1309
V08
6040
1409
7716
82009
9064
75329
E9313
5772
5750
7993
8870
1551
4321
30421
2890
44029
2734
42091
E9356
99669
9975
53291
7245
03842
78907
66612
82021
5370
99657
6961
05479
2112
0270
78729
2125
77083
E9447
1978
412
60091
6802
2777
2541
V053
1512
71103
42983
0549
340
4610
45981
7244
E8859
2900
73027
4785
53200
70701
82130
7831
85300
4781
566
77214
81221
3591
92411
56989
E9308
00845
43391
E8498
V452
37632
30022
7463
57420
3510
7423
7810
80506
86350
33818
70722
7461
9698
51882
99791
E9504
V1529
60784
7905
87320
5990
75617
85222
V4576
4260
V552
6910
42612
E8147
71531
34889
53561
3240
E8538
3320
7962
81408
5754
E9509
7764
30483
1536
27411
25052
8245
1940
78839
72972
V5862
58189
7904
43411
47833
3963
5988
3249
4372
3332
1562
80501
1973
56789
77981
1179
37852
74783
55321
E9378
0949
41091
25030
7821
70723
99649
7833
68110
E8532
7213
7560
23872
V1204
E9352
6202
51631
2793
2773
78605
4251
5183
41032
79415
E8796
73005
45184
30749
V461
490
9072
E8261
8260
27801
0388
7776
29389
40501
38861
7513
87343
1624
2144
5533
45620
56942
5902
30011
36281
30470
71105
E8780
27800
5759
77989
5551
20800
5738
1975
72400
27787
V551
V600
3940
7580
8782
72141
3542
1603
72610
V4586
20021
260
V1001
V1081
5989
73029
30563
7930
85180
80625
36960
V427
2638
43883
74860
44481
44329
19882
1759
71945
60889
1307
34600
4920
4279
25062
501
99591
5780
319
585
11284
99883
25541
1534
59589
20218
03849
E9278
9033
2154
6822
E8171
V4281
4940
E8888
4162
23871
2866
03812
E8788
37900
V8801
3485
30540
7790
7750
8240
V422
1122
37005
7469
04082
V161
49120
2519
78931
99674
9993
V1252
6019
53560
4536
7262
3439
85302
72619
V721
7678
0340
1963
71695
20210
52510
78821
20411
53220
E887
E8493
88102
9999
33399
9051
7861
30300
99667
6826
59010
44101
3331
45385
0382
37941
V4972
V643
1892
6181
2441
2520
77212
V4561
2448
E9554
34404
1918
262
28749
E9306
75732
1508
30390
E9426
73390
0051
7211
77982
8911
23771
4169
53019
27901
75162
5298
34580
V1051
V5849
72252
5968
7384
42971
V1251
4590
V554
82101
V4987
7310
44281
34291
7048
78459
1715
37990
35789
41092
7863
V1588
34401
7731
5581
78906
7812
01896
E8809
81100
39890
9708
30501
7670
6851
E9348
45342
5409
E9293
E8801
30503
7892
20281
V0189
30420
E9309
4558
E9307
41181
V463
34830
40599
V1072
3201
53500
V1507
449
5647
47811
2769
3238
70710
64421
05319
53450
2554
42099
5120
85202
V4361
71595
1509
3371
99593
4240
1972
6823
71907
42653
9110
4580
71598
7070
71903
3009
2971
E9331
V7651
28804
7570
3970
81341
4178
4659
4870
8052
76491
70400
25043
5305
41042
03844
45189
V560
0971
3082
77082
5730
V5883
20028
71946
4801
E8160
193
72813
99731
42741
9623
2713
5300
25002
V1254
45383
58181
E8499
29590
9690
53530
9711
0701
37272
27503
7866
76405
7512
55221
80504
1720
41041
E8799
0498
80703
5932
7515
570
E8783
2732
29520
74687
92320
5562
8820
7718
43811
E8781
4460
30000
2864
V1085
53510
36000
99642
78039
5811
E8768
V4983
1464
8028
72210
V1029
7099
7778
25093
78451
96909
5523
E9303
71902
7062
2730
80112
E9654
38611
5641
5570
2763
34460
25202
0088
1119
0478
9809
9349
V1041
7705
5363
53190
80662
9694
30591
78609
78060
V4579
5192
29532
73015
40391
07070
2989
85226
41021
47832
6820
73316
9142
72751
6869
2739
71596
34982
2384
2812
78909
7767
47412
5178
20020
6944
80220
72930
3003
V3201
57430
7080
45621
430
80102
44284
5934
3682
37555
9679
7704
51902
04102
78051
1915
70721
70711
6951
56781
82382
2880
86503
725
7318
3229
36210
E8502
5650
8604
5060
3004
78834
9341
70707
E8881
3577
81601
4239
44629
43819
6827
38910
25022
78830
4847
5715
7230
57149
9916
76408
71590
80503
86131
20150
7842
V1749
7636
6146
E9319
E9290
5678
E882
4259
60000
86352
78702
99601
V4283
2800
45382
V0981
36284
30183
36840
7991
86405
7671
2830
9800
20410
79092
78905
E8490
E9420
7617
42769
7700
8064
E9422
V5861
73342
5859
29041
42821
6262
V642
8029
46410
43301
311
1966
5966
80843
56889
8750
1921
38600
30471
2771
86101
E8583
V451
65641
71535
48240
70219
34489
79093
99932
3203
76075
29281
7850
85305
76512
4400
56081
56213
2513
30520
8500
56969
81502
E8136
9222
42789
5693
07030
85200
25042
25060
1177
41410
8220
591
2270
37501
78720
56210
7845
72939
64131
V298
73028
5302
20270
3181
1505
42689
30393
8822
99859
80101
V1551
57511
4011
78093
7485
75679
78701
34571
2382
0413
42989
28521
4421
53551
57490
94536
V152
72761
7020
78843
2594
60886
79989
5950
74721
3899
4267
42652
25208
V5866
47819
9584
E9347
76502
5528
53520
E8846
3558
86401
72211
43491
E9289
72887
3693
6191
5193
V1089
94214
4411
60883
E9342
77081
29040
86400
49122
70719
81611
20260
9509
20510
28803
2848
V090
25090
7421
2776
5521
37992
E9248
7336
05379
V1279
3499
5951
5561
25200
41051
7837
51901
8739
E9222
V5489
7854
73309
5853
59789
25061
5185
20502
80841
7757
9951
28850
55229
7622
08881
04111
04110
5888
E8501
33182
03843
7703
2254
9961
30303
8020
56721
56782
V4511
72888
4255
9995
20280
70703
1369
78863
V1242
4559
5716
28959
07022
1628
8832
E9444
99590
9962
81000
1504
43853
7220
E9299
E9809
45341
41002
E8500
41519
E9383
8796
25050
56961
72273
0090
99681
76517
5566
56941
30431
75989
85225
6989
56985
5400
40300
45389
2449
51909
78066
44021
7964
7936
37775
25041
78194
35781
7827
7299
85102
7483
48230
97081
5921
V741
V1052
4389
78009
3561
99672
5272
V1004
V148
2682
7742
99603
95914
51881
2810
96501
53260
80701
2740
37991
V4571
56881
V1009
2127
V1011
85186
V1007
57441
76079
20288
80022
53085
5609
2121
4417
76524
7847
40201
34680
6190
72992
8248
7621
0272
V4577
E969
76498
2811
35801
53290
71691
V4574
5961
4589
4552
5121
9587
1300
7291
80162
E9192
73600
0931
0880
7660
4241
1521
76496
30001
1175
7589
73719
03840
4720
4299
2897
5552
E8122
82111
8708
7804
V1209
7910
436
82301
78065
V625
9654
5258
4238
V4459
9553
27900
0796
4111
29650
5538
2839
4570
53511
78602
76526
70713
36846
80012
58381
82531
E8497
6084
53570
7015
V8537
8244
1538
7282
9340
E8782
7761
04100
46431
V1241
4019
7906
E8230
V446
1463
5933
8738
5130
80507
44023
34570
53550
68100
2809
8830
9529
4275
81201
6824
25001
6271
3488
E8790
25081
29620
86509
V3401
3960
0530
1518
9879
7795
V5423
48241
07989
6983
V1043
4820
2116
99563
28983
34540
78901
4430
59582
72673
9986
2442
9081
7784
73022
34989
51883
56089
8404
2893
73025
7218
7470
72271
71680
30460
75733
4281
30490
48249
990
E888
71699
0389
7963
3239
29562
74781
57421
42841
44102
7783
7786
7830
9980
71109
E8844
4919
1970
V8541
7484
8024
78904
81321
57410
27401
73810
73016
51889
8760
2910
79099
E9351
4561
3536
25083
9093
9974
82332
8700
5679
4440
V180
0415
V1584
19889
V4365
E9174
72671
33385
4264
53140
E9424
5374
71236
01880
3968
7473
29634
7200
86229
4733
9729
2733
73732
2949
29633
V441
49300
43490
53789
72981
72190
85241
92400
3480
1522
2395
2704
56738
30522
27652
80021
6238
7503
E9288
1748
3363
7625
2724
V443
V5481
1533
1561
1985
5194
99939
2690
78559
99686
0499
43331
1971
3941
53012
76514
V854
E911
7517
V301
57512
7994
57461
30441
44100
29640
86804
8670
37000
05410
42822
3574
1120
99739
78606
53390
7874
E8810
32082
2858
47874
28982
2863
3490
76497
2512
72293
4619
81209
E9179
E915
3484
25012
99682
7102
55012
7511
34430
V141
5845
2752
8860
E9384
59971
87344
53340
1532
37943
57451
3319
9552
42823
V1253
81342
E9320
43401
99769
99831
9070
42090
V5332
5401
7231
V4578
33720
39891
4257
5722
32726
E8798
85220
V1003
37854
V1083
2113
76518
7202
41411
70720
4809
37273
46619
80031
66632
71536
30301
82525
80616
25040
70725
30401
70705
99656
28489
5920
9588
9210
75619
76409
3643
6143
75739
29560
77211
82321
1109
0793
99661
47831
5198
V173
31401
042
7732
4289
3370
V1272
E9500
5881
34400
25092
04109
73399
5758
5764
77210
4293
73741
936
28800
E9479
0579
73007
0419
25021
20080
56984
49121
1977
9920
99701
23879
7504
80631
4242
27949
3453
9172
80122
9248
0490
07999
76523
5822
7701
V641
5967
85256
1890
5600
E9394
V1082
25000
44381
220
8026
5799
9693
9583
E8190
79431
4412
E9410
E9241
2558
71101
3559
V4587
V5413
41020
V4986
7635
7265
8921
7615
99812
5839
3540
81200
8072
99889
4142
V553
5692
E8700
1953
E9361
57510
57460
3093
4618
36019
71847
E9413
2873
43300
1400
5849
79029
58389
53011
78099
9032
76513
55091
05419
5798
E9421
5559
7895
35800
33520
E8889
80325
V850
80605
V4611
5821
04101
96502
5720
3330
E8120
