3541
8872
344
5495
3323
9172
4029
3848
233
2169
472
437
4493
4024
4676
2551
4675
4523
7050
504
9547
5504
8826
8595
5059
113
9925
370
8673
8417
3882
3762
8180
537
4832
9649
7975
5222
3129
5751
5369
7864
3483
6829
379
869
4497
5523
7109
8104
8694
7859
9960
14
3421
683
2263
4592
3493
3734
123
3867
5304
7867
2759
3927
3893
3959
43
8339
7858
359
8871
231
395
3721
7675
2912
203
3894
7909
1663
8848
8667
4694
4879
7934
4195
8753
3965
5091
2109
9737
5143
9427
4574
4064
7709
4530
8361
9607
4862
4836
680
7971
8269
3420
3539
480
6841
3175
8423
7789
9983
8331
3764
293
9648
449
651
9163
843
42
9425
8721
9771
3991
6949
3924
3614
3595
9638
51
8457
3426
401
3141
714
3731
3171
3571
303
63
5163
2201
5114
7967
3809
5188
7111
9344
8862
8601
106
407
3611
9359
4522
8863
6941
3691
2264
205
5462
8814
5159
7771
8272
7929
110
3009
3765
323
5029
4255
8162
3409
4443
605
3979
4502
5569
9961
3604
7719
3814
22
5419
3733
4904
4500
3169
3885
3880
9906
3572
4903
8892
8084
4921
253
9739
3228
7845
3954
715
9608
527
700
6761
5022
3142
311
8852
8394
8081
8968
4415
3401
5136
4685
341
5137
4534
8087
5312
48
5464
47
6149
3596
9759
9815
8412
8221
5793
294
3958
8098
304
3732
8342
4442
62
8345
4444
3766
8948
4021
6661
9609
9782
9941
7742
7171
3891
540
5459
9922
7799
8005
8152
332
8201
3863
9984
4241
2103
6496
8937
3922
8319
7833
6029
4104
5305
4511
5201
9449
2621
7847
3926
8291
3521
3322
3844
9391
9915
5592
7851
4639
7672
8314
4011
5994
4671
4582
7901
3789
642
8606
500
7534
3148
8085
109
124
222
9463
4680
4311
4023
3492
503
4610
9462
3193
8016
8843
8181
3868
5792
3787
8135
9634
242
3816
4573
8106
4254
8021
8089
5783
3423
9605
8605
3329
4594
4641
3807
1652
8343
8115
2049
3341
695
5993
3722
3778
3866
24
9353
5839
8672
7939
5179
3775
8245
3886
2724
5474
5121
3241
3955
3324
8212
6094
5164
9627
8349
3887
4041
5789
7071
4389
7922
9702
39
5341
2162
5784
9729
5424
3749
7915
3895
3771
6816
4514
3527
4651
4251
5123
7691
852
5212
4469
851
3164
5411
441
688
9229
5185
3821
3512
6902
3472
7767
8939
3782
8623
524
5187
6959
4719
740
5011
3973
5183
5300
2757
857
3422
3961
8455
5380
8876
8879
7902
287
2592
5194
8963
6141
4232
3199
8762
5451
8385
686
9919
9227
8723
9723
5069
4945
3806
61
2001
5631
8689
8919
8192
9670
4542
8607
9357
8103
131
7937
7669
8209
3471
9803
9659
613
5122
101
4461
9977
9224
5717
5651
3524
8117
5781
5132
489
10
7907
3320
7853
4519
7779
5771
2171
3239
8709
1424
3777
3452
4439
3321
5421
3897
5051
3619
3482
291
315
4103
4462
9907
5909
966
3561
5553
7693
8959
9851
8626
5461
5423
3925
392
427
2502
3393
44
7077
8415
4429
3776
7552
3883
4252
3570
409
8893
5104
280
7745
325
4432
3942
9204
8521
204
292
4242
3943
3499
5061
5749
8589
9923
3602
8107
102
3343
4543
526
9465
3451
609
8157
3999
3932
9905
324
5211
282
8838
6951
4863
5501
6739
2632
3528
7664
7679
3514
4632
5102
9952
8229
2811
4611
5359
2749
4503
3834
310
3865
4022
3930
544
8744
9712
9672
202
8949
4223
125
3929
8411
8594
3378
4871
5795
4681
9341
6632
3795
8401
9903
326
3833
3785
153
7837
3179
4467
3993
5012
3328
3198
5351
7903
7932
3459
415
3812
8961
4054
8965
3952
9920
9929
3772
5162
4466
8703
8926
5280
4824
4701
7782
9755
4601
4341
8627
7692
5493
4621
9764
4513
9971
881
4042
5593
3613
7785
8051
5296
9356
7931
7906
8769
8952
8014
4575
8163
4512
5524
3399
4881
4572
8628
3845
1434
3403
4319
4533
8772
6996
114
9972
1755
863
3884
5361
3606
3712
64
7961
4292
611
859
8134
8222
3522
7803
4995
3427
481
3898
7775
8779
5822
5252
8076
4823
4524
562
251
3711
4059
7936
8775
5503
3951
8662
9394
8099
741
8165
9910
8309
8944
9749
4593
1151
3783
3553
9342
3971
3473
2279
3605
1649
5113
8841
5979
3339
9626
8542
2241
53
91
8751
3525
3950
3699
5349
9904
8855
71
8964
430
2311
9614
8922
8414
4620
3923
3327
7969
9914
8026
7819
1474
4528
3162
3899
4422
8418
3815
4258
9636
7818
3889
9959
4825
8962
270
8873
7676
151
9606
8422
2630
343
2219
7805
864
54
9543
3990
7791
8179
762
7739
9396
7905
4449
4132
8847
4131
7963
9978
8604
3963
9623
9733
72
5303
5111
9354
445
5732
8311
5551
7912
5472
7765
4613
9917
7561
3491
8932
3143
9701
3607
9671
184
3761
9921
7697
9468
2172
7919
9995
4571
9744
52
7916
625
3484
4693
3838
8332
8842
4709
3593
5151
353
7807
8671
212
17
722
3601
8845
8851
5141
7748
8101
689
5671
8146
403
3229
5554
8451
9999
7804
3424
1681
6839
5213
2501
6859
9820
9714
4662
9601
9751
66
5492
8675
3972
16
1682
346
4643
9802
570
8382
8776
623
7813
7911
302
7841
8375
8039
9804
3201
5642
8611
9741
3888
9754
7731
9928
543
3829
15
8854
5502
8866
7769
1281
9912
46
639
5684
7773
8596
2188
5124
3616
780
3727
8764
8102
6561
9604
132
8256
4672
8622
8861
402
9955
5259
3808
3774
7678
3174
554
28
8108
3957
9756
4679
9982
9753
3974
4399
9900
3533
5412
7749
4946
681
33
3962
4431
781
243
5302
412
9909
435
8153
9602
3391
331
7815
234
7968
9705
3550
4282
8364
3892
8864
299
9814
3966
632
5251
734
5019
7857
13
8763
4105
3479
8669
118
3532
8803
3843
139
3523
5184
9975
8244
221
34
3794
8011
3846
3326
4901
41
4576
4993
3404
3998
4561
8602
7023
4949
8388
6601
206
539
7817
7987
8013
8659
7760
7925
9788
9911
5718
7861
8674
5282
8543
7848
3552
9653
806
8609
9901
3803
485
5425
684
9633
743
3144
4413
7914
8853
1879
2102
8006
942
8969
4674
5995
3941
8857
5841
3531
3029
4595
7933
9969
4224
5209
4869
11
9979
5463
6549
40
7777
5652
3822
1631
5581
5475
458
610
8321
8171
4563
8761
5301
5112
6909
2319
8683
8774
443
3736
7849
50
394
3723
8856
5169
586
6662
8914
309
7788
9981
1609
32
8867
4673
7865
7868
2242
8151
5321
8874
9902
3612
3603
8860
8456
8083
3615
5794
8402
7092
7711
8875
211
9355
602
7869
5586
8801
159
8472
374
8302
4541
8554
4579
8541
4882
7674
9939
9618
3799
3779
8365
5499
4525
3728
5311
5641
8145
7309
5719
1149
999
9962
8844
7962
5491
560
2742
5101
4289
3818
4562
5682
7976
9390
4438
7747
8891
8086
721
4233
6449
9635
5293
4591
6011
8741
8191
8211
3220
7761
2101
7974
3392
4603
7866
2181
5110
9963
7966
5103
94
4281
5198
4211
4623
9974
3791
12
4682
55
390
2041
8452
8257
8754
7024
3953
8175
9762
7764
8661
3402
850
8663
4652
4499
7935
8945
8174
3725
3551
8960
3781
2309
8138
8105
3631
704
8938
3173
3931
3724
387
7741
8172
2751
640
3949
529
4287
8154
239
7074
8603
3425
782
885
6952
8395
5310
3348
5498
92
889
5902
9703
7768
7913
3995
6563
4875
8132
4642
8686
295
9652
4516
391
3726
3511
65
7823
75
8865
7781
3805
7917
45
4849
3964
93
8849
9656
7926
7855
598
4142
3956
3797
7965
8164
3804
