3765
5059
43
4832
611
8201
9983
1151
3848
4516
4603
689
55
6549
2263
704
3957
3348
9390
5103
8721
9391
8744
3799
8622
4823
4651
3814
6563
4103
458
7845
8107
5771
8603
8339
695
9975
4422
9356
5302
2188
4431
7848
8844
9904
66
4575
8365
5995
5209
7968
6149
3699
4881
243
1149
8949
8209
7902
9755
7773
3327
5124
524
3805
3838
1755
9754
686
4904
5123
5110
9906
4879
4623
4011
412
9923
4105
3199
435
688
8751
5252
8803
3539
4610
8867
9204
14
394
4399
4497
5472
3899
4836
3791
5282
3532
7771
8115
7675
3378
2912
8321
52
3725
3779
4462
6011
4500
5464
9756
303
4041
4592
5586
3818
4513
309
9342
3533
4042
71
5749
3956
4511
3524
3596
8154
343
3943
7803
4525
270
8221
8309
9635
4022
5474
3895
5143
8423
3420
2041
5136
8663
5569
3614
9606
2241
211
2742
8135
7711
3822
7917
7905
4461
2109
9634
33
3341
390
7779
8521
3220
3144
287
7859
8388
5783
3891
3884
1474
9900
5751
3778
8472
4104
3886
639
331
3950
850
206
3179
8864
6761
8689
4573
7853
8229
3499
323
7868
7309
5993
8874
8106
3320
7837
341
7962
9605
4131
741
3523
7764
3998
110
3602
3734
4582
8245
4680
3866
7969
325
8937
5303
8892
539
5185
3511
3162
7869
3451
184
8926
7903
3863
3963
332
3479
5501
7024
4223
3958
9919
9961
5312
124
8776
9627
863
1652
9396
2311
5137
3926
3809
8402
9995
6661
9653
4255
39
8146
7534
233
5304
445
8694
253
3606
441
92
2049
3616
7791
7833
8345
3942
44
3867
3949
8965
387
8948
4282
395
9962
8854
4601
5651
7777
4869
48
5979
4251
280
5183
3787
114
3399
3804
5795
6662
7799
9602
4862
3795
7912
3148
131
9659
3844
8659
8969
3889
3326
7552
4949
63
4542
8772
8945
6739
4503
5462
8083
3393
782
8422
1434
7936
3605
3491
2759
8762
7987
5503
5902
3493
46
4064
5718
2162
3927
392
7747
3527
3882
5551
5424
6632
4389
3424
5341
3561
3930
537
966
4233
2502
3409
8395
3995
17
9163
7742
9626
3604
8417
8865
9357
5717
2319
8051
3749
8361
8723
4863
5491
8857
1631
5187
3785
204
6839
8222
7937
8589
45
4195
4429
4945
8686
9737
125
212
9971
102
8164
8774
714
3761
8872
8841
299
8606
94
4534
5412
391
8157
7847
5112
1424
625
5732
3164
222
3783
3322
543
3521
9705
9963
4524
4621
7971
123
8314
9604
9907
4672
3421
205
5794
4993
5061
109
2811
4224
2757
22
7077
554
3423
9952
3898
5682
3571
5121
9915
4502
4533
234
324
4439
9929
3979
5459
3615
353
3964
4241
2551
65
202
8331
8343
8848
8382
8871
7692
7815
4639
3766
3528
8349
153
4319
407
5159
7934
5463
9465
9802
12
5201
7804
9982
734
8084
7748
4694
4825
3961
8414
402
3459
9902
3328
4563
8763
34
2632
8605
8627
3925
1609
3531
3797
8623
7819
7922
3893
2101
203
3808
7916
9344
101
4572
7023
6941
5553
415
7789
3492
7913
28
857
8851
4252
9972
5111
5671
503
4443
7678
7911
3553
9925
5019
8671
50
8014
7109
9941
3762
5179
3142
9712
9609
8607
4641
4522
9753
4023
4438
4528
9703
8601
3777
8667
75
7974
7935
3991
6141
9714
2103
292
4413
9999
5789
8145
5122
3816
8452
304
4682
9723
7861
242
8172
5162
5461
3789
8244
3894
6816
7857
7697
3392
7761
4059
6996
8914
4467
7906
8801
2621
4903
9771
5642
346
3815
4946
7768
5349
8814
4211
9917
4701
9749
3522
4466
9468
3329
5012
9978
251
8153
3888
7932
10
681
3731
4469
5022
7858
4676
315
885
47
5280
3722
8852
9607
9353
8775
4662
7864
4594
3603
8364
7679
9959
1879
8181
4620
4643
9733
7807
8543
8609
8879
3843
7741
6094
8457
16
4824
5421
9741
7931
9955
7818
8761
632
8039
781
3141
5359
3955
3846
5784
5222
4281
2751
3129
3781
8342
9939
7676
544
8085
598
3973
8098
6601
651
3807
8703
762
8893
3169
5380
3965
7963
9851
41
3239
7929
359
3990
8171
7909
3570
623
8401
5351
610
2001
843
7050
5102
7731
5581
8876
3029
3404
7674
8596
7961
7664
5909
8086
5259
7813
8661
485
4054
8105
2102
42
4571
3514
8016
4287
8163
7851
5792
4613
5301
9914
7561
2279
6449
806
4449
3171
684
3595
4561
5499
5781
5592
3774
504
9974
3201
700
449
9702
4675
5311
437
106
3954
9804
715
3733
4512
4574
3883
4719
4679
11
7760
5296
3425
6841
8675
8089
4562
9782
7171
9355
8099
231
3887
9729
4681
5361
3999
500
9618
3833
1681
8165
9652
3009
53
540
4432
3966
3865
9633
5213
8855
8769
5101
8845
427
529
8863
8179
9427
6952
5069
9227
2749
9425
3691
3929
8162
8104
7788
3550
443
8011
5305
3426
7915
6561
4519
3794
8005
4258
8843
6496
8081
889
2724
9354
9601
9636
3422
5419
310
5504
2219
9901
409
5164
113
6829
3726
4543
3143
3572
3974
5194
864
24
9623
8932
3525
8132
5411
3631
7719
480
5300
4642
294
4871
721
3941
5719
4611
9229
851
4671
8554
3953
740
5684
3806
4875
8211
5841
3834
2592
8866
9977
5593
9649
5793
7966
7775
8415
527
403
5169
8741
8541
3845
326
9903
9909
9759
5994
132
9921
8412
7866
7709
9224
2181
9910
2169
8826
3324
8456
8180
8875
3971
8212
859
8962
9814
8311
7672
8662
8418
3993
3821
3923
3228
6959
3402
3732
3728
8013
4709
9543
379
642
8853
5114
4254
562
9656
5151
8968
3484
570
7691
3403
9815
5492
4921
3512
8101
4901
5631
8683
139
3174
722
3613
3552
8961
8673
5104
9449
4693
9394
7914
8860
9960
3241
869
7926
8944
2242
8753
3951
8087
5141
8919
15
8842
159
5425
3339
8108
8385
4673
4685
5184
8595
5523
40
3343
999
5495
344
8960
4632
8175
7785
3321
7769
62
4021
7976
7939
3803
282
5641
8102
9922
7749
7765
4995
7967
8764
7805
942
295
8394
8455
8103
5423
8542
3924
7111
3931
8594
3391
302
8302
8939
481
6029
8174
291
8611
3764
8256
4882
1682
609
8411
9803
4292
7669
6949
4530
3724
5652
9751
3452
3721
4595
4415
5212
8938
3736
5451
8192
3712
2172
72
8873
8134
9547
3198
9911
5524
7767
9614
3885
4493
3551
4029
7865
8861
3776
8138
9670
5113
5310
2501
4849
7933
3772
5198
4593
4132
8779
4289
526
8856
7739
4652
64
3723
8451
3711
430
9788
2309
8257
8959
9928
5091
3880
8291
3775
9905
3932
7907
3812
5011
3829
118
472
5369
683
6951
2201
9981
3229
8626
2630
3541
8272
13
8862
8604
3471
7693
743
4499
9701
3972
7975
8922
3483
8269
4232
8963
9341
4523
5475
7855
1281
4591
4576
3962
6859
9359
370
7901
9920
2171
3771
640
8151
4242
7841
3593
8152
8891
9739
3897
3401
8754
9172
5163
3472
4674
3619
5822
3482
5498
7781
9608
54
5051
9648
613
9672
3175
3922
3323
5251
8026
8117
3193
8847
5554
91
9638
3782
2264
7849
8191
7823
586
3611
3173
4541
293
3601
3868
9820
8332
5321
489
4311
239
5211
8952
8602
8021
9463
6902
9762
9764
4341
560
7925
5132
3473
8672
5839
8838
7745
5188
1649
4514
602
3612
8375
5502
4142
9462
93
7817
8319
881
9912
7092
221
3892
7074
680
4442
9979
7782
8964
8674
8006
9671
3427
5029
5493
311
7867
7919
4579
374
6909
4024
3959
151
32
3607
605
3952
9984
51
852
780
1663
8669
9744
9969
8849
8076
61
8628
7965
7071
8709
401
3727
4444
5293
