2551
7693
864
123
4595
4662
9359
9670
231
5424
8452
2049
2724
4673
3699
4946
9357
5252
4528
33
8085
4041
8174
740
8841
8960
3732
8949
4251
5732
9815
9901
211
7749
4573
53
3424
1652
8867
5124
2263
3951
3148
8414
251
14
8855
5321
8135
527
4709
7815
3926
9952
4399
5114
3511
2279
8965
4415
3423
8627
3179
3727
8345
625
8098
3141
4611
5499
806
9739
8848
9653
5475
4641
3894
3803
7902
3777
4503
6951
9903
966
8472
9626
331
8134
7963
4881
5751
8269
8382
8104
64
32
2264
7804
4561
294
8663
7915
113
4613
4311
102
8861
9396
9224
7719
4694
2219
8856
3323
7869
6739
1682
7935
5369
8661
5593
3493
7853
9465
7961
9972
3611
3129
5349
9917
7967
2742
3821
4493
7906
623
4499
7969
4681
4502
3726
8401
9604
3771
9979
8361
5137
5569
4672
7745
4823
3484
9659
8181
3320
9614
3889
9939
9543
8423
8814
734
9804
7676
8051
3473
403
391
3812
9671
8959
9919
3958
9705
8874
7841
7905
5141
4869
3341
8762
3953
3404
8145
7858
5164
8152
6563
3522
2109
9607
5305
2912
304
4675
4054
3929
3198
3451
7855
4945
7817
9547
500
4224
7857
8151
7024
9648
8721
212
75
7788
7768
309
7775
8866
5179
3711
346
3391
7805
4576
65
3816
5671
4443
109
9961
9983
5495
4543
8891
5103
8964
3169
3343
9741
4011
7748
5259
7692
8857
683
4413
9635
9923
2241
3552
9355
3749
8926
4601
8763
7171
9974
3833
9391
4621
5029
6561
472
4461
124
3613
3596
55
16
7773
4652
8138
869
9788
7552
9922
7925
5293
8844
537
7867
5194
8851
8102
6841
6029
8321
8343
3961
8607
40
205
48
4242
3806
239
743
4643
3550
3930
9229
7837
5301
5187
315
5012
6149
3927
9701
3459
5296
92
43
1609
3778
5789
9929
610
7819
3533
394
4024
3392
8153
5022
8154
9702
3164
409
7813
782
524
3924
5303
295
3815
4042
4620
7937
3950
9172
3521
2811
4533
3844
7907
3532
885
9425
8842
9703
5412
2502
3775
4195
8165
8086
9803
8117
353
62
3952
3721
8543
4241
4429
7901
3725
302
407
3809
1151
3822
9341
8601
4862
5631
9909
3972
7931
8211
3162
9759
8938
282
7909
4863
8914
5183
7803
3427
8689
374
7865
1663
3327
3863
3962
3399
7868
680
3322
8622
850
8611
4432
5554
8606
8945
379
7917
688
7919
7781
5462
4467
9618
5795
9390
9672
4849
8604
7916
3324
3895
700
7789
202
5792
3848
3201
8673
3531
9627
3765
8662
4292
41
4623
3514
8319
3403
3421
5493
8302
6661
131
5781
4438
6996
7782
8457
7939
4233
8932
7309
613
3979
8016
9609
3973
359
206
9344
332
4674
8764
9756
489
9911
8853
8272
395
5651
3932
3956
4594
5524
4132
5498
5771
3964
852
5504
8952
7691
8845
7975
8919
4679
8394
3892
4632
8753
8146
1281
4131
287
325
443
9749
203
5132
3615
5451
9904
8107
3241
999
9427
7847
7761
8542
6816
8626
2169
8541
8103
7845
9907
8076
8754
7936
4524
7785
7050
1149
3326
9753
42
52
8418
3971
4610
8961
8843
7962
9915
8774
13
3724
3471
3499
8179
8962
5211
2102
3991
3922
4059
243
7833
435
437
3525
61
3998
323
8968
3733
684
63
8422
4289
8871
234
3965
9999
3479
4319
3736
310
3887
4572
106
3722
5523
3551
3782
9802
4064
3604
8212
8209
6601
3776
3995
4836
8081
5581
3528
5310
5902
9969
7109
942
3783
2319
7859
8849
8872
9902
9163
6941
3797
602
7818
5162
8847
5592
7678
5995
6094
3393
7932
586
2751
93
9905
3605
5059
3867
3553
605
8803
9354
4882
3898
4592
3963
5185
3829
9955
9914
7765
5491
3999
4525
5188
7534
4642
2242
7669
5463
4639
539
8865
7913
34
7966
8723
3814
9910
441
280
311
3512
344
8922
8602
481
66
3791
4904
341
7799
458
8365
8609
91
6761
293
204
7672
242
6902
4282
3772
8388
8172
7071
45
570
9971
8417
3808
5136
8969
8862
881
7111
9723
8364
6011
5361
5794
3561
9733
5111
4021
9656
3774
9636
4258
3764
8779
3401
3990
8385
9712
6949
3616
15
51
6859
8860
8451
5104
4693
9981
9962
3787
8412
9920
11
543
8854
7779
5502
540
722
114
8667
8164
1879
3595
402
5282
5551
46
9960
7823
5459
5251
9762
5411
2309
8349
686
4603
7077
8115
9729
72
8375
5979
7987
9638
3942
3838
5718
715
9462
8703
8683
4542
159
5011
5841
3409
9959
7739
5503
689
7675
7926
3570
9764
9982
3959
859
7664
8192
3602
3834
9227
9963
4593
5311
9634
3321
8222
8163
5419
7679
343
24
4500
5121
7965
3807
4422
3931
5425
5359
526
3885
3818
3523
4252
3601
9755
270
449
7742
8589
4541
3328
503
3723
7769
8937
3761
427
8309
7971
9921
3539
5682
8157
430
3865
7912
7849
5069
9900
7864
3144
485
4701
5472
151
3893
4442
9744
3957
4439
8006
695
8761
5222
8455
8775
4449
47
7968
153
9975
3541
8026
7922
2501
5113
8838
3731
4824
4516
5749
3472
7731
3846
8245
851
4575
863
5110
598
9623
9737
8672
8180
3143
741
4871
2621
3794
9606
2630
9356
3949
4029
4223
8175
5719
544
3603
8669
8873
3886
8671
554
324
392
3734
4562
8101
222
857
8864
6839
8021
4023
50
3606
7777
5461
4103
4431
3425
5061
125
8083
3888
7771
5209
6959
7074
3799
640
3795
7674
6549
4466
9820
299
6829
7976
3712
412
4651
5501
8939
3941
4719
3175
7911
843
387
8893
2757
2632
3173
5019
8099
8675
3524
8332
2103
2101
7807
4105
253
184
5123
22
8751
8005
3492
3571
3891
8674
4671
3348
44
3897
9977
3229
5212
8395
4513
4511
8659
3631
9601
5159
2001
5300
303
390
8339
2592
1681
3805
3781
5143
9633
8605
9941
4444
8314
7903
4022
3482
5423
9925
4497
4901
9906
9928
3142
7561
9468
5351
8411
3572
5091
3527
2172
8554
5492
3614
2181
6632
3880
560
9771
3174
1424
3491
3845
415
3612
4949
5102
9782
8415
8628
4523
9608
5474
5464
4281
562
9605
4685
118
5652
3789
9649
3029
3199
8741
3766
889
9751
4341
370
8229
8105
9912
5302
3422
5169
8201
4579
7764
8244
5839
8108
8256
4574
17
8106
291
7929
9978
5184
5994
8162
8944
7791
8191
3228
5421
9984
2041
5101
139
5198
9602
3925
5151
3607
5122
3193
4389
8776
6909
8852
8257
2749
2171
4591
8402
7767
8623
4522
4254
2759
7933
9353
3883
609
4921
5380
12
3619
