8452
4881
2103
5187
9342
8456
6829
7906
4443
8103
9602
8842
4823
8723
3956
8321
151
5029
7111
3833
503
123
3241
8257
9762
5551
4432
3808
3343
8455
4059
5251
5159
3427
5749
3961
8105
9733
715
4530
8423
3596
3893
5091
310
8659
7855
4399
2172
5164
8201
9904
3572
8181
9737
9224
3607
4921
8694
6816
3884
6941
7937
4643
2263
4623
412
1682
9962
3699
8604
4681
7675
3606
7901
7731
5751
6996
4675
5794
8663
9356
4949
17
851
4639
4871
3425
850
5822
3971
4685
3724
3778
3723
9969
8875
8952
435
7764
4242
3923
2742
5651
8774
53
8174
9462
6662
7785
9626
4064
4211
7914
9714
8106
323
11
5841
9172
3895
4662
2309
9929
8101
485
47
5492
8874
4103
4875
222
9623
7976
9851
3965
5302
4439
8849
5361
2279
8744
9941
4142
4541
8081
4574
5994
8417
8867
9803
4449
3459
7749
295
3611
8776
7309
7866
3814
7761
7817
9820
8662
9975
714
4904
4341
9814
4258
6909
8457
3818
859
9605
6951
722
7803
7934
2751
8626
852
3999
4611
544
3327
7092
3736
2724
4232
3141
4524
5474
5523
9744
1424
632
9984
3803
8944
9802
5839
4466
5472
7987
3838
3964
9633
65
359
8339
740
3393
3401
294
2109
864
125
5123
562
889
743
2162
8179
5424
7963
7769
3772
8221
8762
4514
8848
9608
109
4415
7697
3472
7669
4523
6141
8343
3897
9636
9912
8814
3532
8627
881
4573
5012
6561
4104
291
8087
280
9344
5475
4682
9359
7926
3602
5163
7552
415
7864
139
3785
8411
3954
6952
3228
570
3991
885
5061
4528
9390
7050
3570
8961
8212
8919
3727
9754
3533
3732
8864
9920
114
231
5411
3348
8948
684
9163
239
6949
5114
8191
311
5569
8244
7534
6601
5104
7966
9959
5293
394
292
500
9670
3868
8162
9972
4533
1649
3783
9906
8686
8960
7711
8269
441
4311
3193
5684
4429
7902
7929
3898
341
8843
5369
8385
8803
3324
8753
5795
8611
3328
8314
4287
3892
1681
3764
8741
4993
5103
8891
3512
700
8152
605
3378
3531
287
8013
409
7917
3887
8401
5425
7074
5554
8272
9981
45
3484
3775
9979
5593
8962
8863
8602
3029
3482
3320
7936
7919
5504
5553
3891
7837
4499
5641
5642
8772
8291
5179
5652
8541
3143
9547
5419
7851
3998
10
4422
3995
1434
3804
4462
9923
16
3866
6449
3522
8319
7965
8661
8172
8871
7678
4595
7848
4593
326
5499
8332
7961
7674
4621
7719
4632
9753
221
4223
402
598
3950
681
504
4601
3601
9963
9749
9723
9952
529
8872
5188
4719
9782
7932
3162
3553
5312
63
7912
4131
4461
8394
9638
3341
8157
7845
2188
8596
8857
5194
8932
3201
3799
9974
401
5321
3174
8603
9902
4832
8086
282
9978
8134
7077
5122
3821
780
9911
3846
3551
5296
12
5493
8949
4946
3966
5051
6859
5459
33
843
4467
7971
5781
4592
3972
8099
7922
4292
9756
8014
2169
524
204
554
686
5185
46
3941
41
9788
3952
9635
9771
2101
5019
13
9354
8331
543
8963
3899
3865
2041
392
480
3886
3734
5113
1149
8853
3777
8364
704
9900
2621
4011
7869
3882
8623
3926
5462
4642
9449
7813
3728
9919
3795
8937
131
5011
303
8006
1609
2181
7858
869
3603
8542
8673
8180
9353
8769
6011
8801
8245
3528
8222
5993
5132
4613
7745
7679
7909
7974
3164
9739
651
3809
8026
427
5169
5143
6549
7933
8893
8011
7672
5022
8115
3711
5502
7693
94
781
7742
5412
7868
48
9977
2592
325
3604
8521
212
8005
5631
9705
539
2171
3615
4575
3973
5451
2749
9983
3144
7975
5463
4903
8138
8107
1652
8675
3420
1879
4502
7071
124
3863
3749
3423
9961
9702
251
741
6959
7676
2912
7805
5303
54
270
113
9468
4252
9815
6029
2049
3220
2311
4882
3762
1631
3929
4413
4576
3779
5498
9915
3523
4511
527
4869
3392
3925
3927
7709
9227
5259
8914
344
5137
304
4582
62
9653
32
7561
299
8922
9928
3845
8595
2102
22
3931
3175
8847
4579
2319
7777
8879
8311
387
3726
2201
9672
3550
602
4849
7967
9909
3766
3492
233
3951
9905
2242
2501
7692
609
353
4251
3198
9995
3731
5792
7691
9618
8451
8594
8689
4674
5102
39
205
4522
3806
7823
481
3409
3473
3781
4563
8388
7768
3774
7911
9341
4132
91
2811
5732
3765
3613
7861
782
4562
863
6149
3009
118
9999
4676
4542
7833
9204
8873
44
8342
9357
8855
6761
6632
5124
3552
586
8959
8964
8721
3829
689
9465
3571
8422
4709
9759
7739
4105
40
4513
3421
9427
640
3725
3794
7865
3452
4281
8968
4594
9960
9804
5059
857
3848
8926
3974
9396
3787
4525
6902
7771
9652
8098
9907
639
7968
9955
4319
202
5503
3805
5300
8826
3171
4431
4679
8622
4442
5586
3521
683
3619
3812
5183
9229
9609
3990
9634
3949
331
3424
3932
7804
3993
132
3514
8175
613
8302
302
1663
5209
7925
3605
5349
4282
3943
8209
540
4289
8763
5789
9914
315
6839
4824
110
153
7815
8163
9601
445
72
8605
8414
8051
6094
7819
9903
8669
3789
8171
93
7853
4023
4497
4836
4512
8039
66
8016
625
8945
5421
9604
3326
7789
8775
7935
9922
92
8089
8683
8076
8412
8609
5902
346
4021
8104
8844
8764
7939
7171
5491
7023
4672
3525
9463
4694
8164
4224
8969
7748
7767
9729
5136
343
3822
7907
2632
8703
695
52
8472
4195
106
4254
9659
3791
3843
61
2757
3894
3807
3761
3958
7791
407
9755
5301
5213
4561
374
8841
8349
253
43
5252
611
42
7867
8085
3721
443
4500
379
9712
4024
3402
5793
5909
7913
4042
4995
8554
762
3691
9982
5111
9391
449
8754
489
560
4901
9648
430
3142
71
4693
8135
3179
5501
2630
537
5198
7109
3129
4493
50
3239
3616
8165
4641
3339
4241
7847
9901
5359
9606
8861
5305
3959
8395
806
8418
28
8860
4543
7773
9925
7857
8146
3722
5979
437
8862
2241
3483
8939
2502
206
3957
5719
8589
24
9910
5671
9751
8021
8375
8845
7931
610
1755
999
3539
3885
9355
3963
4591
7779
8852
8132
9649
6496
324
203
7775
102
8606
5771
234
6563
8382
8761
8402
8309
3712
3883
4516
3867
8838
8211
5592
2001
3199
9917
4651
5101
8145
8674
8667
4389
3422
7841
8671
3733
211
3491
5351
458
4610
3880
391
5461
942
7760
7765
3797
3399
8876
1474
8192
2551
9921
4519
7024
9394
3148
3844
3499
293
5464
8851
3924
55
9656
8083
5995
4620
3323
4029
3527
4444
75
3471
6841
3889
5717
3962
8153
7807
9627
403
8361
3524
721
3169
5211
7849
5682
3229
5380
8154
8628
7788
3834
3322
5304
3329
101
3771
7782
7859
7747
3930
5341
4603
3451
4879
3888
8256
4862
3391
3173
8751
5201
7781
4503
9543
370
4255
5069
7818
3321
15
3561
688
4863
8607
5121
9607
8151
242
4054
1151
5784
243
4572
8938
8601
4022
3595
3614
4945
9703
64
5524
3955
7799
34
9425
9971
8866
5783
8965
680
4041
4671
6661
3631
2219
8709
5311
8865
4680
4571
3979
2264
184
5112
5423
3493
5310
8415
7916
3953
5212
3942
3776
14
8229
5184
526
7741
9741
5110
3593
7903
4825
3426
5718
1281
8892
159
5282
5162
3511
4438
7905
395
7969
4673
3815
8543
8108
8345
3541
5141
9939
4652
3404
3782
472
5222
8854
8117
332
9701
2759
3816
8779
4233
3612
51
7664
5581
9671
309
6739
5280
5495
4534
9614
8084
623
9764
8102
4469
5151
966
3922
3479
7915
3403
642
4701
734
8856
7962
8365
8672
390
