2551
310
3887
4572
106
3722
7693
5523
864
3551
3782
123
9802
4595
4662
9359
9670
231
5424
8452
4064
2049
2724
4673
8209
3699
9357
3604
4946
8212
5252
6601
4528
33
8085
4041
3776
3995
8174
740
8841
4836
8081
8960
3732
8949
4251
5581
3528
5310
5902
5732
9969
7109
942
3783
2319
9815
9901
211
7859
7749
4573
53
3424
8849
8872
9902
8867
1652
5124
9163
6941
2263
3797
3951
3148
8414
602
251
7818
5162
14
8855
8847
5321
5592
7678
8135
6094
527
4709
7815
3393
7932
5995
3926
9952
2751
586
4399
5114
93
3511
2279
9905
8965
4415
3423
3605
5059
3867
8627
3553
3179
3727
605
8345
625
8098
3141
9354
8803
4882
4611
5499
806
9739
3898
4592
3963
5185
8848
3829
9653
5475
4641
9955
3894
9914
3803
7765
7902
3777
4503
5491
9903
966
6951
8472
9626
331
3999
8134
4525
7963
4881
5751
8269
8382
5188
8104
64
7534
4642
32
2242
7669
5463
4639
2264
539
7804
8865
7913
34
7966
8663
294
4561
7915
113
8723
3814
4613
4311
9910
102
441
280
311
3512
344
8861
8922
9396
8602
9224
481
7719
4694
2219
66
8856
3323
3791
7869
6739
1682
4904
341
7799
458
7935
5369
8661
8365
8609
91
6761
293
5593
3493
7853
7672
204
9465
7961
9972
242
6902
3611
4282
3129
3772
5349
9917
7967
8388
7071
2742
3821
8172
45
570
9971
8417
3808
5136
8969
4493
7906
623
4499
8862
881
7969
7111
9723
8364
6011
4681
4502
5361
3726
5794
3561
9733
5111
4021
8401
9656
9604
3774
3771
4258
9979
9636
3764
8361
5137
5569
8779
3401
3990
4672
7745
4823
8385
9659
8181
9712
3320
3484
9614
3889
9939
6949
3616
9543
8423
15
51
6859
8814
8860
8451
734
9804
7676
5104
4693
8051
9981
3473
9962
403
3787
8412
391
9920
11
543
3812
8854
7779
5502
9671
540
722
114
8667
8164
1879
8959
9919
3958
3595
9705
402
5282
8874
7841
5551
7905
5141
4869
3341
46
9960
7823
8762
3953
5459
3404
8145
5251
7858
9762
5411
2309
8349
686
8152
6563
3522
5164
2109
4603
9607
7077
8115
9729
72
5305
8375
5979
7987
9638
2912
304
3942
4675
3838
5718
4054
3929
715
3451
9462
8703
3198
7855
4945
8683
7817
4542
9547
159
5011
4224
7857
500
5841
3409
9959
8151
9648
7739
7024
8721
212
5503
689
75
7788
7675
7768
309
7926
7775
5179
3711
346
9764
3570
8866
3391
7805
9982
4576
3959
65
3816
5671
859
7664
4443
8192
3602
9961
9983
3834
9227
5495
4543
109
9963
8891
5103
8964
3169
3343
9741
4593
4011
7748
5311
3479
9634
3321
5259
8222
7692
8163
5419
8857
7679
343
24
683
4413
9635
9923
4500
5121
3552
7965
2241
3807
4422
3931
9355
3749
5425
5359
526
8926
3885
3818
3523
4252
3601
9755
4601
8763
7171
9974
270
449
3833
9391
7742
4621
5029
6561
472
4461
8589
124
3613
3596
4541
3328
503
16
55
3723
7769
4652
7773
8937
8138
3761
869
8309
427
9788
7971
7552
9921
3539
5682
8157
430
9922
7925
5293
3865
8844
7912
7849
537
5069
9900
7864
3144
485
4701
7867
5472
5194
151
3893
8851
8102
6841
4442
8321
6029
9744
8343
3961
8607
3957
40
205
48
4439
4242
8006
695
3806
239
8761
5222
8455
743
8775
4643
4449
3550
3930
47
7968
9229
7837
5301
153
9975
3541
5187
8026
7922
2501
5113
315
5012
3731
8838
4824
4516
5749
6149
3927
9701
3459
3472
5296
92
43
1609
3778
5789
9929
610
7819
3533
7731
394
4024
3392
3846
8245
851
8153
4575
863
5110
598
5022
9623
8154
9737
9702
8672
8180
3164
3143
741
409
7813
4871
782
524
2621
3794
9606
2630
3924
9356
5303
3949
295
4029
4223
8175
5719
3815
544
4042
3603
4620
8669
8873
3886
8671
554
7937
324
3950
3734
4562
392
8101
9172
3521
222
2811
857
8864
6839
4533
3844
4023
50
7907
3532
8021
3606
885
7777
9425
8842
5461
5412
9703
2502
3775
4195
8165
8086
9803
8117
353
62
4103
4431
3425
5061
125
8083
3888
7771
3952
5209
6959
3721
8543
4241
4429
7074
3799
7901
640
3795
7674
6549
3725
302
407
4466
9820
299
3809
6829
1151
3822
7976
3712
412
9341
8601
4651
4862
5501
5631
9909
8939
3972
7931
3941
4719
8211
3162
3175
9759
7911
843
387
8938
8893
282
2757
2632
7909
4863
8914
3173
5019
5183
7803
8099
3427
3524
8332
8675
8689
2101
2103
7807
4105
253
374
7865
184
1663
3327
5123
3863
3962
22
8751
8005
7868
680
3399
3492
3322
3891
3571
8674
8622
3348
44
4671
3897
850
8611
3229
9977
5212
8395
4432
5554
4513
8606
8945
4511
379
8659
7917
688
7919
3631
9601
5159
2001
5462
4467
7781
5300
303
390
8339
2592
1681
9618
3805
5795
9390
9672
3781
8604
4849
7916
3324
5143
3895
700
9633
8605
7789
202
9941
4444
8314
7903
5792
3848
4022
3482
5423
3201
8673
3531
9627
9925
3765
4497
8662
4292
41
4623
4901
3514
9906
8319
3403
3421
5493
8302
9928
6661
3142
131
7561
9468
5781
4438
6996
5351
7782
8411
3572
8457
5091
7939
3527
4233
2172
8554
5492
8932
3614
2181
7309
613
3979
8016
9609
3973
359
206
9344
6632
3880
4674
8764
560
332
9771
3174
1424
3491
3845
9756
489
9911
8853
8272
415
395
5651
3612
4949
5102
3932
9782
3956
8415
8628
4523
4594
5524
9608
5474
4132
5464
5771
3964
5498
852
4281
5504
8952
7691
8845
9605
7975
562
5380
4685
118
8919
4679
8394
5652
3789
9649
3029
3199
8741
3892
4632
8753
8146
3766
889
1281
9751
4131
287
325
443
9749
203
5132
4341
370
8229
8105
9912
3615
5302
3422
9904
5451
8107
3241
999
5169
8201
9427
7847
7761
8542
4579
7764
6816
8244
5839
8626
8108
2169
8256
4574
17
8106
291
7929
9978
8541
8103
5184
7845
9907
8076
8754
5994
8162
7936
8944
4524
7791
8191
7785
3228
7050
5421
1149
9984
3326
2041
5101
139
9753
5198
42
9602
3925
5151
52
8418
3971
3607
4610
5122
3193
4389
8961
8776
8843
7962
6909
9915
8852
8257
2749
2171
8774
4591
8402
13
3724
7767
3471
3499
8623
8962
5211
2102
8179
4522
3922
3991
243
4254
435
2759
4059
7933
7833
437
3525
9353
61
3998
323
8968
3733
684
3883
63
8422
4289
8871
234
3965
9999
609
4921
12
4319
3736
3619
