9815
8452
3220
4881
2311
3762
1631
2103
5187
3929
4413
9342
8456
4576
4443
8103
8842
4823
3956
151
5498
3779
9915
8321
3523
503
123
9762
527
4869
3925
3927
7709
9227
344
8914
5551
5137
3808
4432
3343
4582
5251
3427
5749
3961
8105
715
4530
9928
3845
8595
2102
3596
3893
22
3931
3175
5091
8659
4579
8847
7777
2319
8311
387
3726
4399
5164
9672
8879
2201
7855
9904
4849
7967
9737
9224
3607
9909
3492
233
3951
8694
3884
9905
2242
4643
2263
4623
412
7692
609
353
9962
9995
3731
5792
8594
8451
3699
8604
4681
4674
3606
7731
7901
5102
4675
5794
39
9356
17
4639
5822
3971
3806
481
4685
3409
3778
3724
3723
9969
4563
8875
7764
435
4242
3774
9341
3923
2742
5651
53
8774
9462
6662
7785
5732
4064
4211
7914
9714
3613
8106
7861
323
782
4562
863
11
3895
3009
118
4676
4542
2309
9929
9204
8873
485
47
8874
5492
44
4875
4103
8342
9357
9851
8855
3965
5302
8849
4439
5361
2279
8744
4142
4541
8081
4574
5994
8417
8867
9803
3552
3459
7749
3611
8721
8964
8959
3571
4709
9465
7739
7761
7866
4105
3814
40
4513
3421
7817
714
640
9427
3725
3794
7865
3452
4341
4281
8968
4594
9960
9814
857
5059
3848
3818
3974
9396
9605
4525
6951
7771
9652
639
9907
722
7934
9955
2751
4319
202
5503
4611
544
3805
5300
8826
3327
3171
4431
4679
7092
3736
8622
4442
5586
3521
683
3619
4232
5474
3812
4524
3141
9229
5523
9609
9744
3990
632
1424
3803
9634
3949
331
9802
3424
3932
3993
132
3514
4466
5472
613
8302
3964
9633
3605
5349
4282
3943
359
8339
540
3401
294
2109
8763
5789
864
9914
315
110
4824
153
125
5123
8163
562
445
2162
5424
8605
7769
8051
3772
8221
8762
4514
9903
8669
8848
9608
109
3789
7697
8171
93
4023
4523
6141
3897
4836
4512
8039
66
9636
8016
9912
8814
625
8945
8627
5421
9604
881
3326
4573
5012
4104
6561
7789
8775
7935
9922
92
8089
8683
8076
8412
8087
280
8609
9344
5475
346
4682
9359
8104
8844
5163
7939
7171
5491
7023
415
7864
139
3785
8411
9463
4694
3954
8164
6952
3228
570
8969
7767
9729
5136
343
3822
8703
52
9390
4195
4254
7050
8961
9659
8212
3791
3843
61
2757
3894
8919
3807
3727
3761
3958
9754
3533
3732
7791
8864
9920
407
114
9755
231
5411
5213
4561
374
8841
43
3348
5252
8948
611
42
7867
8085
3721
443
4024
239
3402
5793
5909
5114
8191
311
4995
5569
762
3691
5104
7966
5293
394
292
8754
489
560
3868
430
8162
9648
3142
4533
1649
3783
9906
4693
8135
8960
7711
71
3179
54
8686
537
4311
5198
3193
5684
4429
7902
3129
8843
341
50
3239
3616
5369
8803
4641
3324
3339
4241
8753
5795
8611
4287
3328
8314
9606
5359
3892
8741
3764
4993
5305
5103
3959
8891
8395
28
3512
8152
3378
605
4543
9925
8013
3722
7917
437
3887
8401
3483
5425
8939
206
8272
3957
9981
45
24
3484
9910
3775
5593
9979
5671
8962
8863
8021
8845
1755
3029
3539
3885
7936
4591
3963
7779
5553
5504
8852
8132
3891
9649
6496
324
5641
102
5642
8772
8291
5771
234
5179
8541
3143
8382
9547
5419
8761
8309
7851
3998
4516
3712
10
3995
1434
3804
3199
9917
4651
5101
4462
8674
9923
16
4389
3422
3866
6449
7841
3733
3491
5351
4610
3522
458
391
5461
8661
7760
7765
4595
3399
3797
8876
7848
1474
8192
4593
9921
326
8332
5499
7674
4621
4519
4632
7719
9394
221
4223
3148
3844
598
3950
3499
681
504
5464
3601
4601
8851
9749
9723
3924
55
529
9656
8872
8083
5188
4620
4719
3323
4029
3527
9782
7932
4444
3889
5717
5312
63
4131
403
4461
9638
2188
3524
8596
8857
721
3169
5682
3229
5380
3201
8628
7788
3799
8154
3834
401
3322
3174
5304
8603
3329
101
3771
4832
9902
7747
7859
8134
9978
5341
5122
3821
780
3846
3551
12
5296
5493
3451
4603
8949
4946
4879
8256
4862
3966
3391
5051
8751
5459
5201
33
843
7781
4592
3972
8099
9543
4292
370
4255
9756
8014
5069
524
7818
3321
554
688
4863
5185
46
41
9788
3952
2101
5019
13
8607
8331
9354
543
8963
3899
3865
480
9607
242
8151
3886
392
4054
5784
3734
243
4572
8938
8601
8853
3777
3614
704
9900
4011
5524
9703
7869
3955
64
8623
3882
7799
3926
34
5462
9425
9971
4642
9449
5783
3728
9919
5011
131
4041
303
2181
4671
2219
8673
8709
8865
4680
8769
4571
3979
8801
2264
8245
5993
5112
5423
3493
5310
4613
8415
7679
7974
651
5212
3809
3942
3776
14
5169
8229
5184
526
7933
8011
8422
7741
7672
9741
5022
5110
5502
94
3593
4825
3426
5718
8892
781
159
5282
3511
5412
7905
48
7969
9977
4673
325
3604
8521
8108
212
8005
5631
8345
9705
5141
539
3404
3615
4652
4575
2171
3782
3973
5222
5451
8854
9983
3144
3816
4903
4233
3420
8675
4502
3612
51
9671
124
309
3749
9961
5495
5280
9702
4534
8084
8102
623
4469
5151
966
3922
3479
3403
7915
7805
4701
642
2912
8856
7962
113
5303
9468
8365
8672
390
