5059
16
43
4832
611
9983
4824
3848
4516
5421
4603
9741
55
9955
2263
7818
8761
704
632
3957
8039
3348
5359
3141
781
3955
3846
9390
5103
5222
4281
5784
8721
2751
8744
3799
8622
4823
4651
3129
544
8342
3814
8085
458
4103
598
3973
5771
8603
8339
651
3807
8703
9356
762
5302
5380
9851
3965
3169
3239
41
2188
4431
7848
8844
9904
3990
8171
359
66
4575
8365
623
3699
8401
5351
243
4881
8949
843
7902
9755
7050
5102
3327
7731
524
3805
8876
3029
3404
7674
8596
1755
9754
5909
5123
5110
8661
9906
4879
485
4623
4054
8105
2102
4011
42
4571
3514
9923
4105
3199
8016
4287
688
412
435
8163
7851
8751
5792
5252
8803
4613
3539
4610
8867
9204
9914
14
2279
394
6449
4399
5472
3171
3899
4836
4561
3791
5499
5282
3774
504
7771
3201
9702
4675
3378
3725
437
3779
8321
52
4462
3954
2912
715
5464
3733
9756
4512
4574
4719
303
4041
4592
4679
5586
11
3818
7760
4513
5296
309
9342
8675
3533
71
5749
3956
8089
9782
4562
3524
3596
7171
8154
343
3943
8099
231
3887
4525
9729
4681
5361
8221
8309
5474
9652
3895
3420
3009
5136
53
5569
540
3614
9606
7711
2742
8135
4432
3966
3822
7917
3865
7905
9633
4461
2109
9634
5213
8855
33
390
7779
5101
8845
8521
529
8863
3144
8769
9427
6952
5069
9227
7859
9425
3691
3929
5783
3891
3884
1474
9900
8162
8104
3778
7788
4104
443
3886
639
331
8011
3426
3950
5305
206
3179
8864
7915
6561
4519
3794
4573
8005
8843
6496
8081
8229
323
3499
5993
8874
9354
9636
8106
3422
5419
5504
341
7962
9605
2219
4131
5164
113
3523
3726
7764
4543
3143
3998
110
3734
3974
4582
864
8245
24
4680
3866
7969
325
8132
5411
5303
7719
480
539
5300
4642
294
8892
5185
3511
721
3451
7869
4611
9229
4671
5684
3806
4875
3834
9977
5593
9649
3963
5793
7966
8415
527
3479
403
5169
8741
8541
3845
326
9903
9909
4223
5994
3958
9919
9961
132
9921
8412
7866
7709
124
5312
9224
8826
9910
2181
3324
863
8456
9396
2311
3926
5137
8875
3809
3971
9995
4255
39
8212
233
5304
445
8962
9814
8694
3606
8311
7672
92
3616
7791
3993
3821
8345
3942
44
3923
3228
3949
3402
3732
387
3728
8013
8948
4709
642
9543
4282
9962
8854
8853
5114
562
4254
5151
9656
8968
4601
570
3484
3403
5651
7777
9815
4869
5492
3512
48
5631
8683
139
280
114
3174
3804
722
5795
3399
6662
3613
7799
3552
8961
8673
4862
5104
3148
131
9659
9449
4693
9394
7914
3844
8659
8969
3889
9960
3326
63
2242
8753
4542
3951
8087
8772
8945
8919
5141
8842
159
5425
5462
3339
8083
8108
4673
4685
5184
782
8422
1434
3605
7936
8595
5523
3491
40
8762
3343
5495
344
5503
8960
4632
7785
3493
46
3321
4064
5718
2162
7769
3927
392
7747
7939
3527
5551
5424
3882
3803
4389
3424
8102
5641
5341
9922
537
966
4233
7749
7765
4995
3409
8395
7967
3995
17
7805
3604
8103
8417
5423
8865
9357
5717
3924
2319
8051
3749
3931
8594
3391
8939
4863
5491
481
8302
8857
1631
5187
3785
8611
3764
8256
45
609
8411
4195
9803
4292
4429
4530
8686
9737
125
212
9971
102
8164
3724
8774
714
3452
3761
3721
4595
8872
8841
5212
3736
8192
5451
8938
3712
94
8873
4534
8134
9547
5412
5524
7767
3885
3551
391
7865
4029
3776
5112
1424
625
4849
5732
5310
7933
3783
3772
5198
3322
4593
543
3521
9705
526
8856
4524
4652
4621
7739
64
3723
123
430
8451
8314
9604
9907
2309
9788
8959
3421
9928
5794
5091
4993
109
8291
3775
9905
22
2757
3932
554
3812
5011
118
5369
683
6951
2201
5682
3571
9981
9915
3229
4502
4533
234
324
4439
8272
9929
13
3979
8604
5459
3615
353
3972
3483
3964
4241
4232
8963
202
8331
9341
4523
5475
8848
8382
7855
4591
7692
4639
153
4576
4319
370
9359
7901
407
9920
7934
2171
3771
9465
640
12
5201
8151
9802
7841
4242
3593
8152
8084
8891
4694
3897
3961
3401
4825
8754
3459
4563
3328
9902
5163
8763
34
4674
3619
5822
5498
7781
8605
9608
8627
3925
54
3797
8623
5051
9648
3893
613
2101
3808
101
9344
4572
7023
9672
3175
3922
5553
415
7789
3323
3492
28
5251
857
8851
3193
5671
503
4443
8847
9925
9638
3782
5019
2264
50
8014
8191
3762
5179
3142
3611
9609
4541
8607
3601
4641
3868
3220
8332
4023
489
4311
9703
239
3777
8601
8021
7974
7935
9463
9762
6141
4341
2103
560
9714
292
4413
3816
5789
4682
5122
8452
8672
9723
7861
242
5461
5188
3789
3894
1649
4514
7697
3612
4142
5502
7761
9462
93
8914
7817
881
9912
8801
7092
4903
221
3892
4442
9979
5642
346
8964
8674
4946
9671
5349
3427
8814
4211
9917
4701
9749
3522
5493
9468
4466
3329
5012
311
9978
7867
4579
7932
10
374
681
3731
4469
4024
3959
151
5022
4676
315
47
3607
605
5280
3722
8852
9607
3952
8775
51
7864
4594
780
8669
9744
9969
7679
8849
4620
4643
8076
61
8628
8709
8609
8879
401
3843
3727
4444
7741
5293
