8872
9755
4601
344
5495
8627
4341
3323
7692
5493
4621
4513
9971
4029
3848
881
5593
3613
7785
8051
233
5296
9356
437
8769
4024
4676
8014
4675
4523
4575
8163
504
9547
7050
4512
5504
5524
3399
8826
4881
8595
5059
4572
8628
3845
9925
113
3403
370
1434
8673
4319
8772
4533
8417
3882
3762
114
4832
9649
537
1755
5222
863
3884
3129
5361
3606
5369
3712
611
4292
3483
7864
64
5523
8134
8104
3522
4995
8694
7859
9960
14
3421
481
2263
5822
3493
4592
3427
683
3734
5252
123
8076
7867
4823
4524
5304
3927
562
3893
3959
8775
7936
43
8339
5503
3951
359
231
9394
3721
8099
2912
3894
9910
8309
9749
4593
3783
9342
8848
3971
4694
4879
2279
7934
3605
1649
4195
8753
3965
8841
3339
5091
2109
9737
53
8751
9427
3950
4574
3699
5349
9904
4064
7709
8855
71
8964
430
2311
4530
9607
4862
3923
4620
7969
3327
4836
9914
1474
3420
3539
480
3899
3175
9636
7789
7818
9983
3889
8331
4825
3764
8962
8873
151
9606
9648
651
843
8422
42
343
7805
864
9425
8721
54
2219
3924
3614
3990
7791
9638
762
9543
51
7739
9396
7905
3426
401
3141
714
8847
4131
3731
3171
3571
9978
5163
8604
303
63
3963
2201
7967
5114
5303
3809
5188
9354
445
9344
8601
5732
407
3611
8311
5551
9359
5472
8863
7765
3691
2264
4613
9917
5462
3491
3143
8814
3607
7771
9671
8272
110
3009
323
3761
9921
7697
9468
9995
4255
4571
9744
8162
52
3409
4443
605
625
3979
3484
5569
9961
4502
3604
4693
7719
3814
22
5419
3733
8332
8842
4709
3593
5151
353
3169
3885
212
8845
722
3601
17
9906
8851
4903
8892
5141
8084
3954
3228
5671
715
9608
403
527
5022
3142
311
8852
3229
8451
8081
8968
5136
3401
3424
4685
341
5137
5213
9714
4534
8087
5312
5464
66
48
47
5492
8675
3596
3972
9815
8412
8221
5793
294
16
3958
346
4643
3732
8342
4442
8345
9802
4444
570
8382
8948
623
9609
7841
8039
9782
3201
5642
8611
9741
7171
3891
540
5459
9922
7799
9754
8005
8152
6496
4241
2103
9928
7731
543
3922
4104
5502
5305
5201
8854
7769
9449
9912
46
639
3926
8291
5684
3521
8596
3322
2188
7851
3844
9915
3616
780
3727
4639
7672
8314
4011
8102
4671
4582
6561
5994
9604
132
7901
8256
3789
8622
642
3148
109
8085
124
9955
3774
3808
554
3174
4680
4311
8108
4023
28
9463
3957
9756
3492
9462
503
4610
4679
3193
8016
3974
8843
3868
4399
9900
5792
3533
8135
5412
7749
9634
242
3816
4573
8106
681
4946
33
4431
4254
8021
781
8089
5783
9605
243
8605
3329
4594
4641
5302
412
9909
3807
435
5993
3391
331
234
9705
3722
3778
4282
3866
3892
24
8864
9814
3966
8672
632
7939
5179
3775
5251
3886
8245
5019
5474
13
3955
8763
4105
3324
8212
3479
8669
118
5164
8803
3843
139
3523
5184
4041
5789
3887
221
34
4389
39
9702
3794
8011
3846
5341
2162
5784
3326
9729
41
4576
3749
5424
3404
4993
3998
7915
3895
4561
3771
7023
539
206
7817
4514
8013
8659
3527
4651
7760
9788
7861
5718
5123
8674
5282
7848
5212
3552
4469
5411
8609
688
3803
485
9229
5425
9633
5185
3821
4413
3144
3512
7914
7767
8939
3782
8623
524
5187
4719
8853
2102
8969
5011
4674
8857
3973
3029
5300
2757
4595
857
4701
7933
3422
3961
9969
4869
8876
5380
11
9979
8879
7902
7777
40
3822
1631
5475
458
8963
6141
4232
3199
8762
8171
8321
4563
8761
5112
5451
2319
8683
8774
9227
3736
9919
443
9723
5069
394
3723
50
8856
5169
3806
61
5631
6662
8914
8919
8192
4542
8607
9357
8103
131
309
9803
9659
5122
7788
101
613
4461
9981
8867
4673
9977
7865
9224
5717
2242
5651
8151
3524
489
8874
10
9902
3612
8456
8083
3615
5794
4519
7092
7711
7779
5771
8875
2171
3239
7869
5586
8709
1424
8801
159
3777
374
4541
3452
4579
4439
3321
8302
5421
8541
3897
5051
7674
3619
315
3799
3779
4103
8365
5499
4462
9907
4525
3728
5641
5909
966
9962
8844
7962
5491
5553
8959
9851
560
2742
5101
5461
3818
5423
4562
3925
5682
392
44
9390
7747
8891
8415
721
4233
4429
6449
3776
5293
4591
8741
8191
3220
5104
7761
2101
280
325
4432
7974
4603
3942
7866
9204
2181
5110
8521
7966
5103
4242
3943
94
3499
292
4281
5749
5198
9923
4211
4623
3791
12
4682
102
4543
55
526
3343
390
9465
3451
609
8452
8754
3932
9905
324
6951
9762
4863
7764
8661
3514
7679
3402
5102
4632
4652
8229
7935
4611
8945
5359
3725
3551
8960
2309
3834
8105
3865
704
8938
544
3931
8744
3724
387
7741
2751
640
3949
529
9672
8154
239
4287
202
8603
8949
4223
125
782
6952
8395
92
3348
5498
8411
3929
8594
5310
3378
9703
5795
4681
3995
9341
4875
9903
4642
326
8132
8401
8686
9652
3785
4516
153
391
3726
3179
3511
3993
5012
3328
5351
8865
7781
7932
3459
3805
415
3812
7917
8961
45
4849
4054
3952
9920
3964
9929
3772
93
8849
9656
7855
598
4142
4466
8703
3956
5280
3797
8164
4824
3804
